{
  "last_updated": "2026-01-28 08:25",
  "sources_count": 8,
  "articles_count": 56,
  "keywords": [
    "critical security flaw",
    "executive order 14144",
    "windows operating systems",
    "twitter whistleblower complaint",
    "fortios single sign",
    "chinese gambling industries",
    "authentication bypass related",
    "advanced cyber attacks",
    "malicious cyber actors",
    "dire critical rating",
    "close security gap",
    "band security patches",
    "ai generated data",
    "widely available products",
    "visible url signaling",
    "us charges 31",
    "undetectable phishing vector",
    "underlying host system",
    "today we'll dig",
    "strong theme running"
  ],
  "trending": [
    {
      "keyword": "critical security flaw",
      "mentions": 118
    },
    {
      "keyword": "executive order 14144",
      "mentions": 56
    },
    {
      "keyword": "windows operating systems",
      "mentions": 216
    },
    {
      "keyword": "twitter whistleblower complaint",
      "mentions": 502
    },
    {
      "keyword": "fortios single sign",
      "mentions": 2
    },
    {
      "keyword": "chinese gambling industries",
      "mentions": 11
    },
    {
      "keyword": "authentication bypass related",
      "mentions": 2
    },
    {
      "keyword": "advanced cyber attacks",
      "mentions": 8
    },
    {
      "keyword": "malicious cyber actors",
      "mentions": 232
    },
    {
      "keyword": "dire critical rating",
      "mentions": 10
    }
  ],
  "articles": [
    {
      "source": "The Hacker News",
      "title": "Fortinet Patches CVE-2026-24858 After Active FortiOS SSO Exploitation Detected",
      "link": "https://thehackernews.com/2026/01/fortinet-patches-cve-2026-24858-after.html",
      "summary": "Fortinet has begun releasing security updates to address a critical flaw impacting FortiOS that has come under active exploitation in the wild. The vulnerability, assigned the CVE identifier CVE-2026-24858 (CVSS score: 9.4), has been described as an authentication bypass related to FortiOS single sign-on (SSO). The flaw also affects FortiManager and FortiAnalyzer. The company said it's",
      "published": "Wed, 28 Jan 2026 10:19:00 +0530",
      "value_score": 100,
      "value_signals": [
        "CVE mentioned ×2",
        "Active exploitation",
        "Auth bypass",
        "High severity",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "WhatsApp Rolls Out Lockdown-Style Security Mode to Protect Targeted Users From Spyware",
      "link": "https://thehackernews.com/2026/01/whatsapp-rolls-out-lockdown-style.html",
      "summary": "Meta on Tuesday announced it's adding Strict Account Settings on WhatsApp to secure certain users against advanced cyber attacks because of who they are and what they do. The feature, similar to Lockdown Mode in Apple iOS and Advanced Protection in Android, aims to protect individuals, such as journalists or public-facing figures, from sophisticated spyware by trading some functionality for",
      "published": "Tue, 27 Jan 2026 22:24:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Experts Detect Pakistan-Linked Cyber Campaigns Aimed at Indian Government Entities",
      "link": "https://thehackernews.com/2026/01/experts-detect-pakistan-linked-cyber.html",
      "summary": "Indian government entities have been targeted in two campaigns undertaken by a threat actor that operates in Pakistan using previously undocumented tradecraft. The campaigns have been codenamed Gopher Strike and Sheet Attack by Zscaler ThreatLabz, which identified them in September 2025. \"While these campaigns share some similarities with the Pakistan-linked Advanced Persistent Threat (APT)",
      "published": "Tue, 27 Jan 2026 22:15:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "ClickFix Attacks Expand Using Fake CAPTCHAs, Microsoft Scripts, and Trusted Web Services",
      "link": "https://thehackernews.com/2026/01/clickfix-attacks-expand-using-fake.html",
      "summary": "Cybersecurity researchers have disclosed details of a new campaign that combines ClickFix-style fake CAPTCHAs with a signed Microsoft Application Virtualization (App-V) script to distribute an information stealer called Amatera. \"Instead of launching PowerShell directly, the attacker uses this script to control how execution begins and to avoid more common, easily recognized execution paths,\"",
      "published": "Tue, 27 Jan 2026 20:08:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "CTEM in Practice: Prioritization, Validation, and Outcomes That Matter",
      "link": "https://thehackernews.com/2026/01/ctem-in-practice-prioritization.html",
      "summary": "Cybersecurity teams increasingly want to move beyond looking at threats and vulnerabilities in isolation. It’s not only about what could go wrong (vulnerabilities) or who might attack (threats), but where they intersect in your actual environment to create real, exploitable exposure. Which exposures truly matter? Can attackers exploit them? Are our defenses effective? Continuous Threat Exposure",
      "published": "Tue, 27 Jan 2026 17:20:00 +0530",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Microsoft Office Zero-Day (CVE-2026-21509) - Emergency Patch Issued for Active Exploitation",
      "link": "https://thehackernews.com/2026/01/microsoft-issues-emergency-patch-for.html",
      "summary": "Microsoft on Monday issued out-of-band security patches for a high-severity Microsoft Office zero-day vulnerability exploited in attacks. The vulnerability, tracked as CVE-2026-21509, carries a CVSS score of 7.8 out of 10.0. It has been described as a security feature bypass in Microsoft Office. \"Reliance on untrusted inputs in a security decision in Microsoft Office allows an unauthorized",
      "published": "Tue, 27 Jan 2026 16:07:00 +0530",
      "value_score": 100,
      "value_signals": [
        "CVE mentioned ×2",
        "Zero-day ×2",
        "Patch/update",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Critical Grist-Core Vulnerability Allows RCE Attacks via Spreadsheet Formulas",
      "link": "https://thehackernews.com/2026/01/critical-grist-core-vulnerability.html",
      "summary": "A critical security flaw has been disclosed in Grist‑Core, an open-source, self-hosted version of the Grist relational spreadsheet-database, that could result in remote code execution. The vulnerability, tracked as CVE-2026-24002 (CVSS score: 9.1), has been codenamed Cellbreak by Cyera Research Labs. \"One malicious formula can turn a spreadsheet into a Remote Code Execution (RCE) beachhead,\"",
      "published": "Tue, 27 Jan 2026 16:06:00 +0530",
      "value_score": 84,
      "value_signals": [
        "CVE mentioned",
        "RCE ×4",
        "High severity ×2"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "China-Linked Hackers Have Used the PeckBirdy JavaScript C2 Framework Since 2023",
      "link": "https://thehackernews.com/2026/01/china-linked-hackers-have-used.html",
      "summary": "Cybersecurity researchers have discovered a JScript-based command-and-control (C2) framework called PeckBirdy that has been put to use by China-aligned APT actors since 2023 to target multiple environments. The flexible framework has been put to use against Chinese gambling industries and malicious activities targeting Asian government entities and private organizations, according to Trend Micro",
      "published": "Tue, 27 Jan 2026 14:31:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "OpenAI's ChatGPT ad costs are on par with live NFL broadcasts",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/openais-chatgpt-ad-costs-are-on-par-with-live-nfl-broadcasts/",
      "summary": "OpenAI plans to begin rolling out ads on ChatGPT in the United States if you have a free or $8 Go subscription, but the catch is that the ads could be very expensive for advertisers. [...]",
      "published": "Tue, 27 Jan 2026 19:04:45 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Fortinet blocks exploited FortiCloud SSO zero day until patch is ready",
      "link": "https://www.bleepingcomputer.com/news/security/fortinet-blocks-exploited-forticloud-sso-zero-day-until-patch-is-ready/",
      "summary": "Fortinet has confirmed a new, actively exploited critical FortiCloud single sign-on (SSO) authentication bypass vulnerability, tracked as CVE-2026-24858, and says it has mitigated the zero-day attacks by blocking FortiCloud SSO connections from devices running vulnerable firmware versions. [...]",
      "published": "Tue, 27 Jan 2026 18:19:42 -0500",
      "value_score": 100,
      "value_signals": [
        "CVE mentioned",
        "Zero-day ×2",
        "Active exploitation",
        "Auth bypass",
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Chinese Mustang Panda hackers deploy infostealers via CoolClient backdoor",
      "link": "https://www.bleepingcomputer.com/news/security/chinese-mustang-panda-hackers-deploy-infostealers-via-coolclient-backdoor/",
      "summary": "The Chinese espionage threat group Mustang Panda has updated its CoolClient backdoor to a new variant that can steal login data from browsers and monitor the clipboard. [...]",
      "published": "Tue, 27 Jan 2026 17:26:26 -0500",
      "value_score": 34,
      "value_signals": [
        "Backdoor ×2"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "WinRAR path traversal flaw still exploited by numerous hackers",
      "link": "https://www.bleepingcomputer.com/news/security/winrar-path-traversal-flaw-still-exploited-by-numerous-hackers/",
      "summary": "Multiple threat actors, both state-sponsored and financially motivated, are exploiting the CVE-2025-8088 high-severity vulnerability in WinRAR for initial access and to deliver various malicious payloads. [...]",
      "published": "Tue, 27 Jan 2026 14:38:24 -0500",
      "value_score": 34,
      "value_signals": [
        "CVE mentioned",
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Nike investigates data breach after extortion gang leaks files",
      "link": "https://www.bleepingcomputer.com/news/security/nike-investigates-data-breach-after-extortion-gang-leaks-files/",
      "summary": "Nike is investigating what it described as a \"potential cyber security incident\" after the World Leaks ransomware gang leaked 1.4 TB of files allegedly stolen from the sportswear giant. [...]",
      "published": "Tue, 27 Jan 2026 11:45:46 -0500",
      "value_score": 40,
      "value_signals": [
        "Ransomware",
        "Breach/leak"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Critical sandbox escape flaw found in popular vm2 NodeJS library",
      "link": "https://www.bleepingcomputer.com/news/security/critical-sandbox-escape-flaw-discovered-in-popular-vm2-nodejs-library/",
      "summary": "A critical-severity vulnerability in the vm2 Node.js sandbox library, tracked as CVE-2026-22709, allows escaping the sandbox and executing arbitrary code on the underlying host system. [...]",
      "published": "Tue, 27 Jan 2026 11:35:29 -0500",
      "value_score": 44,
      "value_signals": [
        "CVE mentioned",
        "High severity ×2"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "US charges 31 more suspects linked to ATM malware attacks",
      "link": "https://www.bleepingcomputer.com/news/security/us-charges-31-more-suspects-linked-to-atm-malware-attacks/",
      "summary": "A Nebraska federal grand jury charged 31 additional defendants for their involvement in an ATM jackpotting operation allegedly orchestrated by members of the Venezuelan gang Tren de Aragua. [...]",
      "published": "Tue, 27 Jan 2026 11:27:04 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "From Cipher to Fear: The psychology behind modern ransomware extortion",
      "link": "https://www.bleepingcomputer.com/news/security/from-cipher-to-fear-the-psychology-behind-modern-ransomware-extortion/",
      "summary": "Modern ransomware has shifted from encryption to psychological extortion that exploits fear, liability, and exposure. Flare shows how today's ransomware groups weaponize stolen data and pressure tactics to force payment. [...]",
      "published": "Tue, 27 Jan 2026 10:02:12 -0500",
      "value_score": 52,
      "value_signals": [
        "Ransomware ×3",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
      "link": "https://krebsonsecurity.com/2026/01/kimwolf-botnet-lurking-in-corporate-govt-networks/",
      "summary": "A new Internet-of-Things botnet called Kimwolf has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf's ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.",
      "published": "Tue, 20 Jan 2026 18:19:13 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×2"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, January 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "published": "Wed, 14 Jan 2026 00:47:38 +0000",
      "value_score": 40,
      "value_signals": [
        "Patch/update ×2",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Who Benefited from the Aisuru and Kimwolf Botnets?",
      "link": "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
      "summary": "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we'll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf's spread.",
      "published": "Thu, 08 Jan 2026 23:23:43 +0000",
      "value_score": 20,
      "value_signals": [
        "Botnet"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "The Kimwolf Botnet is Stalking Your Local Network",
      "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
      "summary": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.",
      "published": "Fri, 02 Jan 2026 14:20:10 +0000",
      "value_score": 26,
      "value_signals": [
        "Botnet",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Happy 16th Birthday, KrebsOnSecurity.com!",
      "link": "https://krebsonsecurity.com/2025/12/happy-16th-birthday-krebsonsecurity-com/",
      "summary": "KrebsOnSecurity.com celebrates its 16th anniversary today! A huge \"thank you\" to all of our readers -- newcomers, long-timers and drive-by critics alike. Your engagement this past year here has been tremendous and truly a salve on a handful of dark days. Happily, comeuppance was a strong theme running through our coverage in 2025, with a primary focus on entities that enabled complex and globally-dispersed cybercrime services.",
      "published": "Mon, 29 Dec 2025 20:23:26 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Dismantling Defenses: Trump 2.0 Cyber Year in Review",
      "link": "https://krebsonsecurity.com/2025/12/dismantling-defenses-trump-2-0-cyber-year-in-review/",
      "summary": "The Trump administration has pursued a staggering range of policy pivots this past year that threaten to weaken the nation’s ability and willingness to address a broad spectrum of technology challenges, from cybersecurity and privacy to countering disinformation, fraud and corruption. These shifts, along with the president’s efforts to restrict free speech and freedom of the press, have come at such a rapid clip that many readers probably aren’t even aware of them all.",
      "published": "Fri, 19 Dec 2025 15:14:55 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Most Parked Domains Now Serving Malicious Content",
      "link": "https://krebsonsecurity.com/2025/12/most-parked-domains-now-serving-malicious-content/",
      "summary": "Direct navigation -- the act of visiting a website by manually typing a domain name in a web browser -- has never been riskier: A new study finds the vast majority of \"parked\" domains -- mostly expired or dormant domain names, or common misspellings of popular websites -- are now configured to redirect visitors to sites that foist scams and malware.",
      "published": "Tue, 16 Dec 2025 14:14:48 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Microsoft Patch Tuesday, December 2025 Edition",
      "link": "https://krebsonsecurity.com/2025/12/microsoft-patch-tuesday-december-2025-edition/",
      "summary": "Microsoft today pushed updates to fix at least 56 security flaws in its Windows operating systems and supported software. This final Patch Tuesday of 2025 tackles one zero-day bug that is already being exploited, as well as two publicly disclosed vulnerabilities.",
      "published": "Tue, 09 Dec 2025 23:18:29 +0000",
      "value_score": 57,
      "value_signals": [
        "Zero-day",
        "Patch/update ×3",
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "AI &amp; the Death of Accuracy: What It Means for Zero-Trust",
      "link": "https://www.darkreading.com/application-security/ai-death-accuracy-zero-trust",
      "summary": "AI \"model collapse,\" where LLMs over time train on more and more AI-generated data and become degraded as a result, can introduce inaccuracies, promulgate malicious activity, and impact PII protections.",
      "published": "Tue, 27 Jan 2026 22:31:48 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Vibe-Coded 'Sicarii' Ransomware Can't Be Decrypted",
      "link": "https://www.darkreading.com/endpoint-security/vibe-coded-sicarii-ransomware-decrypted",
      "summary": "A new ransomware strain that entered the scene last year has poorly designed code and an odd \"Hebrew\" identity that might be a false flag.",
      "published": "Tue, 27 Jan 2026 22:15:39 GMT",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Critical Telnet Server Flaw Exposes Forgotten Attack Surface",
      "link": "https://www.darkreading.com/ics-ot-security/critical-telnet-server-flaw-forgotten-attack-surface",
      "summary": "While telnet is considered obsolete, the network protocol is still used by hundreds of thousands of legacy systems and IoT devices for remote access.",
      "published": "Tue, 27 Jan 2026 21:00:21 GMT",
      "value_score": 18,
      "value_signals": [
        "High severity"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Microsoft Rushes Emergency Patch for Office Zero-Day",
      "link": "https://www.darkreading.com/vulnerabilities-threats/microsoft-rushes-emergency-patch-office-zero-day",
      "summary": "To exploit the vulnerability, an attacker would need either system access or be able to convince a user to open a malicious Office file.",
      "published": "Tue, 27 Jan 2026 20:07:03 GMT",
      "value_score": 49,
      "value_signals": [
        "Zero-day",
        "Patch/update",
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "'Stanley' Toolkit Turns Chrome Into Undetectable Phishing Vector",
      "link": "https://www.darkreading.com/remote-workforce/stanley-toolkit-chrome-undetectable-phishing",
      "summary": "The malware-as-a-service kit enables malicious extensions to overlay pages on real websites without changing the visible URL, signaling a fresh challenge for enterprise security.",
      "published": "Tue, 27 Jan 2026 18:20:28 GMT",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "WorldLeaks Extortion Group Claims It Stole 1.4TB of Nike Data",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/worldeaks-extortion-group-stole-1.4tb-nike-data",
      "summary": "The sportswear brand is investigating an alleged breach of its network that exposed some 188,347 files of highly sensitive corporate data.",
      "published": "Tue, 27 Jan 2026 16:41:40 GMT",
      "value_score": 22,
      "value_signals": [
        "Breach/leak"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Hand CVE Over to the Private Sector",
      "link": "https://www.darkreading.com/cybersecurity-operations/hand-cve-over-to-private-sector",
      "summary": "How MITRE has mismanaged the world's vulnerability database for decades and wasted millions along the way.",
      "published": "Tue, 27 Jan 2026 13:00:00 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Beauty in Destruction: Exploring Malware's Impact Through Art",
      "link": "https://www.darkreading.com/vulnerabilities-threats/beauty-in-destruction-exploring-malware-impact-through-art",
      "summary": "Artistic initiatives turn cybersecurity into immersive exhibits at the Museum of Malware Art, transforming digital threats into thought-provoking experiences.",
      "published": "Mon, 26 Jan 2026 23:08:57 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Indurex Emerges From Stealth to Close Security Gap in Cyber-Physical Systems",
      "link": "https://www.securityweek.com/indurex-emerges-from-stealth-to-close-security-gap-in-cyber-physical-systems/",
      "summary": "Indurex was founded by Jalal Bouhdada, who previously led industrial cybersecurity company Applied Risk. The post Indurex Emerges From Stealth to Close Security Gap in Cyber-Physical Systems appeared first on SecurityWeek .",
      "published": "Wed, 28 Jan 2026 08:23:13 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Fortinet Patches Exploited FortiCloud SSO Authentication Bypass",
      "link": "https://www.securityweek.com/fortinet-patches-exploited-forticloud-sso-authentication-bypass/",
      "summary": "Tracked as CVE-2026-24858, the bug allows attackers to log into devices registered to other FortiCloud accounts. The post Fortinet Patches Exploited FortiCloud SSO Authentication Bypass appeared first on SecurityWeek .",
      "published": "Wed, 28 Jan 2026 08:05:57 +0000",
      "value_score": 64,
      "value_signals": [
        "CVE mentioned",
        "Auth bypass ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "High-Severity Remote Code Execution Vulnerability Patched in OpenSSL",
      "link": "https://www.securityweek.com/high-severity-remote-code-execution-vulnerability-patched-in-openssl/",
      "summary": "A total of 12 vulnerabilities have been fixed in OpenSSL, all discovered by a single cybersecurity firm. The post High-Severity Remote Code Execution Vulnerability Patched in OpenSSL appeared first on SecurityWeek .",
      "published": "Wed, 28 Jan 2026 07:36:01 +0000",
      "value_score": 58,
      "value_signals": [
        "RCE ×2",
        "Patch/update"
      ]
    },
    {
      "source": "Security Week",
      "title": "Memcyco Raises $37 Million for Anti-Impersonation Technology",
      "link": "https://www.securityweek.com/memcyco-raises-37-million-for-anti-impersonation-technology/",
      "summary": "The startup will use the investment to fuel global expansion of its agentless platform, including in Latin America. The post Memcyco Raises $37 Million for Anti-Impersonation Technology appeared first on SecurityWeek .",
      "published": "Tue, 27 Jan 2026 15:37:39 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Over 100 Organizations Targeted in ShinyHunters Phishing Campaign",
      "link": "https://www.securityweek.com/over-100-organizations-targeted-in-shinyhunters-phishing-campaign/",
      "summary": "Domains set up by the threat actor suggest attacks aimed at Atlassian, Canva, Epic Games, HubSpot, Moderna, ZoomInfo, and WeWork. The post Over 100 Organizations Targeted in ShinyHunters Phishing Campaign appeared first on SecurityWeek .",
      "published": "Tue, 27 Jan 2026 14:57:09 +0000",
      "value_score": 26,
      "value_signals": [
        "Phishing ×2"
      ]
    },
    {
      "source": "Security Week",
      "title": "‘PackageGate’ Flaws Open JavaScript Ecosystem to Supply Chain Attacks",
      "link": "https://www.securityweek.com/packagegate-flaws-open-javascript-ecosystem-to-supply-chain-attacks/",
      "summary": "The protections against NPM supply chain attacks could be bypassed, leading to arbitrary code execution. The post ‘PackageGate’ Flaws Open JavaScript Ecosystem to Supply Chain Attacks appeared first on SecurityWeek .",
      "published": "Tue, 27 Jan 2026 13:43:32 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Cyber Insights 2026: Quantum Computing and the Potential Synergy With Advanced AI",
      "link": "https://www.securityweek.com/cyber-insights-2026-quantum-computing-and-the-potential-synergy-with-advanced-ai/",
      "summary": "Quantum computers are coming, with a potential computing power almost beyond comprehension. The post Cyber Insights 2026: Quantum Computing and the Potential Synergy With Advanced AI appeared first on SecurityWeek .",
      "published": "Tue, 27 Jan 2026 12:30:00 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Chrome, Edge Extensions Caught Stealing ChatGPT Sessions",
      "link": "https://www.securityweek.com/chrome-edge-extensions-caught-stealing-chatgpt-sessions/",
      "summary": "Marketed as ChatGPT enhancement and productivity tools, the extensions allow the threat actor to access the victim's ChatGPT data. The post Chrome, Edge Extensions Caught Stealing ChatGPT Sessions appeared first on SecurityWeek .",
      "published": "Tue, 27 Jan 2026 12:28:42 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "summary": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "published": "Wed, 31 Aug 2022 12:57:48 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "published": "Tue, 30 Aug 2022 16:00:43 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "published": "Mon, 29 Aug 2022 14:56:19 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "published": "Fri, 26 Aug 2022 16:44:27 +0000",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "published": "Thu, 25 Aug 2022 18:47:15 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Twitter Whistleblower Complaint: The TL;DR Version",
      "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
      "summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk.",
      "published": "Wed, 24 Aug 2022 14:17:04 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
      "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
      "summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP.",
      "published": "Tue, 23 Aug 2022 13:19:58 +0000",
      "value_score": 50,
      "value_signals": [
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Fake Reservation Links Prey on Weary Travelers",
      "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
      "summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels.",
      "published": "Mon, 22 Aug 2022 13:59:06 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "CISA Alerts",
      "title": "Johnson Controls Products",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-027-04",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could result in remote SQL execution, leading to alteration or loss of data. The following versions of Johnson Controls Products are affected: Application and Data Server (ADS) (CVE-2025-26385) Extended Application and Data Server (ADX) (CVE-2025-26385) LCS8500 (CVE-2025-26385) NAE8500 (CVE-2025-26385) System Configuration Tool (SCT) (CVE-2025-26385) Controller Configuration Tool (CCT) (CVE-2025-26385) CVSS Vendor Equipment Vulnerab",
      "published": "Tue, 27 Jan 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×6",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/01/27/cisa-adds-one-known-exploited-vulnerability-catalog",
      "summary": "CISA has added one new vulnerability to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2026-24858 Fortinet Multiple Products Authentication Bypass Using an Alternate Path or Channel Vulnerability This type of vulnerability is a frequent attack vector for malicious cyber actors and poses significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of Known Exploited Vulnerabilities establis",
      "published": "Tue, 27 Jan 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "Auth bypass",
        "CISA/KEV ×5",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Festo Didactic SE MES PC",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-027-02",
      "summary": "View CSAF Summary MES PCs shipped with Windows 10 come pre-installed with XAMPP. XAMPP is a bundle of third-party open-source applications including the Apache HTTP Server, the MariaDB database and more. From time to time, vulnerabilities in these applications are discovered. These are fixed in newer versions of XAMPP by updating the bundled applications. MES PCs shipped with Windows 10 include a copy of XAMPP which contains around 140 such vulnerabilities listed in this advisory. They can be fi",
      "published": "Tue, 27 Jan 26 12:00:00 +0000",
      "value_score": 43,
      "value_signals": [
        "Source boost: CISA Alerts",
        "Patch/update"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "iba Systems ibaPDA",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-027-01",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an attacker to perform unauthorized actions on the file system. The following versions of iba Systems ibaPDA are affected: ibaPDA (CVE-2025-14988) CVSS Vendor Equipment Vulnerabilities v3 9.8 iba Systems iba Systems ibaPDA Incorrect Permission Assignment for Critical Resource Background Critical Infrastructure Sectors: Critical Manufacturing Countries/Areas Deployed: Worldwide Company Headquarters Location: Germany Vulne",
      "published": "Tue, 27 Jan 26 12:00:00 +0000",
      "value_score": 75,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "High severity ×3",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Schneider Electric Zigbee Products",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-027-03",
      "summary": "View CSAF Summary Schneider Electric is aware of multiple vulnerabilities with EmberZNet disclosed by Silicon Labs. Many vendors, including Schneider Electric, use Silicon Labs’ Zigbee processors in their offers. The following have denial of service vulnerabilities: Wiser iTRV, Wiser RTR, Wiser UFH, Wiser Heat Switch, Wiser Boiler Relay, cFMT (Exaact, Elko, Odace, Merten), Wiser Micromodule, Iconic Wiser Connected Smart Dimmer, Iconic Zigbee devices, Wiser Application Modules, Wiser Connected Pu",
      "published": "Tue, 27 Jan 26 12:00:00 +0000",
      "value_score": 35,
      "value_signals": [
        "Source boost: CISA Alerts"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds Five Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/01/26/cisa-adds-five-known-exploited-vulnerabilities-catalog",
      "summary": "CISA has added five new vulnerabilities to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2018-14634 Linux Kernel Integer Overflow Vulnerability CVE-2025-52691 SmarterTools SmarterMail Unrestricted Upload of File with Dangerous Type Vulnerability CVE-2026-21509 Microsoft Office Security Feature Bypass Vulnerability CVE-2026-23760 SmarterTools SmarterMail Authentication Bypass Using an Alternate Path or Channel Vulnerability CVE-2026-24061 GNU In",
      "published": "Mon, 26 Jan 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×5",
        "Auth bypass",
        "CISA/KEV ×5",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Product Categories for Technologies That Use Post-Quantum Cryptography Standards",
      "link": "https://www.cisa.gov/resources-tools/resources/product-categories-technologies-use-post-quantum-cryptography-standards",
      "summary": "Executive Summary In response to the June 6, 2025, Executive Order (EO) 14306, “Sustaining Select Efforts to Strengthen the Nation’s Cybersecurity and Amending Executive Order 13694 and Executive Order 14144,” the Cybersecurity and Infrastructure Security Agency (CISA) is providing and regularly updating the below lists to aid in post-quantum cryptography (PQC) adoption. The lists include hardware and software categories with example types of widely available products that use PQC standards to p",
      "published": "Fri, 23 Jan 26 12:00:00 +0000",
      "value_score": 55,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CISA/KEV"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/01/23/cisa-adds-one-known-exploited-vulnerability-catalog",
      "summary": "CISA has added one new vulnerability to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2024-37079 Broadcom VMware vCenter Server Out-of-bounds Write Vulnerability This type of vulnerability is a frequent attack vector for malicious cyber actors and poses significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of Known Exploited Vulnerabilities established the KEV Catalog as a living l",
      "published": "Fri, 23 Jan 26 12:00:00 +0000",
      "value_score": 99,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "CISA/KEV ×6",
        "Exploit wording"
      ]
    }
  ],
  "sources": [
    "The Hacker News",
    "BleepingComputer",
    "Krebs on Security",
    "Dark Reading",
    "Security Week",
    "Naked Security",
    "Threatpost",
    "CISA Alerts"
  ]
}