{
  "last_updated": "2026-01-16 04:35",
  "sources_count": 8,
  "articles_count": 56,
  "keywords": [
    "amd processors researchers",
    "telecontrol server basic",
    "maximum severity flaw",
    "sinec security monitor",
    "copilot studio extension",
    "supply chain governance",
    "security problems show",
    "siemens ruggedcom ros",
    "law enforcement authorities",
    "windows operating systems",
    "twitter whistleblower complaint",
    "internet router probably",
    "github repositories including",
    "1 000 archives",
    "xyz gmail com",
    "abc gmail com",
    "respective security advisories",
    "redis model security",
    "online fraud microsoft",
    "krebsonsecurity com celebrates"
  ],
  "trending": [
    {
      "keyword": "amd processors researchers",
      "mentions": 6
    },
    {
      "keyword": "telecontrol server basic",
      "mentions": 6
    },
    {
      "keyword": "maximum severity flaw",
      "mentions": 4
    },
    {
      "keyword": "sinec security monitor",
      "mentions": 6
    },
    {
      "keyword": "copilot studio extension",
      "mentions": 5
    },
    {
      "keyword": "supply chain governance",
      "mentions": 4
    },
    {
      "keyword": "security problems show",
      "mentions": 22
    },
    {
      "keyword": "siemens ruggedcom ros",
      "mentions": 6
    },
    {
      "keyword": "law enforcement authorities",
      "mentions": 10
    },
    {
      "keyword": "windows operating systems",
      "mentions": 96
    }
  ],
  "articles": [
    {
      "source": "The Hacker News",
      "title": "AWS CodeBuild Misconfiguration Exposed GitHub Repos to Potential Supply Chain Attacks",
      "link": "https://thehackernews.com/2026/01/aws-codebuild-misconfiguration-exposed.html",
      "summary": "A critical misconfiguration in Amazon Web Services (AWS) CodeBuild could have allowed complete takeover of the cloud service provider's own GitHub repositories, including its AWS JavaScript SDK, putting every AWS environment at risk. The vulnerability has been codenamed CodeBreach by cloud security company Wiz. The issue was fixed by AWS in September 2025 following responsible disclosure on",
      "published": "Fri, 16 Jan 2026 01:01:00 +0530",
      "value_score": 26,
      "value_signals": [
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Critical WordPress Modular DS Plugin Flaw Actively Exploited to Gain Admin Access",
      "link": "https://thehackernews.com/2026/01/critical-wordpress-modular-ds-plugin.html",
      "summary": "A maximum-severity security flaw in a WordPress plugin called Modular DS has come under active exploitation in the wild, according to Patchstack. The vulnerability, tracked as CVE-2026-23550 (CVSS score: 10.0), has been described as a case of unauthenticated privilege escalation impacting all versions of the plugin prior to and including 2.5.1. It has been patched in version 2.5.2. The plugin",
      "published": "Thu, 15 Jan 2026 21:01:00 +0530",
      "value_score": 100,
      "value_signals": [
        "CVE mentioned",
        "Active exploitation ×2",
        "Privilege escalation",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Researchers Reveal Reprompt Attack Allowing Single-Click Data Exfiltration From Microsoft Copilot",
      "link": "https://thehackernews.com/2026/01/researchers-reveal-reprompt-attack.html",
      "summary": "Cybersecurity researchers have disclosed details of a new attack method dubbed Reprompt that could allow bad actors to exfiltrate sensitive data from artificial intelligence (AI) chatbots like Microsoft Copilot in a single click, while bypassing enterprise security controls entirely. \"Only a single click on a legitimate Microsoft link is required to compromise victims,\" Varonis security",
      "published": "Thu, 15 Jan 2026 20:39:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "ThreatsDay Bulletin: AI Voice Cloning Exploit, Wi-Fi Kill Switch, PLC Vulns, and 14 More Stories",
      "link": "https://thehackernews.com/2026/01/threatsday-bulletin-ai-voice-cloning.html",
      "summary": "The internet never stays quiet. Every week, new hacks, scams, and security problems show up somewhere. This week’s stories show how fast attackers change their tricks, how small mistakes turn into big risks, and how the same old tools keep finding new ways to break in. Read on to catch up before the next wave hits. Unauthenticated RCE risk Security Flaw in Redis",
      "published": "Thu, 15 Jan 2026 19:26:00 +0530",
      "value_score": 36,
      "value_signals": [
        "RCE",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Model Security Is the Wrong Frame – The Real Risk Is Workflow Security",
      "link": "https://thehackernews.com/2026/01/model-security-is-wrong-frame-real-risk.html",
      "summary": "As AI copilots and assistants become embedded in daily work, security teams are still focused on protecting the models themselves. But recent incidents suggest the bigger risk lies elsewhere: in the workflows that surround those models. Two Chrome extensions posing as AI helpers were recently caught stealing ChatGPT and DeepSeek chat data from over 900,000 users. Separately, researchers",
      "published": "Thu, 15 Jan 2026 17:25:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "4 Outdated Habits Destroying Your SOC's MTTR in 2026",
      "link": "https://thehackernews.com/2026/01/4-outdated-habits-destroying-your-socs.html",
      "summary": "It’s 2026, yet many SOCs are still operating the way they did years ago, using tools and processes designed for a very different threat landscape. Given the growth in volumes and complexity of cyber threats, outdated practices no longer fully support analysts’ needs, staggering investigations and incident response. Below are four limiting habits that may be preventing your SOC from evolving at",
      "published": "Thu, 15 Jan 2026 16:30:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Microsoft Legal Action Disrupts RedVDS Cybercrime Infrastructure Used for Online Fraud",
      "link": "https://thehackernews.com/2026/01/microsoft-legal-action-disrupts-redvds.html",
      "summary": "Microsoft on Wednesday announced that it has taken a \"coordinated legal action\" in the U.S. and the U.K. to disrupt a cybercrime subscription service called RedVDS that has allegedly fueled millions in fraud losses. The effort, per the tech giant, is part of a broader law enforcement effort in collaboration with law enforcement authorities that has allowed it to confiscate the malicious",
      "published": "Thu, 15 Jan 2026 15:07:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Palo Alto Fixes GlobalProtect DoS Flaw That Can Crash Firewalls Without Login",
      "link": "https://thehackernews.com/2026/01/palo-alto-fixes-globalprotect-dos-flaw.html",
      "summary": "Palo Alto Networks has released security updates for a high-severity security flaw impacting GlobalProtect Gateway and Portal, for which it said there exists a proof-of-concept (PoC) exploit. The vulnerability, tracked as CVE-2026-0227 (CVSS score: 7.7), has been described as a denial-of-service (DoS) condition impacting GlobalProtect PAN-OS software arising as a result of an improper check for",
      "published": "Thu, 15 Jan 2026 13:48:00 +0530",
      "value_score": 44,
      "value_signals": [
        "CVE mentioned",
        "PoC available",
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Google now lets you change your @gmail.com address, rolling out",
      "link": "https://www.bleepingcomputer.com/news/technology/google-now-lets-you-change-your-gmailcom-address-rolling-out/",
      "summary": "Google has confirmed that it's now possible to change your @gmail.com address. This means that if your current email is xyz@gmail.com, you can now change it to abc@gmail.com. [...]",
      "published": "Thu, 15 Jan 2026 19:36:10 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "ChatGPT is now more reliable at finding and remembering your past chat",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-is-now-more-reliable-at-finding-and-remembering-your-past-chat/",
      "summary": "OpenAI is rolling out a big upgrade for ChatGPT with support for advanced chat history search, but the feature is rolling out to Plus and Pro subscribers only. [...]",
      "published": "Thu, 15 Jan 2026 19:14:44 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Gootloader now uses 1,000-part ZIP archives for stealthy delivery",
      "link": "https://www.bleepingcomputer.com/news/security/gootloader-now-uses-1-000-part-zip-archives-for-stealthy-delivery/",
      "summary": "The Gootloader malware, typically used for initial access, is now using a malformed ZIP archive designed to evade detection by concatenating up to 1,000 archives. [...]",
      "published": "Thu, 15 Jan 2026 17:54:34 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Grubhub confirms hackers stole data in recent security breach",
      "link": "https://www.bleepingcomputer.com/news/security/grubhub-confirms-hackers-stole-data-in-recent-security-breach/",
      "summary": "Food delivery platform Grubhub has confirmed a recent data breach after hackers accessed its systems, with sources telling BleepingComputer the company is now facing extortion demands. [...]",
      "published": "Thu, 15 Jan 2026 16:38:51 -0500",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Hackers exploit Modular DS WordPress plugin flaw for admin access",
      "link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-modular-ds-wordpress-plugin-flaw-for-admin-access/",
      "summary": "Hackers are actively exploiting a maximum severity flaw in the Modular DS WordPress plugin that allows them to bypass authentication remotely and access the vulnerable sites with admin-level privileges. [...]",
      "published": "Thu, 15 Jan 2026 15:49:50 -0500",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Verizon blames nationwide outage on a \"software issue\"",
      "link": "https://www.bleepingcomputer.com/news/mobile/verizon-blames-nationwide-outage-on-a-software-issue/",
      "summary": "Verizon has confirmed that yesterday's nationwide wireless outage was caused by a software issue, though the company has not shared additional details about what went wrong. [...]",
      "published": "Thu, 15 Jan 2026 15:13:54 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft Copilot Studio extension for VS Code now publicly available",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-copilot-studio-extension-for-vs-code-now-publicly-available/",
      "summary": "Microsoft announced that the Copilot Studio extension for the Visual Studio Code (VS Code) integrated development environment is now available to all users. [...]",
      "published": "Thu, 15 Jan 2026 14:08:13 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Critical flaw lets hackers track, eavesdrop via Bluetooth audio devices",
      "link": "https://www.bleepingcomputer.com/news/security/critical-flaw-lets-hackers-track-eavesdrop-via-bluetooth-audio-devices/",
      "summary": "A critical vulnerability in Google's Fast Pair protocol can allow attackers to hijack Bluetooth audio accessories like wireless headphones and earbuds, track users, and eavesdrop on their conversations. [...]",
      "published": "Thu, 15 Jan 2026 11:13:54 -0500",
      "value_score": 26,
      "value_signals": [
        "High severity ×2"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, January 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "published": "Wed, 14 Jan 2026 00:47:38 +0000",
      "value_score": 40,
      "value_signals": [
        "Patch/update ×2",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Who Benefited from the Aisuru and Kimwolf Botnets?",
      "link": "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
      "summary": "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we'll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf's spread.",
      "published": "Thu, 08 Jan 2026 23:23:43 +0000",
      "value_score": 20,
      "value_signals": [
        "Botnet"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "The Kimwolf Botnet is Stalking Your Local Network",
      "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
      "summary": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.",
      "published": "Fri, 02 Jan 2026 14:20:10 +0000",
      "value_score": 26,
      "value_signals": [
        "Botnet",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Happy 16th Birthday, KrebsOnSecurity.com!",
      "link": "https://krebsonsecurity.com/2025/12/happy-16th-birthday-krebsonsecurity-com/",
      "summary": "KrebsOnSecurity.com celebrates its 16th anniversary today! A huge \"thank you\" to all of our readers -- newcomers, long-timers and drive-by critics alike. Your engagement this past year here has been tremendous and truly a salve on a handful of dark days. Happily, comeuppance was a strong theme running through our coverage in 2025, with a primary focus on entities that enabled complex and globally-dispersed cybercrime services.",
      "published": "Mon, 29 Dec 2025 20:23:26 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Dismantling Defenses: Trump 2.0 Cyber Year in Review",
      "link": "https://krebsonsecurity.com/2025/12/dismantling-defenses-trump-2-0-cyber-year-in-review/",
      "summary": "The Trump administration has pursued a staggering range of policy pivots this past year that threaten to weaken the nation’s ability and willingness to address a broad spectrum of technology challenges, from cybersecurity and privacy to countering disinformation, fraud and corruption. These shifts, along with the president’s efforts to restrict free speech and freedom of the press, have come at such a rapid clip that many readers probably aren’t even aware of them all.",
      "published": "Fri, 19 Dec 2025 15:14:55 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Most Parked Domains Now Serving Malicious Content",
      "link": "https://krebsonsecurity.com/2025/12/most-parked-domains-now-serving-malicious-content/",
      "summary": "Direct navigation -- the act of visiting a website by manually typing a domain name in a web browser -- has never been riskier: A new study finds the vast majority of \"parked\" domains -- mostly expired or dormant domain names, or common misspellings of popular websites -- are now configured to redirect visitors to sites that foist scams and malware.",
      "published": "Tue, 16 Dec 2025 14:14:48 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Microsoft Patch Tuesday, December 2025 Edition",
      "link": "https://krebsonsecurity.com/2025/12/microsoft-patch-tuesday-december-2025-edition/",
      "summary": "Microsoft today pushed updates to fix at least 56 security flaws in its Windows operating systems and supported software. This final Patch Tuesday of 2025 tackles one zero-day bug that is already being exploited, as well as two publicly disclosed vulnerabilities.",
      "published": "Tue, 09 Dec 2025 23:18:29 +0000",
      "value_score": 57,
      "value_signals": [
        "Zero-day",
        "Patch/update ×3",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Drones to Diplomas: How Russia’s Largest Private University is Linked to a $25M Essay Mill",
      "link": "https://krebsonsecurity.com/2025/12/drones-to-diplomas-how-russias-largest-private-university-is-linked-to-a-25m-essay-mill/",
      "summary": "A sprawling academic cheating network turbocharged by Google Ads that has generated nearly $25 million in revenue has curious connections to a Kremlin-connected oligarch whose Russian university builds drones for Russia's war against Ukraine.",
      "published": "Sat, 06 Dec 2025 14:45:03 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Predator Spyware Sample Indicates 'Vendor-Controlled' C2",
      "link": "https://www.darkreading.com/mobile-security/predator-spyware-sample-vendor-controlled-c2",
      "summary": "Researchers detailed how Intellexa, Predator's owner, uses failed deployments and thwarted infections to strengthen its commercial spyware and generate more effective attacks.",
      "published": "Thu, 15 Jan 2026 21:26:18 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Winter Olympics Could Share Podium With Cyberattackers",
      "link": "https://www.darkreading.com/remote-workforce/winter-olympics-podium-cyberattackers",
      "summary": "The upcoming Winter Games in the Italian Alps are attracting both hacktivists looking to reach billions of people and state-sponsored cyber-spies targeting the attending glitterati.",
      "published": "Thu, 15 Jan 2026 19:10:05 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Vulnerabilities Surge, But Messy Reporting Blurs Picture",
      "link": "https://www.darkreading.com/cybersecurity-analytics/vulnerabilities-surge-messy-reporting-blurs-picture",
      "summary": "MITRE loses its lead as the top reporter of vulnerabilities, while new organizations pump out CVEs and reported bugs in WordPress plug-ins surge.",
      "published": "Thu, 15 Jan 2026 15:19:31 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Trio of Critical Bugs Spotted in Delta Industrial PLCs",
      "link": "https://www.darkreading.com/ics-ot-security/critical-bugs-delta-industrial-plcs",
      "summary": "Experts disagree on whether the vulnerabilities in a programmable logic controller from Delta are a five-alarm fire or not much to worry over.",
      "published": "Thu, 15 Jan 2026 11:00:00 GMT",
      "value_score": 18,
      "value_signals": [
        "High severity"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Retail, Services Industries Under Fire in Oceania",
      "link": "https://www.darkreading.com/cybersecurity-analytics/retail-services-industries-oceania",
      "summary": "Last year in Australia, New Zealand, and the South Pacific, Main Street businesses like retail and construction suffered more cyberattacks than their critical sector counterparts.",
      "published": "Wed, 14 Jan 2026 21:19:44 GMT",
      "value_score": 18,
      "value_signals": [
        "High severity"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Microsoft Disrupts Cybercrime Service RedVDS",
      "link": "https://www.darkreading.com/threat-intelligence/microsoft-disrupts-cybercrime-service-redvds",
      "summary": "RedVDS, a cybercrime-as-a-service operation that has stolen millions from victims, lost two domains to a law enforcement operation.",
      "published": "Wed, 14 Jan 2026 19:07:30 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Secure Your Spot at RSAC 2026 Conference",
      "link": "https://www.darkreading.com/events/rsac-2026-conference",
      "summary": "",
      "published": "2026-03-23T11:00:00.000Z",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "'VoidLink' Malware Poses Advanced Threat to Linux Systems",
      "link": "https://www.darkreading.com/cloud-security/voidlink-malware-advanced-threat-linux-systems",
      "summary": "Researchers discovered a modular, \"cloud-first\" framework that is feature-rich and designed to maintain stealthy, long-term access to Linux environments.",
      "published": "Wed, 14 Jan 2026 15:59:49 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Forget Predictions: True 2026 Cybersecurity Priorities From Leaders",
      "link": "https://www.securityweek.com/forget-predictions-true-2026-cybersecurity-priorities-from-leaders/",
      "summary": "Security leaders chart course beyond predictions with focus on supply chain, governance, and team efficiency. The post Forget Predictions: True 2026 Cybersecurity Priorities From Leaders appeared first on SecurityWeek .",
      "published": "Thu, 15 Jan 2026 18:15:34 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "New ‘StackWarp’ Attack Threatens Confidential VMs on AMD Processors",
      "link": "https://www.securityweek.com/new-stackwarp-attack-threatens-confidential-vms-on-amd-processors/",
      "summary": "Researchers have disclosed technical details on a new AMD processor attack that allows remote code execution inside confidential VMs. The post New ‘StackWarp’ Attack Threatens Confidential VMs on AMD Processors appeared first on SecurityWeek .",
      "published": "Thu, 15 Jan 2026 18:00:00 +0000",
      "value_score": 30,
      "value_signals": [
        "RCE"
      ]
    },
    {
      "source": "Security Week",
      "title": "Vibe Coding Tested: AI Agents Nail SQLi but Fail Miserably on Security Controls",
      "link": "https://www.securityweek.com/vibe-coding-tested-ai-agents-nail-sqli-but-fail-miserably-on-security-controls/",
      "summary": "Vibe coding generates a curate’s egg program: good in parts, but the bad parts affect the whole program. The post Vibe Coding Tested: AI Agents Nail SQLi but Fail Miserably on Security Controls appeared first on SecurityWeek .",
      "published": "Thu, 15 Jan 2026 17:19:28 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Depthfirst Raises $40 Million for Vulnerability Management",
      "link": "https://www.securityweek.com/depthfirst-raises-40-million-for-vulnerability-management/",
      "summary": "The startup will use the investment to accelerate R&D, expand go-to-market efforts, and hire new talent. The post Depthfirst Raises $40 Million for Vulnerability Management appeared first on SecurityWeek .",
      "published": "Thu, 15 Jan 2026 13:42:51 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "isVerified Emerges From Stealth With Voice Deepfake Detection Apps",
      "link": "https://www.securityweek.com/isverified-emerges-from-stealth-with-voice-deepfake-detection-apps/",
      "summary": "isVerified provides Android and iOS mobile applications designed to protect enterprise communications. The post isVerified Emerges From Stealth With Voice Deepfake Detection Apps appeared first on SecurityWeek .",
      "published": "Thu, 15 Jan 2026 13:05:24 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "New ‘Reprompt’ Attack Silently Siphons Microsoft Copilot Data",
      "link": "https://www.securityweek.com/new-reprompt-attack-silently-siphons-microsoft-copilot-data/",
      "summary": "The attack bypassed Copilot’s data leak protections and allowed for session exfiltration even after the Copilot chat was closed. The post New ‘Reprompt’ Attack Silently Siphons Microsoft Copilot Data appeared first on SecurityWeek .",
      "published": "Thu, 15 Jan 2026 12:09:29 +0000",
      "value_score": 22,
      "value_signals": [
        "Breach/leak"
      ]
    },
    {
      "source": "Security Week",
      "title": "Central Maine Healthcare Data Breach Impacts 145,000 Individuals",
      "link": "https://www.securityweek.com/central-maine-healthcare-data-breach-impacts-145000-individuals/",
      "summary": "Hackers stole patients’ personal, treatment, and health insurance information from the organization’s IT systems. The post Central Maine Healthcare Data Breach Impacts 145,000 Individuals appeared first on SecurityWeek .",
      "published": "Thu, 15 Jan 2026 10:36:46 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Security Week",
      "title": "VoidLink Linux Malware Framework Targets Cloud Environments",
      "link": "https://www.securityweek.com/voidlink-linux-malware-framework-targets-cloud-environments/",
      "summary": "Designed for long-term access, the framework targets cloud and container environments with loaders, implants, and rootkits. The post VoidLink Linux Malware Framework Targets Cloud Environments appeared first on SecurityWeek .",
      "published": "Thu, 15 Jan 2026 09:35:19 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "summary": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "published": "Wed, 31 Aug 2022 12:57:48 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "published": "Tue, 30 Aug 2022 16:00:43 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "published": "Mon, 29 Aug 2022 14:56:19 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "published": "Fri, 26 Aug 2022 16:44:27 +0000",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "published": "Thu, 25 Aug 2022 18:47:15 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Twitter Whistleblower Complaint: The TL;DR Version",
      "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
      "summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk.",
      "published": "Wed, 24 Aug 2022 14:17:04 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
      "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
      "summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP.",
      "published": "Tue, 23 Aug 2022 13:19:58 +0000",
      "value_score": 50,
      "value_signals": [
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Fake Reservation Links Prey on Weary Travelers",
      "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
      "summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels.",
      "published": "Mon, 22 Aug 2022 13:59:06 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "CISA Alerts",
      "title": "AVEVA Process Optimization",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-015-01",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could enable an attacker to execute remote code, perform SQL injection, escalate privileges, or access sensitive information. The following versions of AVEVA Process Optimization are affected: Process Optimization (CVE-2025-61937, CVE-2025-64691, CVE-2025-61943, CVE-2025-65118, CVE-2025-64729, CVE-2025-65117, CVE-2025-64769) CVSS Vendor Equipment Vulnerabilities v3 10 AVEVA AVEVA Process Optimization Improper Control of Generatio",
      "published": "Thu, 15 Jan 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×7",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Secure Connectivity Principles for Operational Technology (OT)",
      "link": "https://www.cisa.gov/resources-tools/resources/secure-connectivity-principles-operational-technology-ot",
      "summary": "CISA and the UK National Cyber Security Centre (NCSC-UK), in collaboration with federal and international partners, have released Secure Connectivity Principles for Operational Technology (OT) guidance to help asset owners address increasing business and regulatory pressures for connectivity into operational technology (OT) networks. This guidance outlines eight principles to use as a framework to design, secure, and manage connectivity into OT environments. These principles are particularly cri",
      "published": "Wed, 14 Jan 26 12:00:00 +0000",
      "value_score": 55,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CISA/KEV"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Siemens RUGGEDCOM ROS",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-015-05",
      "summary": "View CSAF Summary Ruggedcom ROS devices contain a temporary denial of service vulnerability that could allow an attacker to crash and restart the device. Siemens has released new versions for the affected products and recommends to update to the latest versions. The following versions of Siemens RUGGEDCOM ROS are affected: RUGGEDCOM RMC8388 V5.X (CVE-2025-40935) RUGGEDCOM RS416Pv2 V5.X (CVE-2025-40935) RUGGEDCOM RS416v2 V5.X (CVE-2025-40935) RUGGEDCOM RS900 (32M) V5.X (CVE-2025-40935) RUGGEDCOM ",
      "published": "Wed, 14 Jan 26 12:00:00 +0000",
      "value_score": 91,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "Patch/update",
        "Multiple CVEs"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Siemens TeleControl Server Basic",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-015-03",
      "summary": "View CSAF Summary TeleControl Server Basic before V3.1.2.4 contains a local privilege escalation vulnerability that could allow an attacker to run arbitrary code with elevated privileges. Siemens has released a new version for TeleControl Server Basic and recommends to update to the latest version. The following versions of Siemens TeleControl Server Basic are affected: TeleControl Server Basic (CVE-2025-40942) CVSS Vendor Equipment Vulnerabilities v3 8.8 Siemens Siemens TeleControl Server Basic",
      "published": "Wed, 14 Jan 26 12:00:00 +0000",
      "value_score": 73,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "Privilege escalation",
        "Patch/update"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Siemens SIMATIC and SIPLUS products",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-015-04",
      "summary": "View CSAF Summary Siemens ET 200SP contains a denial-of-service vulnerability that could be triggered by sending a valid S7 protocol Disconnect Request (COTP DR TPDU), causing the device to become unresponsive and require a power cycle to recover. Siemens has released new versions for several affected products and recommends to update to the latest versions. Siemens is preparing further fix versions and recommends specific countermeasures for products where fixes are not, or not yet available. T",
      "published": "Wed, 14 Jan 26 12:00:00 +0000",
      "value_score": 51,
      "value_signals": [
        "Source boost: CISA Alerts",
        "Patch/update ×2"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Siemens Industrial Edge Device Kit",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-015-09",
      "summary": "View CSAF Summary Users of Industrial Edge Devices are advised to consult the respective Security Advisories for their devices (for Siemens Industrial Edge devices see Additional Information). Industrial Edge Device Kit contains an authorization bypass vulnerability that could facilitate an unauthenticated remote attacker to circumvent authentication and impersonate a legitimate user. Siemens has released new versions for several affected products and recommends to update to the latest versions.",
      "published": "Wed, 14 Jan 26 12:00:00 +0000",
      "value_score": 43,
      "value_signals": [
        "Source boost: CISA Alerts",
        "Patch/update"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Siemens RUGGEDCOM APE1808 Devices",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-015-07",
      "summary": "View CSAF Summary Nozomi Networks has published information on vulnerabilities in Nozomi Guardian/CMC. This advisory lists the related Siemens Industrial products affected by these vulnerabilities. Siemens is preparing fix versions and recommends countermeasures for products where fixes are not, or not yet available. The following versions of Siemens RUGGEDCOM APE1808 Devices are affected: RUGGEDCOM APE1808 (CVE-2025-40891, CVE-2025-40892, CVE-2025-40893, CVE-2025-40898) CVSS Vendor Equipment Vu",
      "published": "Wed, 14 Jan 26 12:00:00 +0000",
      "value_score": 91,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "Patch/update",
        "Multiple CVEs"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Siemens SINEC Security Monitor",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-015-06",
      "summary": "View CSAF Summary SINEC Security Monitor before V4.10.0 contains multiple vulnerabilities. Siemens has released a new version for SINEC Security Monitor and recommends to update to the latest version. The following versions of Siemens SINEC Security Monitor are affected: SINEC Security Monitor (CVE-2025-40830, CVE-2025-40831) CVSS Vendor Equipment Vulnerabilities v3 6.7 Siemens Siemens SINEC Security Monitor Improper Authorization, Improper Input Validation Background Critical Infrastructure Sec",
      "published": "Wed, 14 Jan 26 12:00:00 +0000",
      "value_score": 95,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "Patch/update",
        "High severity",
        "Multiple CVEs"
      ]
    }
  ],
  "sources": [
    "The Hacker News",
    "BleepingComputer",
    "Krebs on Security",
    "Dark Reading",
    "Security Week",
    "Naked Security",
    "Threatpost",
    "CISA Alerts"
  ]
}