{
  "last_updated": "2026-02-19 01:48",
  "sources_count": 8,
  "articles_count": 56,
  "keywords": [
    "scattered lapsus shinyhunters",
    "smb phone infrastructure",
    "darknet drug ring",
    "badbox 2 0",
    "arbitrary code execution",
    "50 security holes",
    "palo alto networks",
    "interdisciplinary research unit",
    "block 16 websites",
    "twitter whistleblower complaint",
    "sprawling phishing campaign",
    "renewable energy farms",
    "honeywell cctv products",
    "figure technology solutions",
    "even swatting executives",
    "buy fake crypto",
    "apryse pdf tools",
    "probable culprits behind",
    "auth bypass flaw",
    "endpoint security solution"
  ],
  "trending": [
    {
      "keyword": "scattered lapsus shinyhunters",
      "mentions": 121
    },
    {
      "keyword": "smb phone infrastructure",
      "mentions": 2
    },
    {
      "keyword": "darknet drug ring",
      "mentions": 7
    },
    {
      "keyword": "badbox 2 0",
      "mentions": 152
    },
    {
      "keyword": "arbitrary code execution",
      "mentions": 145
    },
    {
      "keyword": "50 security holes",
      "mentions": 70
    },
    {
      "keyword": "palo alto networks",
      "mentions": 9
    },
    {
      "keyword": "interdisciplinary research unit",
      "mentions": 4
    },
    {
      "keyword": "block 16 websites",
      "mentions": 7
    },
    {
      "keyword": "twitter whistleblower complaint",
      "mentions": 737
    }
  ],
  "articles": [
    {
      "source": "The Hacker News",
      "title": "Citizen Lab Finds Cellebrite Tool Used on Kenyan Activist’s Phone in Police Custody",
      "link": "https://thehackernews.com/2026/02/citizen-lab-finds-cellebrite-tool-used.html",
      "summary": "New research from the Citizen Lab has found signs that Kenyan authorities used a commercial forensic extraction tool manufactured by Israeli company Cellebrite to break into a prominent dissident's phone, making it the latest case of abuse of the technology targeting civil society. The interdisciplinary research unit at the University of Toronto's Munk School of Global Affairs & Public",
      "published": "Wed, 18 Feb 2026 23:00:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Grandstream GXP1600 VoIP Phones Exposed to Unauthenticated Remote Code Execution",
      "link": "https://thehackernews.com/2026/02/grandstream-gxp1600-voip-phones-exposed.html",
      "summary": "Cybersecurity researchers have disclosed a critical security flaw in the Grandstream GXP1600 series of VoIP phones that could allow an attacker to seize control of susceptible devices. The vulnerability, tracked as CVE-2026-2329, carries a CVSS score of 9.3 out of a maximum of 10.0. It has been described as a case of unauthenticated stack-based buffer overflow that could result in remote code",
      "published": "Wed, 18 Feb 2026 22:05:00 +0530",
      "value_score": 56,
      "value_signals": [
        "CVE mentioned",
        "RCE",
        "High severity"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Critical Flaws Found in Four VS Code Extensions with Over 125 Million Installs",
      "link": "https://thehackernews.com/2026/02/critical-flaws-found-in-four-vs-code.html",
      "summary": "Cybersecurity researchers have disclosed multiple security vulnerabilities in four popular Microsoft Visual Studio Code (VS Code) extensions that, if successfully exploited, could allow threat actors to steal local files and execute code remotely. The extensions, which have been collectively installed more than 125 million times, are Live Server, Code Runner, Markdown Preview Enhanced, and",
      "published": "Wed, 18 Feb 2026 18:46:00 +0530",
      "value_score": 24,
      "value_signals": [
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Cybersecurity Tech Predictions for 2026: Operating in a World of Permanent Instability",
      "link": "https://thehackernews.com/2026/02/cybersecurity-tech-predictions-for-2026.html",
      "summary": "In 2025, navigating the digital seas still felt like a matter of direction. Organizations charted routes, watched the horizon, and adjusted course to reach safe harbors of resilience, trust, and compliance. In 2026, the seas are no longer calm between storms. Cybersecurity now unfolds in a state of continuous atmospheric instability: AI-driven threats that adapt in real time, expanding",
      "published": "Wed, 18 Feb 2026 17:28:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Dell RecoverPoint for VMs Zero-Day CVE-2026-22769 Exploited Since Mid-2024",
      "link": "https://thehackernews.com/2026/02/dell-recoverpoint-for-vms-zero-day-cve.html",
      "summary": "A maximum severity security vulnerability in Dell RecoverPoint for Virtual Machines has been exploited as a zero-day by a suspected China-nexus threat cluster dubbed UNC6201 since mid-2024, according to a new report from Google Mandiant and Google Threat Intelligence Group (GTIG). The activity involves the exploitation of CVE-2026-22769 (CVSS score: 10.0), a case of hard-coded credentials",
      "published": "Wed, 18 Feb 2026 16:02:00 +0530",
      "value_score": 100,
      "value_signals": [
        "CVE mentioned ×2",
        "Zero-day ×2",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "3 Ways to Start Your Intelligent Workflow Program",
      "link": "https://thehackernews.com/2026/02/3-ways-to-start-your-intelligent.html",
      "summary": "Security, IT, and engineering teams today are under relentless pressure to accelerate outcomes, cut operational drag, and unlock the full potential of AI and automation. But simply investing in tools isn’t enough. 88% of AI proofs-of-concept never make it to production, even though 70% of workers cite freeing time for high-value work as the primary AI automation motivation. Real impact comes",
      "published": "Wed, 18 Feb 2026 16:00:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Notepad++ Fixes Hijacked Update Mechanism Used to Deliver Targeted Malware",
      "link": "https://thehackernews.com/2026/02/notepad-fixes-hijacked-update-mechanism.html",
      "summary": "Notepad++ has released a security fix to plug gaps that were exploited by an advanced threat actor from China to hijack the software update mechanism to selectively deliver malware to targets of interest. The version 8.9.2 update incorporates what maintainer Don Ho calls a \"double lock\" design that aims to make the update process \"robust and effectively unexploitable.\" This includes verification",
      "published": "Wed, 18 Feb 2026 13:10:00 +0530",
      "value_score": 32,
      "value_signals": [
        "Patch/update ×5",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "CISA Flags Four Security Flaws Under Active Exploitation in Latest KEV Update",
      "link": "https://thehackernews.com/2026/02/cisa-flags-four-security-flaws-under.html",
      "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday added four security flaws to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild. The list of vulnerabilities is as follows - CVE-2026-2441 (CVSS score: 8.8) - A use-after-free vulnerability in Google Chrome that could allow a remote attacker to potentially exploit heap",
      "published": "Wed, 18 Feb 2026 12:22:00 +0530",
      "value_score": 100,
      "value_signals": [
        "CVE mentioned",
        "Active exploitation",
        "Patch/update",
        "CISA/KEV ×5",
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Critical infra Honeywell CCTVs vulnerable to auth bypass flaw",
      "link": "https://www.bleepingcomputer.com/news/security/critical-infra-honeywell-cctvs-vulnerable-to-auth-bypass-flaw/",
      "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) is warning of a critical vulnerability in multiple Honeywell CCTV products that allows unauthorized access to feeds or account hijacking. [...]",
      "published": "Wed, 18 Feb 2026 15:58:20 -0500",
      "value_score": 61,
      "value_signals": [
        "Auth bypass",
        "CISA/KEV",
        "High severity ×2"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "AI platforms can be abused for stealthy malware communication",
      "link": "https://www.bleepingcomputer.com/news/security/ai-platforms-can-be-abused-for-stealthy-malware-communication/",
      "summary": "AI assistants like Grok and Microsoft Copilot with web browsing and URL-fetching capabilities can be abused to intermediate command-and-control (C2) activity. [...]",
      "published": "Wed, 18 Feb 2026 15:18:24 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Telegram channels expose rapid weaponization of SmarterMail flaws",
      "link": "https://www.bleepingcomputer.com/news/security/telegram-channels-expose-rapid-weaponization-of-smartermail-flaws/",
      "summary": "Underground Telegram channels shared SmarterMail exploit PoCs and stolen admin credentials within days of disclosure. Flare explains how monitoring these communities reveals rapid weaponization of CVE-2026-24423 and CVE-2026-23760 tied to ransomware activity. [...]",
      "published": "Wed, 18 Feb 2026 11:27:38 -0500",
      "value_score": 78,
      "value_signals": [
        "CVE mentioned ×2",
        "Ransomware",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft: Anti-phishing rules mistakenly blocked emails, Teams messages",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-anti-phishing-rules-mistakenly-blocked-emails-teams-messages/",
      "summary": "Microsoft says an Exchange Online issue that mistakenly quarantined legitimate emails last week was triggered by faulty heuristic detection rules designed to block credential phishing campaigns. [...]",
      "published": "Wed, 18 Feb 2026 11:26:53 -0500",
      "value_score": 26,
      "value_signals": [
        "Phishing ×2"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Data breach at fintech firm Figure affects nearly 1 million accounts",
      "link": "https://www.bleepingcomputer.com/news/security/data-breach-at-fintech-firm-figure-affects-nearly-1-million-accounts/",
      "summary": "Hackers have stolen the personal and contact information of nearly 1 million accounts after breaching the systems of Figure Technology Solutions, a self-described blockchain-native financial technology company. [...]",
      "published": "Wed, 18 Feb 2026 09:01:08 -0500",
      "value_score": 22,
      "value_signals": [
        "Breach/leak"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft says bug causes Copilot to summarize confidential emails",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-says-bug-causes-copilot-to-summarize-confidential-emails/",
      "summary": "Microsoft says a Microsoft 365 Copilot bug has been causing the AI assistant to summarize confidential emails since late January, bypassing data loss prevention (DLP) policies that organizations rely on to protect sensitive information. [...]",
      "published": "Wed, 18 Feb 2026 07:03:05 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Glendale man gets 5 years in prison for role in darknet drug ring",
      "link": "https://www.bleepingcomputer.com/news/security/glendale-man-gets-5-years-in-prison-for-role-in-darknet-drug-trafficking-operation/",
      "summary": "​A Glendale man was sentenced to nearly five years in federal prison for his role in a darknet drug trafficking operation that sold cocaine, methamphetamine, MDMA, and ketamine to customers across the United States. [...]",
      "published": "Wed, 18 Feb 2026 05:50:50 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Spain orders NordVPN, ProtonVPN to block LaLiga piracy sites",
      "link": "https://www.bleepingcomputer.com/news/legal/spain-orders-nordvpn-protonvpn-to-block-laliga-piracy-sites/",
      "summary": "A Spanish court has granted precautionary measures against NordVPN and ProtonVPN, ordering the two popular VPN providers to block 16 websites that facilitate piracy of football matches. [...]",
      "published": "Tue, 17 Feb 2026 18:15:49 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Swamps Anonymity Network I2P",
      "link": "https://krebsonsecurity.com/2026/02/kimwolf-botnet-swamps-anonymity-network-i2p/",
      "summary": "For the past week, the massive \"Internet of Things\" (IoT) botnet known as Kimwolf has been disrupting the The Invisible Internet Project (I2P), a decentralized, encrypted communications network designed to anonymize and secure online communications. I2P users started reporting disruptions in the network around the same time the Kimwolf botmasters began relying on it to evade takedown attempts against the botnet's control servers.",
      "published": "Wed, 11 Feb 2026 16:08:11 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×3"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, February 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/02/patch-tuesday-february-2026-edition/",
      "summary": "Microsoft today released updates to fix more than 50 security holes in its Windows operating systems and other software, including patches for a whopping six \"zero-day\" vulnerabilities that attackers are already exploiting in the wild.",
      "published": "Tue, 10 Feb 2026 21:49:53 +0000",
      "value_score": 82,
      "value_signals": [
        "Zero-day",
        "Active exploitation",
        "Patch/update ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Please Don’t Feed the Scattered Lapsus ShinyHunters",
      "link": "https://krebsonsecurity.com/2026/02/please-dont-feed-the-scattered-lapsus-shiny-hunters/",
      "summary": "A prolific data ransom gang that calls itself Scattered Lapsus ShinyHunters (SLSH) has a distinctive playbook when it seeks to extort payment from victim firms: Harassing, threatening and even swatting executives and their families, all while notifying journalists and regulators… Read More »",
      "published": "Mon, 02 Feb 2026 16:15:16 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Who Operates the Badbox 2.0 Botnet?",
      "link": "https://krebsonsecurity.com/2026/01/who-operates-the-badbox-2-0-botnet/",
      "summary": "The cybercriminals in control of Kimwolf -- a disruptive botnet that has infected more than 2 million devices -- recently shared a screenshot indicating they'd compromised the control panel for Badbox 2.0, a vast China-based botnet powered by malicious software that comes pre-installed on many Android TV streaming boxes. Both the FBI and Google say they are hunting for the people behind Badbox 2.0, and thanks to bragging by the Kimwolf botmasters we may now have a much clearer idea about that.",
      "published": "Mon, 26 Jan 2026 16:11:38 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×3"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
      "link": "https://krebsonsecurity.com/2026/01/kimwolf-botnet-lurking-in-corporate-govt-networks/",
      "summary": "A new Internet-of-Things botnet called Kimwolf has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf's ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.",
      "published": "Tue, 20 Jan 2026 18:19:13 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×2"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, January 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "published": "Wed, 14 Jan 2026 00:47:38 +0000",
      "value_score": 40,
      "value_signals": [
        "Patch/update ×2",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Who Benefited from the Aisuru and Kimwolf Botnets?",
      "link": "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
      "summary": "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we'll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf's spread.",
      "published": "Thu, 08 Jan 2026 23:23:43 +0000",
      "value_score": 20,
      "value_signals": [
        "Botnet"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "The Kimwolf Botnet is Stalking Your Local Network",
      "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
      "summary": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.",
      "published": "Fri, 02 Jan 2026 14:20:10 +0000",
      "value_score": 26,
      "value_signals": [
        "Botnet",
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Scam Abuses Gemini Chatbots to Convince People to Buy Fake Crypto",
      "link": "https://www.darkreading.com/endpoint-security/scam-abuses-gemini-chatbots-convince-people-buy-fake-crypto",
      "summary": "A convincing presale site for phony \"Google Coin\" features an AI assistant that engages victims with a slick sales pitch, funneling payment to attackers.",
      "published": "Wed, 18 Feb 2026 21:47:01 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Critical Grandstream VoIP Bug Highlights SMB Security Blind Spot",
      "link": "https://www.darkreading.com/threat-intelligence/grandstream-bug-voip-security-blind-spot",
      "summary": "CVE-2026-2329 allows unauthenticated root-level access to SMB phone infrastructure, so attackers can intercept calls, commit toll fraud, and impersonate users.",
      "published": "Wed, 18 Feb 2026 21:15:08 GMT",
      "value_score": 36,
      "value_signals": [
        "CVE mentioned",
        "High severity"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Dell's Hard-Coded Flaw: A Nation-State Goldmine",
      "link": "https://www.darkreading.com/application-security/dells-hard-coded-flaw-a-nation-state-goldmine",
      "summary": "A China-related attacker has exploited the vendor flaw since mid-2024, allowing it to move laterally, maintain persistent access, and deploy malware.",
      "published": "Wed, 18 Feb 2026 20:49:36 GMT",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "A CISO's Playbook for Defending Data Assets Against AI Scraping",
      "link": "https://www.darkreading.com/cyber-risk/ciso-playbook-defending-data-assets-against-ai-scraping",
      "summary": "Discover a strategic approach to govern scraping risks, balance security with business growth, and safeguard intellectual capital from automated data harvesting.",
      "published": "Wed, 18 Feb 2026 19:13:33 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Singapore &amp; Its 4 Major Telcos Fend Off Chinese Hackers",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/singapore-major-telcos-fend-chinese-hackers",
      "summary": "After detecting a zero-day attack, the country's effective response was attributed to the tight relationship between its government and private industry.",
      "published": "Wed, 18 Feb 2026 01:00:00 GMT",
      "value_score": 35,
      "value_signals": [
        "Zero-day"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Supply Chain Attack Embeds Malware in Android Devices",
      "link": "https://www.darkreading.com/mobile-security/supply-chain-attack-embeds-malware-android-devices",
      "summary": "Keenadu downloads payloads that hijack browser searches, commit ad fraud, and execute other actions without user knowledge.",
      "published": "Tue, 17 Feb 2026 22:06:36 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Poland Energy Survives Attack on Wind, Solar Infrastructure",
      "link": "https://www.darkreading.com/threat-intelligence/poland-energy-attack-wind-solar-infrastructure",
      "summary": "Russia-aligned groups are probable culprits behind the wiper attacks against renewable energy farms, a manufacturer, and a heating and power plant.",
      "published": "Tue, 17 Feb 2026 21:31:50 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "RMM Abuse Explodes as Hackers Ditch Malware",
      "link": "https://www.darkreading.com/application-security/rmm-abuse-explodes-hackers-ditch-malware",
      "summary": "Remote monitoring and management (RMM) software offers hackers multiple benefits, including stealth, persistence, and operational efficiency.",
      "published": "Tue, 17 Feb 2026 21:01:26 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "New Keenadu Android Malware Found on Thousands of Devices",
      "link": "https://www.securityweek.com/new-keenadu-android-malware-found-on-thousands-of-devices/",
      "summary": "The malware has been preinstalled on many devices but it has also been distributed through Google Play and other app stores. The post New Keenadu Android Malware Found on Thousands of Devices appeared first on SecurityWeek .",
      "published": "Wed, 18 Feb 2026 15:41:25 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Cogent Security Raises $42 Million for AI-Driven Vulnerability Management",
      "link": "https://www.securityweek.com/cogent-security-raises-42-million-for-ai-driven-vulnerability-management/",
      "summary": "The Series A funding round, led by Bain Capital, brings the total raised by Cogent to $53 million. The post Cogent Security Raises $42 Million for AI-Driven Vulnerability Management appeared first on SecurityWeek .",
      "published": "Wed, 18 Feb 2026 14:47:07 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Vulnerabilities in Popular PDF Platforms Allowed Account Takeover, Data Exfiltration",
      "link": "https://www.securityweek.com/vulnerabilities-in-popular-pdf-platforms-allowed-account-takeover-data-exfiltration/",
      "summary": "Novee researchers discovered 16 vulnerabilities in Foxit and Apryse PDF tools that could have been exploited via malicious documents or URLs. The post Vulnerabilities in Popular PDF Platforms Allowed Account Takeover, Data Exfiltration appeared first on SecurityWeek .",
      "published": "Wed, 18 Feb 2026 13:16:19 +0000",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "CISA: Hackers Exploiting Vulnerability in Product of Taiwan Security Firm TeamT5",
      "link": "https://www.securityweek.com/cisa-hackers-exploiting-vulnerability-in-product-of-taiwan-security-firm-teamt5/",
      "summary": "The vulnerability added to CISA’s KEV catalog affects ThreatSonar Anti-Ransomware and it was patched in 2024. The post CISA: Hackers Exploiting Vulnerability in Product of Taiwan Security Firm TeamT5 appeared first on SecurityWeek .",
      "published": "Wed, 18 Feb 2026 10:26:03 +0000",
      "value_score": 74,
      "value_signals": [
        "Ransomware",
        "CISA/KEV ×4",
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "Palo Alto Networks to Acquire Koi in Reported $400 Million Transaction",
      "link": "https://www.securityweek.com/palo-alto-networks-to-acquire-koi-in-reported-400-million-transaction/",
      "summary": "Koi has developed an endpoint security solution that Palo Alto will use to enhance its products. The post Palo Alto Networks to Acquire Koi in Reported $400 Million Transaction appeared first on SecurityWeek .",
      "published": "Wed, 18 Feb 2026 08:24:46 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Dell RecoverPoint Zero-Day Exploited by Chinese Cyberespionage Group",
      "link": "https://www.securityweek.com/dell-recoverpoint-zero-day-exploited-by-chinese-cyberespionage-group/",
      "summary": "GTIG and Mandiant said the zero-day tracked as CVE-2026-22769 has been exploited by UNC6201 since at least 2024. The post Dell RecoverPoint Zero-Day Exploited by Chinese Cyberespionage Group appeared first on SecurityWeek .",
      "published": "Wed, 18 Feb 2026 07:09:01 +0000",
      "value_score": 84,
      "value_signals": [
        "CVE mentioned",
        "Zero-day ×3",
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "VulnCheck Raises $25 Million in Series B Funding to Scale Vulnerability Intelligence",
      "link": "https://www.securityweek.com/vulncheck-raises-25-million-in-series-b-funding-to-scale-vulnerability-intelligence/",
      "summary": "The latest funding round was led by Sorenson Capital and brings the total investment to $45 million. The post VulnCheck Raises $25 Million in Series B Funding to Scale Vulnerability Intelligence appeared first on SecurityWeek .",
      "published": "Tue, 17 Feb 2026 16:00:04 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Hackers Offer to Sell Millions of Eurail User Records",
      "link": "https://www.securityweek.com/hackers-offer-to-sell-millions-of-eurail-user-records/",
      "summary": "Eurail has confirmed that the stolen data is up for sale, but it’s still trying to determine how many individuals are impacted. The post Hackers Offer to Sell Millions of Eurail User Records appeared first on SecurityWeek .",
      "published": "Tue, 17 Feb 2026 15:27:12 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "summary": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "published": "Wed, 31 Aug 2022 12:57:48 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "published": "Tue, 30 Aug 2022 16:00:43 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "published": "Mon, 29 Aug 2022 14:56:19 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "published": "Fri, 26 Aug 2022 16:44:27 +0000",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "published": "Thu, 25 Aug 2022 18:47:15 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Twitter Whistleblower Complaint: The TL;DR Version",
      "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
      "summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk.",
      "published": "Wed, 24 Aug 2022 14:17:04 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
      "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
      "summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP.",
      "published": "Tue, 23 Aug 2022 13:19:58 +0000",
      "value_score": 50,
      "value_signals": [
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Fake Reservation Links Prey on Weary Travelers",
      "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
      "summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels.",
      "published": "Mon, 22 Aug 2022 13:59:06 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds Two Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/02/18/cisa-adds-two-known-exploited-vulnerabilities-catalog",
      "summary": "CISA has added two new vulnerabilities to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2021-22175 GitLab Server-Side Request Forgery (SSRF) Vulnerability CVE-2026-22769 Dell RecoverPoint for Virtual Machines (RP4VMs) Use of Hard-coded Credentials Vulnerability These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Red",
      "published": "Wed, 18 Feb 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "CISA/KEV ×5",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Siemens Simcenter Femap and Nastran",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-048-01",
      "summary": "View CSAF Summary Siemens Simcenter Femap and Nastran is affected by multiple file parsing vulnerabilities that could be triggered when the application reads files in NDB and XDB formats. If a user is tricked to open a malicious file with any of the affected products, this could lead the application to crash or potentially lead to arbitrary code execution. Siemens has released new versions for the affected products and recommends to update to the latest versions. The following versions of Siemen",
      "published": "Tue, 17 Feb 26 12:00:00 +0000",
      "value_score": 43,
      "value_signals": [
        "Source boost: CISA Alerts",
        "Patch/update"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Delta Electronics ASDA-Soft",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-048-02",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability may allow an attacker to write arbitrary data beyond the bounds of a stack-allocated buffer, leading to the corruption of a structured exception handler (SEH). The following versions of Delta Electronics ASDA-Soft are affected: ASDA-Soft <=7.2.0.0 (CVE-2026-1361) CVSS Vendor Equipment Vulnerabilities v3 7.8 Delta Electronics Delta Electronics ASDA-Soft Stack-based Buffer Overflow Background Critical Infrastructure Sectors: Critical ",
      "published": "Tue, 17 Feb 26 12:00:00 +0000",
      "value_score": 75,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "GE Vernova Enervista UR Setup",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-048-03",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities may allow code execution with elevated privileges. The following versions of GE Vernova Enervista UR Setup are affected: Enervista UR Setup <8.70 (CVE-2026-1762, CVE-2026-1763) CVSS Vendor Equipment Vulnerabilities v3 7.8 GE Vernova GE Vernova Enervista UR Setup Uncontrolled Search Path Element, Path Traversal: '.../...//' Background Critical Infrastructure Sectors: Critical Manufacturing, Energy, Water and Wastewater Countries/A",
      "published": "Tue, 17 Feb 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "High severity ×2",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds Four Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/02/17/cisa-adds-four-known-exploited-vulnerabilities-catalog",
      "summary": "CISA has added four new vulnerabilities to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2008-0015 Microsoft Windows Video ActiveX Control Remote Code Execution Vulnerability CVE-2020-7796 Synacor Zimbra Collaboration Suite (ZCS) Server-Side Request Forgery Vulnerability CVE-2024-7694 TeamT5 ThreatSonar Anti-Ransomware Unrestricted Upload of File with Dangerous Type Vulnerability CVE-2026-2441 Google Chromium CSS Use-After-Free Vulnerability Th",
      "published": "Tue, 17 Feb 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "Ransomware",
        "RCE",
        "CISA/KEV ×5",
        "Multiple CVEs"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Honeywell CCTV Products",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-048-04",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could lead to account takeovers and unauthorized access to camera feeds; an unauthenticated attacker may change the recovery email address, potentially leading to further network compromise. The following versions of Honeywell CCTV Products are affected: I-HIB2PI-UL 2MP IP 6.1.22.1216 (CVE-2026-1670) SMB NDAA MVO-3 WDR_2MP_32M_PTZ_v2.0 (CVE-2026-1670) PTZ WDR 2MP 32M WDR_2MP_32M_PTZ_v2.0 (CVE-2026-1670) 25M IPC WDR_2MP_32M_PTZ_v2.0 ",
      "published": "Tue, 17 Feb 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×3",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/02/13/cisa-adds-one-known-exploited-vulnerability-catalog",
      "summary": "CISA has added one new vulnerability to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2026-1731 BeyondTrust Remote Support (RS) and Privileged Remote Access (PRA) OS Command Injection Vulnerability These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of Known Exploited Vulnerabilities es",
      "published": "Fri, 13 Feb 26 12:00:00 +0000",
      "value_score": 99,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "CISA/KEV ×5",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Siemens Siveillance Video Management Servers",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-043-07",
      "summary": "View CSAF Summary The Webhooks implementation of Siveillance Video Management Servers contains a vulnerability that could allow an authenticated remote attacker with read-only privileges to achieve full access to Webhooks API. Siemens has released new versions for the affected products and recommends to update to the latest versions. The following versions of Siemens Siveillance Video Management Servers are affected: Siveillance Video V2023 R1: All versions < V23.1 HotfixRev18 Siveillance Video ",
      "published": "Thu, 12 Feb 26 12:00:00 +0000",
      "value_score": 43,
      "value_signals": [
        "Source boost: CISA Alerts",
        "Patch/update"
      ]
    }
  ],
  "sources": [
    "The Hacker News",
    "BleepingComputer",
    "Krebs on Security",
    "Dark Reading",
    "Security Week",
    "Naked Security",
    "Threatpost",
    "CISA Alerts"
  ]
}