{
  "last_updated": "2026-01-20 16:29",
  "sources_count": 8,
  "articles_count": 56,
  "keywords": [
    "telecontrol server basic",
    "sinec security monitor",
    "identities left behind",
    "deliver malicious payloads",
    "siemens ruggedcom ros",
    "twitter whistleblower complaint",
    "join sumo logic",
    "aligning security tools",
    "mcp server git",
    "continued malicious activity",
    "crypto cybersecurity researchers",
    "windows operating systems",
    "industrial edge devices",
    "illicit services appears",
    "upcoming winter games",
    "unlocks unlimited access",
    "today we'll dig",
    "strong theme running",
    "steal developer credentials",
    "scoops nestled inside"
  ],
  "trending": [
    {
      "keyword": "telecontrol server basic",
      "mentions": 60
    },
    {
      "keyword": "sinec security monitor",
      "mentions": 60
    },
    {
      "keyword": "identities left behind",
      "mentions": 2
    },
    {
      "keyword": "deliver malicious payloads",
      "mentions": 1
    },
    {
      "keyword": "siemens ruggedcom ros",
      "mentions": 60
    },
    {
      "keyword": "twitter whistleblower complaint",
      "mentions": 410
    },
    {
      "keyword": "join sumo logic",
      "mentions": 1
    },
    {
      "keyword": "aligning security tools",
      "mentions": 1
    },
    {
      "keyword": "mcp server git",
      "mentions": 1
    },
    {
      "keyword": "continued malicious activity",
      "mentions": 1
    }
  ],
  "articles": [
    {
      "source": "The Hacker News",
      "title": "Three Flaws in Anthropic MCP Git Server Enable File Access and Code Execution",
      "link": "https://thehackernews.com/2026/01/three-flaws-in-anthropic-mcp-git-server.html",
      "summary": "A set of three security vulnerabilities has been disclosed in mcp-server-git, the official Git Model Context Protocol (MCP) server maintained by Anthropic, that could be exploited to read or delete arbitrary files and execute code under certain conditions. \"These flaws can be exploited through prompt injection, meaning an attacker who can influence what an AI assistant reads (a malicious README,",
      "published": "Tue, 20 Jan 2026 19:25:00 +0530",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Hackers Use LinkedIn Messages to Spread RAT Malware Through DLL Sideloading",
      "link": "https://thehackernews.com/2026/01/hackers-use-linkedin-messages-to-spread.html",
      "summary": "Cybersecurity researchers have uncovered a new phishing campaign that exploits social media private messages to propagate malicious payloads, likely with the intent to deploy a remote access trojan (RAT). The activity delivers \"weaponized files via Dynamic Link Library (DLL) sideloading, combined with a legitimate, open-source Python pen-testing script,\" ReliaQuest said in a report shared with",
      "published": "Tue, 20 Jan 2026 19:16:00 +0530",
      "value_score": 24,
      "value_signals": [
        "Phishing",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "The Hidden Risk of Orphan Accounts",
      "link": "https://thehackernews.com/2026/01/the-hidden-risk-of-orphan-accounts.html",
      "summary": "The Problem: The Identities Left Behind As organizations grow and evolve, employees, contractors, services, and systems come and go - but their accounts often remain. These abandoned or “orphan” accounts sit dormant across applications, platforms, assets, and cloud consoles. The reason they persist isn’t negligence - it’s fragmentation. Traditional IAM and IGA systems are designed",
      "published": "Tue, 20 Jan 2026 17:28:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Evelyn Stealer Malware Abuses VS Code Extensions to Steal Developer Credentials and Crypto",
      "link": "https://thehackernews.com/2026/01/evelyn-stealer-malware-abuses-vs-code.html",
      "summary": "Cybersecurity researchers have disclosed details of a malware campaign that's targeting software developers with a new information stealer called Evelyn Stealer by weaponizing the Microsoft Visual Studio Code (VS Code) extension ecosystem. \"The malware is designed to exfiltrate sensitive information, including developer credentials and cryptocurrency-related data. Compromised developer",
      "published": "Tue, 20 Jan 2026 17:18:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Cloudflare Fixes ACME Validation Bug Allowing WAF Bypass to Origin Servers",
      "link": "https://thehackernews.com/2026/01/cloudflare-fixes-acme-validation-bug.html",
      "summary": "Cloudflare has addressed a security vulnerability impacting its Automatic Certificate Management Environment (ACME) validation logic that made it possible to bypass security controls and access origin servers. \"The vulnerability was rooted in how our edge network processed requests destined for the ACME HTTP-01 challenge path (/.well-known/acme-challenge/*),\" the web infrastructure",
      "published": "Tue, 20 Jan 2026 16:42:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Why Secrets in JavaScript Bundles are Still Being Missed",
      "link": "https://thehackernews.com/2026/01/why-secrets-in-javascript-bundles-are.html",
      "summary": "Leaked API keys are no longer unusual, nor are the breaches that follow. So why are sensitive tokens still being so easily exposed? To find out, Intruder’s research team looked at what traditional vulnerability scanners actually cover and built a new secrets detection method to address gaps in existing approaches. Applying this at scale by scanning 5 million applications revealed over",
      "published": "Tue, 20 Jan 2026 16:15:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Tudou Guarantee Marketplace Halts Telegram Transactions After Processing Over $12 Billion",
      "link": "https://thehackernews.com/2026/01/tudou-guarantee-marketplace-halts.html",
      "summary": "A Telegram-based guarantee marketplace known for advertising a broad range of illicit services appears to be winding down its operations, according to new findings from Elliptic. The blockchain intelligence company said Tudou Guarantee has effectively ceased transactions through its public Telegram groups following a period of significant growth. The marketplace is estimated to have processed",
      "published": "Tue, 20 Jan 2026 13:10:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Google Gemini Prompt Injection Flaw Exposed Private Calendar Data via Malicious Invites",
      "link": "https://thehackernews.com/2026/01/google-gemini-prompt-injection-flaw.html",
      "summary": "Cybersecurity researchers have disclosed details of a security flaw that leverages indirect prompt injection targeting Google Gemini as a way to bypass authorization guardrails and use Google Calendar as a data extraction mechanism. The vulnerability, Miggo Security's Head of Research, Liad Eliyahu, said, made it possible to circumvent Google Calendar's privacy controls by hiding a dormant",
      "published": "Mon, 19 Jan 2026 22:51:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Make Identity Threat Detection your security strategy for 2026",
      "link": "https://www.bleepingcomputer.com/news/security/make-identity-threat-detection-your-security-strategy-for-2026/",
      "summary": "Identity-based attacks are one of the primary paths attackers use to breach corporate networks. Tenfold shows how Identity Threat Detection helps spot suspicious account activity before real damage occurs. [...]",
      "published": "Tue, 20 Jan 2026 10:01:11 -0500",
      "value_score": 22,
      "value_signals": [
        "Breach/leak"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Webinar: Aligning cybersecurity purchases with what your SOC team needs",
      "link": "https://www.bleepingcomputer.com/news/security/webinar-aligning-cybersecurity-purchases-with-what-your-soc-team-needs/",
      "summary": "Learn how security leaders and SOC teams can work together to close the gap between platform decisions and operational needs. Join Sumo Logic and BleepingComputer on January 29 for a practical webinar on aligning security tools with real-world workflows. [...]",
      "published": "Tue, 20 Jan 2026 08:15:23 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "ChatGPT Go now unlocks unlimited access to GPT-5.2 Instant for $8",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-go-now-unlocks-unlimited-access-to-gpt-52-instant-for-8/",
      "summary": "ChatGPT Go is finally worth your money, as OpenAI has almost doubled the usage limits and enabled ultimate access to GPT 5.2 Instant. [...]",
      "published": "Mon, 19 Jan 2026 20:24:25 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "You can get ChatGPT's $20 Plus subscription for free for a limited time",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/you-can-get-chatgpts-20-plus-subscription-for-free-for-a-limited-time/",
      "summary": "OpenAI is offering ChatGPT Plus, which costs $20 in the United States, for free, but the offer is valid for some accounts only, and it's a limited-time deal. [...]",
      "published": "Mon, 19 Jan 2026 20:07:57 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Fake ad blocker extension crashes the browser for ClickFix attacks",
      "link": "https://www.bleepingcomputer.com/news/security/fake-ad-blocker-extension-crashes-the-browser-for-clickfix-attacks/",
      "summary": "A malvertising campaign is using a fake ad-blocking Chrome and Edge extension named NexShield that intentionally crashes the browser in preparation for ClickFix attacks. [...]",
      "published": "Mon, 19 Jan 2026 17:49:46 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "New PDFSider Windows malware deployed on Fortune 100 firm's network",
      "link": "https://www.bleepingcomputer.com/news/security/new-pdfsider-windows-malware-deployed-on-fortune-100-firms-network/",
      "summary": "Ransomware attackers targeting a Fortune 100 company in the finance sector used a new malware strain, dubbed PDFSider, to deliver malicious payloads on Windows systems. [...]",
      "published": "Mon, 19 Jan 2026 16:00:34 -0500",
      "value_score": 28,
      "value_signals": [
        "Ransomware"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "UK govt. warns about ongoing Russian hacktivist group attacks",
      "link": "https://www.bleepingcomputer.com/news/security/uk-govt-warns-about-ongoing-russian-hacktivist-group-attacks/",
      "summary": "The U.K. government is warning of continued malicious activity from Russian-aligned hacktivist groups targeting critical infrastructure and local government organizations in the country in disruptive denial-of-service (DDoS) attacks. [...]",
      "published": "Mon, 19 Jan 2026 12:20:39 -0500",
      "value_score": 18,
      "value_signals": [
        "High severity"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Hacker admits to leaking stolen Supreme Court data on Instagram",
      "link": "https://www.bleepingcomputer.com/news/security/hacker-admits-to-leaking-stolen-supreme-court-data-on-instagram/",
      "summary": "A Tennessee man has pleaded guilty to hacking the U.S. Supreme Court's electronic filing system and breaching accounts at the AmeriCorps U.S. federal agency and the Department of Veterans Affairs. [...]",
      "published": "Mon, 19 Jan 2026 11:04:14 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, January 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "published": "Wed, 14 Jan 2026 00:47:38 +0000",
      "value_score": 40,
      "value_signals": [
        "Patch/update ×2",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Who Benefited from the Aisuru and Kimwolf Botnets?",
      "link": "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
      "summary": "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we'll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf's spread.",
      "published": "Thu, 08 Jan 2026 23:23:43 +0000",
      "value_score": 20,
      "value_signals": [
        "Botnet"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "The Kimwolf Botnet is Stalking Your Local Network",
      "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
      "summary": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.",
      "published": "Fri, 02 Jan 2026 14:20:10 +0000",
      "value_score": 26,
      "value_signals": [
        "Botnet",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Happy 16th Birthday, KrebsOnSecurity.com!",
      "link": "https://krebsonsecurity.com/2025/12/happy-16th-birthday-krebsonsecurity-com/",
      "summary": "KrebsOnSecurity.com celebrates its 16th anniversary today! A huge \"thank you\" to all of our readers -- newcomers, long-timers and drive-by critics alike. Your engagement this past year here has been tremendous and truly a salve on a handful of dark days. Happily, comeuppance was a strong theme running through our coverage in 2025, with a primary focus on entities that enabled complex and globally-dispersed cybercrime services.",
      "published": "Mon, 29 Dec 2025 20:23:26 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Dismantling Defenses: Trump 2.0 Cyber Year in Review",
      "link": "https://krebsonsecurity.com/2025/12/dismantling-defenses-trump-2-0-cyber-year-in-review/",
      "summary": "The Trump administration has pursued a staggering range of policy pivots this past year that threaten to weaken the nation’s ability and willingness to address a broad spectrum of technology challenges, from cybersecurity and privacy to countering disinformation, fraud and corruption. These shifts, along with the president’s efforts to restrict free speech and freedom of the press, have come at such a rapid clip that many readers probably aren’t even aware of them all.",
      "published": "Fri, 19 Dec 2025 15:14:55 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Most Parked Domains Now Serving Malicious Content",
      "link": "https://krebsonsecurity.com/2025/12/most-parked-domains-now-serving-malicious-content/",
      "summary": "Direct navigation -- the act of visiting a website by manually typing a domain name in a web browser -- has never been riskier: A new study finds the vast majority of \"parked\" domains -- mostly expired or dormant domain names, or common misspellings of popular websites -- are now configured to redirect visitors to sites that foist scams and malware.",
      "published": "Tue, 16 Dec 2025 14:14:48 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Microsoft Patch Tuesday, December 2025 Edition",
      "link": "https://krebsonsecurity.com/2025/12/microsoft-patch-tuesday-december-2025-edition/",
      "summary": "Microsoft today pushed updates to fix at least 56 security flaws in its Windows operating systems and supported software. This final Patch Tuesday of 2025 tackles one zero-day bug that is already being exploited, as well as two publicly disclosed vulnerabilities.",
      "published": "Tue, 09 Dec 2025 23:18:29 +0000",
      "value_score": 57,
      "value_signals": [
        "Zero-day",
        "Patch/update ×3",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Drones to Diplomas: How Russia’s Largest Private University is Linked to a $25M Essay Mill",
      "link": "https://krebsonsecurity.com/2025/12/drones-to-diplomas-how-russias-largest-private-university-is-linked-to-a-25m-essay-mill/",
      "summary": "A sprawling academic cheating network turbocharged by Google Ads that has generated nearly $25 million in revenue has curious connections to a Kremlin-connected oligarch whose Russian university builds drones for Russia's war against Ukraine.",
      "published": "Sat, 06 Dec 2025 14:45:03 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "ChatGPT Health Raises Big Security, Safety Concerns",
      "link": "https://www.darkreading.com/remote-workforce/chatgpt-health-security-safety-concerns",
      "summary": "ChatGPT Health promises robust data protection, but elements of the rollout raise big questions regarding user security and safety.",
      "published": "Mon, 19 Jan 2026 17:57:52 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "More Problems for Fortinet: Critical FortiSIEM Flaw Exploited",
      "link": "https://www.darkreading.com/vulnerabilities-threats/fortinet-critical-fortisiem-flaw-exploited",
      "summary": "CVE-2025-64155, a command injection vulnerability, was disclosed earlier this week and quickly came under attack from a variety of IP addresses.",
      "published": "Fri, 16 Jan 2026 21:03:37 GMT",
      "value_score": 42,
      "value_signals": [
        "CVE mentioned",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "CISOs Rise to Prominence: Security Leaders Join the Executive Suite",
      "link": "https://www.darkreading.com/cybersecurity-operations/cisos-rise-to-prominence-security-leaders-join-the-executive-suite",
      "summary": "Security professionals are moving up the executive ranks as enterprises face rising regulatory and compliance standards.",
      "published": "Fri, 16 Jan 2026 15:25:40 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "AI System Reduces Attack Reconstruction Time From Weeks to Hours",
      "link": "https://www.darkreading.com/cybersecurity-operations/ai-system-attack-reconstruction-weeks-hours",
      "summary": "Pacific Northwest National Labs' expert cybersecurity system, ALOHA, can recreate attacks and test them against organizations' infrastructure to bolster defense.",
      "published": "Fri, 16 Jan 2026 14:00:00 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Predator Spyware Sample Indicates 'Vendor-Controlled' C2",
      "link": "https://www.darkreading.com/mobile-security/predator-spyware-sample-vendor-controlled-c2",
      "summary": "Researchers detailed how Intellexa, Predator's owner, uses failed deployments and thwarted infections to strengthen its commercial spyware and generate more effective attacks.",
      "published": "Thu, 15 Jan 2026 21:26:18 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Winter Olympics Could Share Podium With Cyberattackers",
      "link": "https://www.darkreading.com/remote-workforce/winter-olympics-podium-cyberattackers",
      "summary": "The upcoming Winter Games in the Italian Alps are attracting both hacktivists looking to reach billions of people and state-sponsored cyber-spies targeting the attending glitterati.",
      "published": "Thu, 15 Jan 2026 19:10:05 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Vulnerabilities Surge, But Messy Reporting Blurs Picture",
      "link": "https://www.darkreading.com/cybersecurity-analytics/vulnerabilities-surge-messy-reporting-blurs-picture",
      "summary": "MITRE loses its lead as the top reporter of vulnerabilities, while new organizations pump out CVEs and reported bugs in WordPress plug-ins surge.",
      "published": "Thu, 15 Jan 2026 15:19:31 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Trio of Critical Bugs Spotted in Delta Industrial PLCs",
      "link": "https://www.darkreading.com/ics-ot-security/critical-bugs-delta-industrial-plcs",
      "summary": "Experts disagree on whether the vulnerabilities in a programmable logic controller from Delta are a five-alarm fire or not much to worry over.",
      "published": "Thu, 15 Jan 2026 11:00:00 GMT",
      "value_score": 18,
      "value_signals": [
        "High severity"
      ]
    },
    {
      "source": "Security Week",
      "title": "Chainlit Vulnerabilities May Leak Sensitive Information",
      "link": "https://www.securityweek.com/chainlit-vulnerabilities-may-leak-sensitive-information/",
      "summary": "The two bugs, an arbitrary file read and an SSRF bug, can be exploited without user interaction to leak credentials, databases, and other data. The post Chainlit Vulnerabilities May Leak Sensitive Information appeared first on SecurityWeek .",
      "published": "Tue, 20 Jan 2026 14:13:54 +0000",
      "value_score": 40,
      "value_signals": [
        "Breach/leak ×3",
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "APT-Grade PDFSider Malware Used by Ransomware Groups",
      "link": "https://www.securityweek.com/apt-grade-pdfsider-malware-used-by-ransomware-groups/",
      "summary": "Providing cyberespionage and remote code execution capabilities, the malware is executed via DLL sideloading. The post APT-Grade PDFSider Malware Used by Ransomware Groups appeared first on SecurityWeek .",
      "published": "Tue, 20 Jan 2026 12:09:44 +0000",
      "value_score": 66,
      "value_signals": [
        "Ransomware ×2",
        "RCE"
      ]
    },
    {
      "source": "Security Week",
      "title": "Weaponized Invite Enabled Calendar Data Theft via Google Gemini",
      "link": "https://www.securityweek.com/weaponized-invite-enabled-calendar-data-theft-via-google-gemini/",
      "summary": "A simple payload allowed attackers to create a new event leaking summaries of the victim’s private meetings. The post Weaponized Invite Enabled Calendar Data Theft via Google Gemini appeared first on SecurityWeek .",
      "published": "Tue, 20 Jan 2026 10:59:36 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "TP-Link Patches Vulnerability Exposing VIGI Cameras to Remote Hacking",
      "link": "https://www.securityweek.com/tp-link-patches-vulnerability-exposing-vigi-cameras-to-hacking/",
      "summary": "The researcher who discovered the vulnerability saw more than 2,500 internet-exposed devices. The post TP-Link Patches Vulnerability Exposing VIGI Cameras to Remote Hacking appeared first on SecurityWeek .",
      "published": "Mon, 19 Jan 2026 14:39:37 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Jordanian Admits in US Court to Selling Access to 50 Enterprise Networks",
      "link": "https://www.securityweek.com/jordanian-admits-in-us-court-to-selling-access-to-50-enterprise-networks/",
      "summary": "Operating as an access broker, the defendant sold unauthorized access to compromised networks to an undercover agent. The post Jordanian Admits in US Court to Selling Access to 50 Enterprise Networks appeared first on SecurityWeek .",
      "published": "Mon, 19 Jan 2026 13:48:43 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "‘SolyxImmortal’ Information Stealer Emerges",
      "link": "https://www.securityweek.com/solyximmortal-information-stealer-emerges/",
      "summary": "The information stealer abuses legitimate APIs and libraries to exfiltrate data to Discord webhooks. The post ‘SolyxImmortal’ Information Stealer Emerges appeared first on SecurityWeek .",
      "published": "Mon, 19 Jan 2026 13:35:09 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Cyber Insights 2026: Information Sharing",
      "link": "https://www.securityweek.com/cyber-insights-2026-information-sharing/",
      "summary": "Information sharing is necessary for efficient cybersecurity, and is widespread; but never quite perfect in practice. The post Cyber Insights 2026: Information Sharing appeared first on SecurityWeek .",
      "published": "Mon, 19 Jan 2026 13:30:00 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "New Reports Reinforce Cyberattack’s Role in Maduro Capture Blackout",
      "link": "https://www.securityweek.com/new-reports-reinforce-cyberattacks-role-in-maduro-capture-blackout/",
      "summary": "US officials told The New York Times that cyberattacks were used to turn off the lights in Caracas and disrupt air defense radars. The post New Reports Reinforce Cyberattack’s Role in Maduro Capture Blackout appeared first on SecurityWeek .",
      "published": "Mon, 19 Jan 2026 12:26:38 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "summary": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "published": "Wed, 31 Aug 2022 12:57:48 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "published": "Tue, 30 Aug 2022 16:00:43 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "published": "Mon, 29 Aug 2022 14:56:19 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "published": "Fri, 26 Aug 2022 16:44:27 +0000",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "published": "Thu, 25 Aug 2022 18:47:15 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Twitter Whistleblower Complaint: The TL;DR Version",
      "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
      "summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk.",
      "published": "Wed, 24 Aug 2022 14:17:04 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
      "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
      "summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP.",
      "published": "Tue, 23 Aug 2022 13:19:58 +0000",
      "value_score": 50,
      "value_signals": [
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Fake Reservation Links Prey on Weary Travelers",
      "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
      "summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels.",
      "published": "Mon, 22 Aug 2022 13:59:06 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "CISA Alerts",
      "title": "AVEVA Process Optimization",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-015-01",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could enable an attacker to execute remote code, perform SQL injection, escalate privileges, or access sensitive information. The following versions of AVEVA Process Optimization are affected: Process Optimization (CVE-2025-61937, CVE-2025-64691, CVE-2025-61943, CVE-2025-65118, CVE-2025-64729, CVE-2025-65117, CVE-2025-64769) CVSS Vendor Equipment Vulnerabilities v3 10 AVEVA AVEVA Process Optimization Improper Control of Generatio",
      "published": "Thu, 15 Jan 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×7",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Secure Connectivity Principles for Operational Technology (OT)",
      "link": "https://www.cisa.gov/resources-tools/resources/secure-connectivity-principles-operational-technology-ot",
      "summary": "CISA and the UK National Cyber Security Centre (NCSC-UK), in collaboration with federal and international partners, have released Secure Connectivity Principles for Operational Technology (OT) guidance to help asset owners address increasing business and regulatory pressures for connectivity into operational technology (OT) networks. This guidance outlines eight principles to use as a framework to design, secure, and manage connectivity into OT environments. These principles are particularly cri",
      "published": "Wed, 14 Jan 26 12:00:00 +0000",
      "value_score": 55,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CISA/KEV"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Siemens RUGGEDCOM ROS",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-015-05",
      "summary": "View CSAF Summary Ruggedcom ROS devices contain a temporary denial of service vulnerability that could allow an attacker to crash and restart the device. Siemens has released new versions for the affected products and recommends to update to the latest versions. The following versions of Siemens RUGGEDCOM ROS are affected: RUGGEDCOM RMC8388 V5.X (CVE-2025-40935) RUGGEDCOM RS416Pv2 V5.X (CVE-2025-40935) RUGGEDCOM RS416v2 V5.X (CVE-2025-40935) RUGGEDCOM RS900 (32M) V5.X (CVE-2025-40935) RUGGEDCOM ",
      "published": "Wed, 14 Jan 26 12:00:00 +0000",
      "value_score": 91,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "Patch/update",
        "Multiple CVEs"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Siemens TeleControl Server Basic",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-015-03",
      "summary": "View CSAF Summary TeleControl Server Basic before V3.1.2.4 contains a local privilege escalation vulnerability that could allow an attacker to run arbitrary code with elevated privileges. Siemens has released a new version for TeleControl Server Basic and recommends to update to the latest version. The following versions of Siemens TeleControl Server Basic are affected: TeleControl Server Basic (CVE-2025-40942) CVSS Vendor Equipment Vulnerabilities v3 8.8 Siemens Siemens TeleControl Server Basic",
      "published": "Wed, 14 Jan 26 12:00:00 +0000",
      "value_score": 73,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "Privilege escalation",
        "Patch/update"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Siemens SIMATIC and SIPLUS products",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-015-04",
      "summary": "View CSAF Summary Siemens ET 200SP contains a denial-of-service vulnerability that could be triggered by sending a valid S7 protocol Disconnect Request (COTP DR TPDU), causing the device to become unresponsive and require a power cycle to recover. Siemens has released new versions for several affected products and recommends to update to the latest versions. Siemens is preparing further fix versions and recommends specific countermeasures for products where fixes are not, or not yet available. T",
      "published": "Wed, 14 Jan 26 12:00:00 +0000",
      "value_score": 51,
      "value_signals": [
        "Source boost: CISA Alerts",
        "Patch/update ×2"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Siemens Industrial Edge Device Kit",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-015-09",
      "summary": "View CSAF Summary Users of Industrial Edge Devices are advised to consult the respective Security Advisories for their devices (for Siemens Industrial Edge devices see Additional Information). Industrial Edge Device Kit contains an authorization bypass vulnerability that could facilitate an unauthenticated remote attacker to circumvent authentication and impersonate a legitimate user. Siemens has released new versions for several affected products and recommends to update to the latest versions.",
      "published": "Wed, 14 Jan 26 12:00:00 +0000",
      "value_score": 43,
      "value_signals": [
        "Source boost: CISA Alerts",
        "Patch/update"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Siemens RUGGEDCOM APE1808 Devices",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-015-07",
      "summary": "View CSAF Summary Nozomi Networks has published information on vulnerabilities in Nozomi Guardian/CMC. This advisory lists the related Siemens Industrial products affected by these vulnerabilities. Siemens is preparing fix versions and recommends countermeasures for products where fixes are not, or not yet available. The following versions of Siemens RUGGEDCOM APE1808 Devices are affected: RUGGEDCOM APE1808 (CVE-2025-40891, CVE-2025-40892, CVE-2025-40893, CVE-2025-40898) CVSS Vendor Equipment Vu",
      "published": "Wed, 14 Jan 26 12:00:00 +0000",
      "value_score": 91,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "Patch/update",
        "Multiple CVEs"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Siemens SINEC Security Monitor",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-015-06",
      "summary": "View CSAF Summary SINEC Security Monitor before V4.10.0 contains multiple vulnerabilities. Siemens has released a new version for SINEC Security Monitor and recommends to update to the latest version. The following versions of Siemens SINEC Security Monitor are affected: SINEC Security Monitor (CVE-2025-40830, CVE-2025-40831) CVSS Vendor Equipment Vulnerabilities v3 6.7 Siemens Siemens SINEC Security Monitor Improper Authorization, Improper Input Validation Background Critical Infrastructure Sec",
      "published": "Wed, 14 Jan 26 12:00:00 +0000",
      "value_score": 95,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "Patch/update",
        "High severity",
        "Multiple CVEs"
      ]
    }
  ],
  "sources": [
    "The Hacker News",
    "BleepingComputer",
    "Krebs on Security",
    "Dark Reading",
    "Security Week",
    "Naked Security",
    "Threatpost",
    "CISA Alerts"
  ]
}