{
  "last_updated": "2026-02-10 16:58",
  "sources_count": 8,
  "articles_count": 56,
  "keywords": [
    "scattered lapsus shinyhunters",
    "badbox 2 0",
    "ics security gaps",
    "credit reporting agency",
    "twitter whistleblower complaint",
    "incident took place",
    "high value assets",
    "130 companies tangled",
    "targeting indian defense",
    "north america microsoft",
    "multi stage intrusion",
    "defense evasion technique",
    "released security updates",
    "multi stage attacks",
    "deploy dfir tool",
    "well planned campaign",
    "virtual event shields",
    "velociraptor forensics tools",
    "urge defensive action",
    "today we'll dig"
  ],
  "trending": [
    {
      "keyword": "scattered lapsus shinyhunters",
      "mentions": 48
    },
    {
      "keyword": "badbox 2 0",
      "mentions": 79
    },
    {
      "keyword": "ics security gaps",
      "mentions": 2
    },
    {
      "keyword": "credit reporting agency",
      "mentions": 2
    },
    {
      "keyword": "twitter whistleblower complaint",
      "mentions": 645
    },
    {
      "keyword": "incident took place",
      "mentions": 1
    },
    {
      "keyword": "high value assets",
      "mentions": 10
    },
    {
      "keyword": "130 companies tangled",
      "mentions": 119
    },
    {
      "keyword": "targeting indian defense",
      "mentions": 1
    },
    {
      "keyword": "north america microsoft",
      "mentions": 1
    }
  ],
  "articles": [
    {
      "source": "The Hacker News",
      "title": "Reynolds Ransomware Embeds BYOVD Driver to Disable EDR Security Tools",
      "link": "https://thehackernews.com/2026/02/reynolds-ransomware-embeds-byovd-driver.html",
      "summary": "Cybersecurity researchers have disclosed details of an emergent ransomware family dubbed Reynolds that comes embedded with a built-in bring your own vulnerable driver (BYOVD) component for defense evasion purposes within the ransomware payload itself. BYOVD refers to an adversarial technique that abuses legitimate but flawed driver software to escalate privileges and disable Endpoint Detection",
      "published": "Tue, 10 Feb 2026 20:06:00 +0530",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×3"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "From Ransomware to Residency: Inside the Rise of the Digital Parasite",
      "link": "https://thehackernews.com/2026/02/from-ransomware-to-residency-inside.html",
      "summary": "Are ransomware and encryption still the defining signals of modern cyberattacks, or has the industry been too fixated on noise while missing a more dangerous shift happening quietly all around them? According to Picus Labs’ new Red Report 2026, which analyzed over 1.1 million malicious files and mapped 15.5 million adversarial actions observed across 2025, attackers are no longer optimizing for",
      "published": "Tue, 10 Feb 2026 19:29:00 +0530",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Fortinet Patches Critical SQLi Flaw Enabling Unauthenticated Code Execution",
      "link": "https://thehackernews.com/2026/02/fortinet-patches-critical-sqli-flaw.html",
      "summary": "Fortinet has released security updates to address a critical flaw impacting FortiClientEMS that could lead to the execution of arbitrary code on susceptible systems. The vulnerability, tracked as CVE-2026-21643, has a CVSS rating of 9.1 out of a maximum of 10.0. \"An improper neutralization of special elements used in an SQL Command ('SQL Injection') vulnerability [CWE-89] in FortiClientEMS may",
      "published": "Tue, 10 Feb 2026 19:00:00 +0530",
      "value_score": 44,
      "value_signals": [
        "CVE mentioned",
        "High severity ×2"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "ZAST.AI Raises $6M Pre-A to Scale \"Zero False Positive\" AI-Powered Code Security",
      "link": "https://thehackernews.com/2026/02/zastai-raises-6m-pre-to-scale-zero.html",
      "summary": "January 5, 2026, Seattle, USA — ZAST.AI announced the completion of a $6 million Pre-A funding round. This investment came from the well-known investment firm Hillhouse Capital, bringing ZAST.AI's total funding close to $10 million. This marks a recognition from leading capital markets of a new solution: ending the era of high false positive rates in security tools and making every alert",
      "published": "Tue, 10 Feb 2026 17:10:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Warlock Ransomware Breaches SmarterTools Through Unpatched SmarterMail Server",
      "link": "https://thehackernews.com/2026/02/warlock-ransomware-breaches.html",
      "summary": "SmarterTools confirmed last week that the Warlock (aka Storm-2603) ransomware gang breached its network by exploiting an unpatched SmarterMail instance. The incident took place on January 29, 2026, when a mail server that was not updated to the latest version was compromised, the company's Chief Commercial Officer, Derek Curtis, said. \"Prior to the breach, we had approximately 30 servers/VMs",
      "published": "Tue, 10 Feb 2026 15:54:00 +0530",
      "value_score": 64,
      "value_signals": [
        "Ransomware ×2",
        "Breach/leak",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Dutch Authorities Confirm Ivanti Zero-Day Exploit Exposed Employee Contact Data",
      "link": "https://thehackernews.com/2026/02/dutch-authorities-confirm-ivanti-zero.html",
      "summary": "The Netherlands' Dutch Data Protection Authority (AP) and the Council for the Judiciary confirmed both agencies (Rvdr) have disclosed that their systems were impacted by cyber attacks that exploited the recently disclosed security flaws in Ivanti Endpoint Manager Mobile (EPMM), according to a notice sent to the country's parliament on Friday. \"On January 29, the National Cyber Security Center (",
      "published": "Tue, 10 Feb 2026 13:52:00 +0530",
      "value_score": 41,
      "value_signals": [
        "Zero-day",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "China-Linked UNC3886 Targets Singapore Telecom Sector in Cyber Espionage Campaign",
      "link": "https://thehackernews.com/2026/02/china-linked-unc3886-targets-singapore.html",
      "summary": "The Cyber Security Agency (CSA) of Singapore on Monday revealed that the China-nexus cyber espionage group known as UNC3886 targeted its telecommunications sector. \"UNC3886 had launched a deliberate, targeted, and well-planned campaign against Singapore's telecommunications sector,\" CSA said. \"All four of Singapore's major telecommunications operators ('telcos') – M1, SIMBA Telecom, Singtel, and",
      "published": "Mon, 09 Feb 2026 22:31:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "SolarWinds Web Help Desk Exploited for RCE in Multi-Stage Attacks on Exposed Servers",
      "link": "https://thehackernews.com/2026/02/solarwinds-web-help-desk-exploited-for.html",
      "summary": "Microsoft has revealed that it observed a multi‑stage intrusion that involved the threat actors exploiting internet‑exposed SolarWinds Web Help Desk (WHD) instances to obtain initial access and move laterally across the organization's network to other high-value assets. That said, the Microsoft Defender Security Research Team said it's not clear whether the activity weaponized recently",
      "published": "Mon, 09 Feb 2026 20:12:00 +0530",
      "value_score": 36,
      "value_signals": [
        "RCE",
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft 365 outage takes down admin center in North America",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-365-outage-takes-down-admin-center-in-north-america/",
      "summary": "Microsoft is investigating an outage that blocks some administrators with business or enterprise subscriptions from accessing the Microsoft 365 admin center. [...]",
      "published": "Tue, 10 Feb 2026 10:45:15 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "How to Automate AWS Incident Investigation with Tines and AI",
      "link": "https://www.bleepingcomputer.com/news/security/how-to-automate-aws-incident-investigation-with-tines-and-ai/",
      "summary": "Cloud incidents drag on when analysts have to leave cases to hunt through AWS consoles and CLIs. Tines shows how automated agents pull AWS CLI data directly into cases, reducing MTTR and manual investigation work. [...]",
      "published": "Tue, 10 Feb 2026 10:01:11 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft announces new mobile-style Windows security controls",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-announces-new-mobile-style-windows-security-controls/",
      "summary": "Microsoft wants to introduce smartphone-style app permission prompts in Windows 11 to request user consent before apps can access sensitive resources such as files, cameras, and microphones. [...]",
      "published": "Tue, 10 Feb 2026 08:16:32 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "ZeroDayRAT malware grants full access to Android, iOS devices",
      "link": "https://www.bleepingcomputer.com/news/security/zerodayrat-malware-grants-full-access-to-android-ios-devices/",
      "summary": "A new commercial mobile spyware platform dubbed ZeroDayRAT is being advertised to cybercriminals on Telegram as a tool that provides full remote control over compromised Android and iOS devices. [...]",
      "published": "Tue, 10 Feb 2026 08:00:00 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Fugitive behind $73M 'pig butchering' scheme gets 20 years in prison",
      "link": "https://www.bleepingcomputer.com/news/security/fugitive-behind-73m-pig-butchering-scheme-gets-20-years-in-prison/",
      "summary": "A dual Chinese and St. Kitts and Nevis national was sentenced to 20 years in prison in absentia for his role in an international cryptocurrency investment scheme (also known as pig butchering or romance baiting) that defrauded victims of more than $73 million. [...]",
      "published": "Tue, 10 Feb 2026 03:17:54 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Chinese cyberspies breach Singapore's four largest telcos",
      "link": "https://www.bleepingcomputer.com/news/security/chinese-cyberspies-breach-singapores-four-largest-telcos/",
      "summary": "The Chinese threat actor tracked as UNC3886 breached Singapore's four largest telecommunication service providers, Singtel, StarHub, M1, and Simba, at least once last year. [...]",
      "published": "Mon, 09 Feb 2026 17:47:53 -0500",
      "value_score": 22,
      "value_signals": [
        "Breach/leak"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Hackers exploit SolarWinds WHD flaws to deploy DFIR tool in attacks",
      "link": "https://www.bleepingcomputer.com/news/security/threat-actors-exploit-solarwinds-wdh-flaws-to-deploy-velociraptor/",
      "summary": "Hackers are now exploiting SolarWinds Web Help Desk (WHD) vulnerabilities to gain code execution rights on exposed systems and deploy legitimate tools, including the Velociraptor forensics tools, for persistence and remote control. [...]",
      "published": "Mon, 09 Feb 2026 15:28:15 -0500",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Hackers breach SmarterTools network using flaw in its own software",
      "link": "https://www.bleepingcomputer.com/news/security/hackers-breach-smartertools-network-using-flaw-in-its-own-software/",
      "summary": "SmarterTools confirmed last week that the Warlock ransomware gang breached its network after compromising an email system, but did not impact business applications or account data. [...]",
      "published": "Mon, 09 Feb 2026 14:08:58 -0500",
      "value_score": 40,
      "value_signals": [
        "Ransomware",
        "Breach/leak"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Please Don’t Feed the Scattered Lapsus ShinyHunters",
      "link": "https://krebsonsecurity.com/2026/02/please-dont-feed-the-scattered-lapsus-shiny-hunters/",
      "summary": "A prolific data ransom gang that calls itself Scattered Lapsus ShinyHunters (SLSH) has a distinctive playbook when it seeks to extort payment from victim firms: Harassing, threatening and even swatting executives and their families, all while notifying journalists and regulators… Read More »",
      "published": "Mon, 02 Feb 2026 16:15:16 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Who Operates the Badbox 2.0 Botnet?",
      "link": "https://krebsonsecurity.com/2026/01/who-operates-the-badbox-2-0-botnet/",
      "summary": "The cybercriminals in control of Kimwolf -- a disruptive botnet that has infected more than 2 million devices -- recently shared a screenshot indicating they'd compromised the control panel for Badbox 2.0, a vast China-based botnet powered by malicious software that comes pre-installed on many Android TV streaming boxes. Both the FBI and Google say they are hunting for the people behind Badbox 2.0, and thanks to bragging by the Kimwolf botmasters we may now have a much clearer idea about that.",
      "published": "Mon, 26 Jan 2026 16:11:38 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×3"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
      "link": "https://krebsonsecurity.com/2026/01/kimwolf-botnet-lurking-in-corporate-govt-networks/",
      "summary": "A new Internet-of-Things botnet called Kimwolf has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf's ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.",
      "published": "Tue, 20 Jan 2026 18:19:13 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×2"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, January 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "published": "Wed, 14 Jan 2026 00:47:38 +0000",
      "value_score": 40,
      "value_signals": [
        "Patch/update ×2",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Who Benefited from the Aisuru and Kimwolf Botnets?",
      "link": "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
      "summary": "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we'll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf's spread.",
      "published": "Thu, 08 Jan 2026 23:23:43 +0000",
      "value_score": 20,
      "value_signals": [
        "Botnet"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "The Kimwolf Botnet is Stalking Your Local Network",
      "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
      "summary": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.",
      "published": "Fri, 02 Jan 2026 14:20:10 +0000",
      "value_score": 26,
      "value_signals": [
        "Botnet",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Happy 16th Birthday, KrebsOnSecurity.com!",
      "link": "https://krebsonsecurity.com/2025/12/happy-16th-birthday-krebsonsecurity-com/",
      "summary": "KrebsOnSecurity.com celebrates its 16th anniversary today! A huge \"thank you\" to all of our readers -- newcomers, long-timers and drive-by critics alike. Your engagement this past year here has been tremendous and truly a salve on a handful of dark days. Happily, comeuppance was a strong theme running through our coverage in 2025, with a primary focus on entities that enabled complex and globally-dispersed cybercrime services.",
      "published": "Mon, 29 Dec 2025 20:23:26 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Dismantling Defenses: Trump 2.0 Cyber Year in Review",
      "link": "https://krebsonsecurity.com/2025/12/dismantling-defenses-trump-2-0-cyber-year-in-review/",
      "summary": "The Trump administration has pursued a staggering range of policy pivots this past year that threaten to weaken the nation’s ability and willingness to address a broad spectrum of technology challenges, from cybersecurity and privacy to countering disinformation, fraud and corruption. These shifts, along with the president’s efforts to restrict free speech and freedom of the press, have come at such a rapid clip that many readers probably aren’t even aware of them all.",
      "published": "Fri, 19 Dec 2025 15:14:55 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "OT Attacks Get Scary With 'Living-off-the-Plant' Techniques",
      "link": "https://www.darkreading.com/ics-ot-security/ot-attacks-living-off-the-plant",
      "summary": "Ironically, security by obscurity has helped prevent dangerous OT attacks in recent years. It won't be that way forever.",
      "published": "Tue, 10 Feb 2026 16:14:29 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "TransUnion's Real Networks Deal Focuses on Robocall Blocking",
      "link": "https://www.darkreading.com/cyber-risk/transunion-s-real-networks-deal-focuses-on-robocall-blocking",
      "summary": "The acquisition allows the credit reporting agency to add SMS spam and scam prevention to its robocall blocking capabilities.",
      "published": "Mon, 09 Feb 2026 23:05:21 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Warlock Gang Breaches SmarterTools Via SmarterMail Bugs",
      "link": "https://www.darkreading.com/application-security/warlock-gang-breaches-smartertools-smartermail-bugs",
      "summary": "The ransomware group breached SmarterTools through a vulnerability in the company's own SmarterMail product.",
      "published": "Mon, 09 Feb 2026 21:59:02 GMT",
      "value_score": 28,
      "value_signals": [
        "Ransomware"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "TeamPCP Turns Cloud Infrastructure Into Crime Bots",
      "link": "https://www.darkreading.com/cloud-security/teampcp-cloud-infrastructure-crime-bots",
      "summary": "The threat actor has been compromising cloud environments at scale with automated worm-like attacks on exposed services and interfaces.",
      "published": "Mon, 09 Feb 2026 21:14:34 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "'Reynolds' Bundles BYOVD With Ransomware Payload",
      "link": "https://www.darkreading.com/threat-intelligence/black-basta-bundles-byovd-ransomware-payload",
      "summary": "Researchers discovered a newly disclosed vulnerable driver embedded in Reynolds' ransomware, illustrating the increasing popularity of the defense-evasion technique.",
      "published": "Mon, 09 Feb 2026 20:14:22 GMT",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "[Virtual Event] Shields Up: Key Technologies Reshaping Cybersecurity Defenses",
      "link": "https://www.darkreading.com/events/shields-up-key-technologies-reshaping-cybersecurity-defenses",
      "summary": "",
      "published": "2026-03-19T15:00:00.000Z",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "What Organizations Need to Change When Managing Printers",
      "link": "https://www.darkreading.com/cybersecurity-operations/what-organizations-need-to-change-when-managing-printers",
      "summary": "Ask the Expert: Organizations need to close the ownership vacuum, establish durable security controls, and ensure printers are protected as rigorously as other endpoints.",
      "published": "Mon, 09 Feb 2026 17:22:18 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "'Encrypt It Already' Campaign Pushes Big Tech to Prioritize E2E Encryption",
      "link": "https://www.darkreading.com/cloud-security/encrypt-it-already-pushes-big-tech-e2e-encryption",
      "summary": "The Electronic Frontier Foundation is urging major technology companies to follow through on their promises to implement end-to-end encryption (E2E) by default across their services, as privacy concerns mount amid increased AI use.",
      "published": "Fri, 06 Feb 2026 16:34:41 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "RATs in the Machine: Inside a Pakistan-Linked Three-Pronged Cyber Assault on India",
      "link": "https://www.securityweek.com/rats-in-the-machine-inside-a-pakistan-linked-three-pronged-cyber-assault-on-india/",
      "summary": "Transparent Tribe (APT36) is targeting Indian defense and government sectors with GETA, ARES, and Desk RATs in a new wave of economic cyber espionage. The post RATs in the Machine: Inside a Pakistan-Linked Three-Pronged Cyber Assault on India appeared first on SecurityWeek .",
      "published": "Tue, 10 Feb 2026 16:00:00 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "SAP Patches Critical CRM, S/4HANA, NetWeaver Vulnerabilities",
      "link": "https://www.securityweek.com/sap-patches-critical-crm-s-4hana-netweaver-vulnerabilities/",
      "summary": "SAP has released 26 new and one updated security notes on February 2026 security patch day. The post SAP Patches Critical CRM, S/4HANA, NetWeaver Vulnerabilities appeared first on SecurityWeek .",
      "published": "Tue, 10 Feb 2026 14:54:35 +0000",
      "value_score": 34,
      "value_signals": [
        "Patch/update",
        "High severity ×2"
      ]
    },
    {
      "source": "Security Week",
      "title": "Backslash Raises $19 Million to Secure Vibe Coding",
      "link": "https://www.securityweek.com/backslash-raises-19-million-to-secure-vibe-coding/",
      "summary": "The company will use the investment to expand its R&D team and operations, deepen platform capabilities, and scale go-to-market presence. The post Backslash Raises $19 Million to Secure Vibe Coding appeared first on SecurityWeek .",
      "published": "Tue, 10 Feb 2026 14:01:08 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "New ‘ZeroDayRAT’ Spyware Kit Enables Total Compromise of iOS, Android Devices",
      "link": "https://www.securityweek.com/new-zerodayrat-spyware-kit-enables-total-compromise-of-ios-android-devices/",
      "summary": "Available via Telegram, researchers warn ZeroDayRAT is a ‘complete mobile compromise toolkit’ comparable to kits normally requiring nation-state resources to develop. The post New ‘ZeroDayRAT’ Spyware Kit Enables Total Compromise of iOS, Android Devices appeared first on SecurityWeek .",
      "published": "Tue, 10 Feb 2026 13:00:00 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "New ‘SSHStalker’ Linux Botnet Uses Old Techniques",
      "link": "https://www.securityweek.com/new-sshstalker-linux-botnet-uses-old-techniques/",
      "summary": "Estimated to have infected 7,000 systems, the botnet uses a mass-compromise pipeline, deploying various scanners and malware. The post New ‘SSHStalker’ Linux Botnet Uses Old Techniques appeared first on SecurityWeek .",
      "published": "Tue, 10 Feb 2026 12:50:56 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×3"
      ]
    },
    {
      "source": "Security Week",
      "title": "BeyondTrust Patches Critical RCE Vulnerability",
      "link": "https://www.securityweek.com/beyondtrust-patches-critical-rce-vulnerability/",
      "summary": "Affecting both RS and PRA, the bug can be exploited remotely via crafted requests without authentication. The post BeyondTrust Patches Critical RCE Vulnerability appeared first on SecurityWeek .",
      "published": "Tue, 10 Feb 2026 11:24:02 +0000",
      "value_score": 72,
      "value_signals": [
        "RCE ×2",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "Singapore: Rootkits, Zero-Day Used in Chinese Attack on Major Telecom Firms",
      "link": "https://www.securityweek.com/singapore-rootkits-zero-day-used-in-chinese-attack-on-major-telecom-firms/",
      "summary": "China-linked UNC3886 targeted all four major telecom providers, but did not disrupt services or access customer information. The post Singapore: Rootkits, Zero-Day Used in Chinese Attack on Major Telecom Firms appeared first on SecurityWeek .",
      "published": "Tue, 10 Feb 2026 10:09:46 +0000",
      "value_score": 60,
      "value_signals": [
        "Zero-day ×2"
      ]
    },
    {
      "source": "Security Week",
      "title": "RSAC Releases Quantickle Open Source Threat Intelligence Visualization Tool",
      "link": "https://www.securityweek.com/rsac-releases-quantickle-open-source-threat-intelligence-visualization-tool/",
      "summary": "Quantickle is a browser-based tool designed for creating visual representations of threat research. The post RSAC Releases Quantickle Open Source Threat Intelligence Visualization Tool appeared first on SecurityWeek .",
      "published": "Tue, 10 Feb 2026 07:27:03 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "summary": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "published": "Wed, 31 Aug 2022 12:57:48 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "published": "Tue, 30 Aug 2022 16:00:43 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "published": "Mon, 29 Aug 2022 14:56:19 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "published": "Fri, 26 Aug 2022 16:44:27 +0000",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "published": "Thu, 25 Aug 2022 18:47:15 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Twitter Whistleblower Complaint: The TL;DR Version",
      "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
      "summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk.",
      "published": "Wed, 24 Aug 2022 14:17:04 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
      "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
      "summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP.",
      "published": "Tue, 23 Aug 2022 13:19:58 +0000",
      "value_score": 50,
      "value_signals": [
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Fake Reservation Links Prey on Weary Travelers",
      "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
      "summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels.",
      "published": "Mon, 22 Aug 2022 13:59:06 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "CISA Alerts",
      "title": "Poland Energy Sector Cyber Incident Highlights OT and ICS Security Gaps",
      "link": "https://www.cisa.gov/news-events/alerts/2026/02/10/poland-energy-sector-cyber-incident-highlights-ot-and-ics-security-gaps",
      "summary": "The purpose of this Alert is to amplify Poland’s Computer Emergency Response Team (CERT Polska’s) Energy Sector Incident Report published on Jan. 30, 2026, and highlight key mitigations for Energy Sector stakeholders. In December 2025, a malicious cyber actor(s) targeted and compromised operational technology (OT) and industrial control systems (ICS) in Poland’s Energy Sector—specifically renewable energy plants, a combined heat and power plant, and a manufacturing sector company—in a cyber inci",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 35,
      "value_signals": [
        "Source boost: CISA Alerts"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Reducing the Attack Surface for End-of-Support Edge Devices",
      "link": "https://www.cisa.gov/resources-tools/resources/reducing-attack-surface-end-support-edge-devices",
      "summary": "Introduction The Cybersecurity and Infrastructure Security Agency (CISA), the Federal Bureau of Investigation (FBI), and the U.K.’s National Cyber Security Centre (NCSC) are releasing this fact sheet to urge defensive action against malicious cyber activity by nation-state threat actors. Nation-state threat actors exploit end-of-support (EOS) edge devices—including, but not limited to, load balancers, firewalls, routers, and virtual private network (VPN) gateways—to gain network access, maintain",
      "published": "Thu, 05 Feb 26 12:00:00 +0000",
      "value_score": 61,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CISA/KEV",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Mitsubishi Electric MELSEC iQ-R Series",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-036-02",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability may allow an attacker to read device data or part of a control program from the affected product, write device data in the affected product, or cause a denial-of-service condition on the affected product. The following versions of Mitsubishi Electric MELSEC iQ-R Series are affected: MELSEC iQ-R Series R08/16/32/120PCPU firmware <=48 (CVE-2025-15080) CVSS Vendor Equipment Vulnerabilities v3 9.4 Mitsubishi Electric Mitsubishi Electric",
      "published": "Thu, 05 Feb 26 12:00:00 +0000",
      "value_score": 59,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Hitachi Energy FOX61x",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-036-06",
      "summary": "View CSAF Summary Hitachi Energy is aware of a vulnerability that affects FOX61x product versions listed in this document. Successful exploitation of this vulnerability can lead to forgery attacks potentially causing impact on confidentiality, integrity and availability for the product. Please refer to the Recommended Immediate Actions for information about the mitigation/remediation. Note: This is applicable only if FOX61x devices are configured to use remote RADIUS authentication. The followin",
      "published": "Thu, 05 Feb 26 12:00:00 +0000",
      "value_score": 41,
      "value_signals": [
        "Source boost: CISA Alerts",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "o6 Automation GmbH Open62541",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-036-03",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an attacker to cause a denial-of-service condition and memory corruption. The following versions of o6 Automation GmbH Open62541 are affected: Open62541 >=1.5-rc1|<1.5-rc2 (CVE-2026-1301) CVSS Vendor Equipment Vulnerabilities v3 5.7 o6 Automation GmbH o6 Automation GmbH Open62541 Out-of-bounds Write Background Critical Infrastructure Sectors: Critical Manufacturing Countries/Areas Deployed: Worldwide Company Headquarters",
      "published": "Thu, 05 Feb 26 12:00:00 +0000",
      "value_score": 75,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds Two Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/02/05/cisa-adds-two-known-exploited-vulnerabilities-catalog",
      "summary": "CISA has added two new vulnerabilities to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2025-11953 React Native Community CLI OS Command Injection Vulnerability CVE-2026-24423 SmarterTools SmarterMail Missing Authentication for Critical Function Vulnerability These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reduc",
      "published": "Thu, 05 Feb 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "CISA/KEV ×5",
        "High severity",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Hitachi Energy XMC20",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-036-05",
      "summary": "View CSAF Summary Hitachi Energy is aware of a vulnerability that affects XMC20 product versions listed in this document. Successful exploitation of this vulnerability can lead to forgery attacks potentially causing impact on confidentiality, integrity and availability for the product. Please refer to the Recommended Immediate Actions for information about the mitigation/remediation. Note: This is applicable only if XMC20 devices are configured to use remote RADIUS authentication. The following ",
      "published": "Thu, 05 Feb 26 12:00:00 +0000",
      "value_score": 41,
      "value_signals": [
        "Source boost: CISA Alerts",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Ilevia EVE X1 Server",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-036-04",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could allow an attacker to execute arbitrary shell commands and the disclosure of sensitive system information. The following versions of Ilevia EVE X1 Server are affected: EVE X1 <=4.7.18.0 (CVE-2025-34185, CVE-2025-34184, CVE-2025-34183, CVE-2025-34186, CVE-2025-34187, CVE-2025-34517, CVE-2025-34518, CVE-2025-34512, CVE-2025-34513) CVSS Vendor Equipment Vulnerabilities v3 9.8 Ilevia Ilevia EVE X1 Server Improper Limitation of a",
      "published": "Thu, 05 Feb 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×9",
        "Multiple CVEs",
        "Exploit wording"
      ]
    }
  ],
  "sources": [
    "The Hacker News",
    "BleepingComputer",
    "Krebs on Security",
    "Dark Reading",
    "Security Week",
    "Naked Security",
    "Threatpost",
    "CISA Alerts"
  ]
}