{
  "last_updated": "2026-02-04 06:43",
  "sources_count": 8,
  "articles_count": 48,
  "keywords": [
    "rapidfort raises 42m",
    "infrastructure hosting notepad",
    "ai powered automation",
    "rockwell automation controllogix",
    "twitter whistleblower complaint",
    "sprawling phishing campaign",
    "resulting ripple effects",
    "multistage infection chain",
    "hacking group weaponizing",
    "2 857 skills",
    "14 million records",
    "cybersecurity company zscaler",
    "company will invest",
    "platform s capabilities",
    "internal network behind",
    "vulnerability allows hackers",
    "vulnerabilities earned microsoft's",
    "unauthorized mfa enrollment",
    "today we'll dig",
    "take full control"
  ],
  "trending": [
    {
      "keyword": "rapidfort raises 42m",
      "mentions": 7
    },
    {
      "keyword": "infrastructure hosting notepad",
      "mentions": 11
    },
    {
      "keyword": "ai powered automation",
      "mentions": 7
    },
    {
      "keyword": "rockwell automation controllogix",
      "mentions": 59
    },
    {
      "keyword": "twitter whistleblower complaint",
      "mentions": 576
    },
    {
      "keyword": "sprawling phishing campaign",
      "mentions": 133
    },
    {
      "keyword": "resulting ripple effects",
      "mentions": 9
    },
    {
      "keyword": "multistage infection chain",
      "mentions": 4
    },
    {
      "keyword": "hacking group weaponizing",
      "mentions": 10
    },
    {
      "keyword": "2 857 skills",
      "mentions": 14
    }
  ],
  "articles": [
    {
      "source": "The Hacker News",
      "title": "Docker Fixes Critical Ask Gordon AI Flaw Allowing Code Execution via Image Metadata",
      "link": "https://thehackernews.com/2026/02/docker-fixes-critical-ask-gordon-ai.html",
      "summary": "Cybersecurity researchers have disclosed details of a now-patched security flaw impacting Ask Gordon, an artificial intelligence (AI) assistant built into Docker Desktop and the Docker Command-Line Interface (CLI), that could be exploited to execute code and exfiltrate sensitive data. The critical vulnerability has been codenamed DockerDash by cybersecurity company Noma Labs. It was addressed by",
      "published": "Tue, 03 Feb 2026 22:11:00 +0530",
      "value_score": 32,
      "value_signals": [
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "[Webinar] The Smarter SOC Blueprint: Learn What to Build, Buy, and Automate",
      "link": "https://thehackernews.com/2026/02/webinar-smarter-soc-blueprint-learn.html",
      "summary": "Most security teams today are buried under tools. Too many dashboards. Too much noise. Not enough real progress. Every vendor promises “complete coverage” or “AI-powered automation,” but inside most SOCs, teams are still overwhelmed, stretched thin, and unsure which tools are truly pulling their weight. The result? Bloated stacks, missed signals, and mounting pressure to do more with less. This",
      "published": "Tue, 03 Feb 2026 19:44:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Hackers Exploit Metro4Shell RCE Flaw in React Native CLI npm Package",
      "link": "https://thehackernews.com/2026/02/hackers-exploit-metro4shell-rce-flaw-in.html",
      "summary": "Threat actors have been observed exploiting a critical security flaw impacting the Metro Development Server in the popular \"@react-native-community/cli\" npm package. Cybersecurity company VulnCheck said it first observed exploitation of CVE-2025-11953 (aka Metro4Shell) on December 21, 2025. With a CVSS score of 9.8, the vulnerability allows remote unauthenticated attackers to execute arbitrary",
      "published": "Tue, 03 Feb 2026 19:30:00 +0530",
      "value_score": 62,
      "value_signals": [
        "CVE mentioned",
        "RCE",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "When Cloud Outages Ripple Across the Internet",
      "link": "https://thehackernews.com/2026/02/when-cloud-outages-ripple-across.html",
      "summary": "Recent major cloud service outages have been hard to miss. High-profile incidents affecting providers such as AWS, Azure, and Cloudflare have disrupted large parts of the internet, taking down websites and services that many other systems depend on. The resulting ripple effects have halted applications and workflows that many organizations rely on every day. For consumers, these outages are",
      "published": "Tue, 03 Feb 2026 16:30:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "APT28 Uses Microsoft Office CVE-2026-21509 in Espionage-Focused Malware Attacks",
      "link": "https://thehackernews.com/2026/02/apt28-uses-microsoft-office-cve-2026.html",
      "summary": "The Russia-linked state-sponsored threat actor known as APT28 (aka UAC-0001) has been attributed to attacks exploiting a newly disclosed security flaw in Microsoft Office as part of a campaign codenamed Operation Neusploit. Zscaler ThreatLabz said it observed the hacking group weaponizing the shortcoming on January 29, 2026, in attacks targeting users in Ukraine, Slovakia, and Romania, three",
      "published": "Tue, 03 Feb 2026 14:42:00 +0530",
      "value_score": 34,
      "value_signals": [
        "CVE mentioned",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Mozilla Adds One-Click Option to Disable Generative AI Features in Firefox",
      "link": "https://thehackernews.com/2026/02/mozilla-adds-one-click-option-to.html",
      "summary": "Mozilla on Monday announced a new controls section in its Firefox desktop browser settings that allows users to completely turn off generative artificial intelligence (GenAI) features. \"It provides a single place to block current and future generative AI features in Firefox,\" Ajit Varma, head of Firefox, said. \"You can also review and manage individual AI features if you choose to use them. This",
      "published": "Tue, 03 Feb 2026 11:09:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Notepad++ Hosting Breach Attributed to China-Linked Lotus Blossom Hacking Group",
      "link": "https://thehackernews.com/2026/02/notepad-hosting-breach-attributed-to.html",
      "summary": "A China-linked threat actor known as Lotus Blossom has been attributed with medium confidence to the recently discovered compromise of the infrastructure hosting Notepad++. The attack enabled the state-sponsored hacking group to deliver a previously undocumented backdoor codenamed Chrysalis to users of the open-source editor, according to new findings from Rapid7. The development comes shortly",
      "published": "Tue, 03 Feb 2026 10:25:00 +0530",
      "value_score": 34,
      "value_signals": [
        "Breach/leak",
        "Backdoor"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Researchers Find 341 Malicious ClawHub Skills Stealing Data from OpenClaw Users",
      "link": "https://thehackernews.com/2026/02/researchers-find-341-malicious-clawhub.html",
      "summary": "A security audit of 2,857 skills on ClawHub has found 341 malicious skills across multiple campaigns, according to new findings from Koi Security, exposing users to new supply chain risks. ClawHub is a marketplace designed to make it easy for OpenClaw users to find and install third-party skills. It's an extension to the OpenClaw project, a self-hosted artificial intelligence (AI) assistant",
      "published": "Mon, 02 Feb 2026 23:19:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
      "link": "https://krebsonsecurity.com/2026/01/kimwolf-botnet-lurking-in-corporate-govt-networks/",
      "summary": "A new Internet-of-Things botnet called Kimwolf has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf's ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.",
      "published": "Tue, 20 Jan 2026 18:19:13 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×2"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, January 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "published": "Wed, 14 Jan 2026 00:47:38 +0000",
      "value_score": 40,
      "value_signals": [
        "Patch/update ×2",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Who Benefited from the Aisuru and Kimwolf Botnets?",
      "link": "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
      "summary": "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we'll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf's spread.",
      "published": "Thu, 08 Jan 2026 23:23:43 +0000",
      "value_score": 20,
      "value_signals": [
        "Botnet"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "The Kimwolf Botnet is Stalking Your Local Network",
      "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
      "summary": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.",
      "published": "Fri, 02 Jan 2026 14:20:10 +0000",
      "value_score": 26,
      "value_signals": [
        "Botnet",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Happy 16th Birthday, KrebsOnSecurity.com!",
      "link": "https://krebsonsecurity.com/2025/12/happy-16th-birthday-krebsonsecurity-com/",
      "summary": "KrebsOnSecurity.com celebrates its 16th anniversary today! A huge \"thank you\" to all of our readers -- newcomers, long-timers and drive-by critics alike. Your engagement this past year here has been tremendous and truly a salve on a handful of dark days. Happily, comeuppance was a strong theme running through our coverage in 2025, with a primary focus on entities that enabled complex and globally-dispersed cybercrime services.",
      "published": "Mon, 29 Dec 2025 20:23:26 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Dismantling Defenses: Trump 2.0 Cyber Year in Review",
      "link": "https://krebsonsecurity.com/2025/12/dismantling-defenses-trump-2-0-cyber-year-in-review/",
      "summary": "The Trump administration has pursued a staggering range of policy pivots this past year that threaten to weaken the nation’s ability and willingness to address a broad spectrum of technology challenges, from cybersecurity and privacy to countering disinformation, fraud and corruption. These shifts, along with the president’s efforts to restrict free speech and freedom of the press, have come at such a rapid clip that many readers probably aren’t even aware of them all.",
      "published": "Fri, 19 Dec 2025 15:14:55 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Most Parked Domains Now Serving Malicious Content",
      "link": "https://krebsonsecurity.com/2025/12/most-parked-domains-now-serving-malicious-content/",
      "summary": "Direct navigation -- the act of visiting a website by manually typing a domain name in a web browser -- has never been riskier: A new study finds the vast majority of \"parked\" domains -- mostly expired or dormant domain names, or common misspellings of popular websites -- are now configured to redirect visitors to sites that foist scams and malware.",
      "published": "Tue, 16 Dec 2025 14:14:48 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Microsoft Patch Tuesday, December 2025 Edition",
      "link": "https://krebsonsecurity.com/2025/12/microsoft-patch-tuesday-december-2025-edition/",
      "summary": "Microsoft today pushed updates to fix at least 56 security flaws in its Windows operating systems and supported software. This final Patch Tuesday of 2025 tackles one zero-day bug that is already being exploited, as well as two publicly disclosed vulnerabilities.",
      "published": "Tue, 09 Dec 2025 23:18:29 +0000",
      "value_score": 57,
      "value_signals": [
        "Zero-day",
        "Patch/update ×3",
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Russian Hackers Weaponize Microsoft Office Bug in Just 3 Days",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/russian-hackers-weaponize-office-bug-within-days",
      "summary": "APT28's attacks rely on specially crafted Microsoft Rich Text Format (RTF) documents to kick off a multistage infection chain to deliver malicious payloads.",
      "published": "Tue, 03 Feb 2026 21:52:22 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "GlassWorm Malware Returns to Shatter Developer Ecosystems",
      "link": "https://www.darkreading.com/application-security/glassworm-malware-developer-ecosystems",
      "summary": "The self-replicating malware has poisoned a fresh set of Open VSX software components, leaving potential downstream victims with infostealer infections.",
      "published": "Tue, 03 Feb 2026 20:55:51 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "8-Minute Access: AI Accelerates Breach of AWS Environment",
      "link": "https://www.darkreading.com/cloud-security/8-minute-access-ai-aws-environment-breach",
      "summary": "The AI-assisted attack, which started with exposed credentials from public S3 buckets, rapidly achieved administrative privilges.",
      "published": "Tue, 03 Feb 2026 16:38:11 GMT",
      "value_score": 22,
      "value_signals": [
        "Breach/leak"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Dark Patterns Undermine Security, One Click at a Time",
      "link": "https://www.darkreading.com/cyber-risk/dark-patterns-undermine-security-one-click-at-a-time",
      "summary": "People trust organizations to do the right thing, but some websites and apps have user interfaces that ultimately lead to inadequate security for users.",
      "published": "Tue, 03 Feb 2026 16:30:41 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Attackers Harvest Dropbox Logins Via Fake PDF Lures",
      "link": "https://www.darkreading.com/cloud-security/attackers-harvest-dropbox-logins-fake-pdf-lures",
      "summary": "A malware-free phishing campaign targets corporate inboxes and asks employees to view \"request orders,\" ultimately leading to Dropbox credential theft.",
      "published": "Mon, 02 Feb 2026 22:21:33 GMT",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "County Pays $600K to Wrongfully Jailed Pen Testers",
      "link": "https://www.darkreading.com/cybersecurity-operations/county-pays-600k-wrongfully-jailed-pen-testers",
      "summary": "Iowa police arrested two penetration testers in 2019 for doing their jobs, highlighting the risk to security professionals in red teaming exercises.",
      "published": "Mon, 02 Feb 2026 21:57:51 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Chinese Hackers Hijack Notepad++ Updates for 6 Months",
      "link": "https://www.darkreading.com/application-security/chinese-hackers-hijack-notepad-updates-6-months",
      "summary": "State-sponsored threat actors compromised the popular code editor's hosting provider to redirect targeted users to malicious downloads.",
      "published": "Mon, 02 Feb 2026 19:57:02 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "ShinyHunters Expands Scope of SaaS Extortion Attacks",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/shinyhunters-expands-scope-saas-extortion-attacks",
      "summary": "Following their attacks on Salesforce instances last year, members of the cybercrime group have broadened their targeting and gotten more aggressive with extortion tactics.",
      "published": "Mon, 02 Feb 2026 16:07:57 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "RADICL Raises $31 Million for vSOC",
      "link": "https://www.securityweek.com/radicl-raises-31-million-for-vsoc/",
      "summary": "The company will use the investment to accelerate development of its autonomous virtual security operations center (vSOC). The post RADICL Raises $31 Million for vSOC appeared first on SecurityWeek .",
      "published": "Tue, 03 Feb 2026 15:32:00 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "RapidFort Raises $42M to Automate Software Supply Chain Security",
      "link": "https://www.securityweek.com/rapidfort-raises-42m-to-automate-software-supply-chain-security/",
      "summary": "The company will use the latest capital to scale its go-to-market efforts and expand its platform’s capabilities. The post RapidFort Raises $42M to Automate Software Supply Chain Security appeared first on SecurityWeek .",
      "published": "Tue, 03 Feb 2026 14:41:18 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Critical React Native Vulnerability Exploited in the Wild",
      "link": "https://www.securityweek.com/critical-react-native-vulnerability-exploited-in-the-wild/",
      "summary": "Albeit mainly considered a theoretical risk, the flaw has been exploited to disable protections and deliver malware. The post Critical React Native Vulnerability Exploited in the Wild appeared first on SecurityWeek .",
      "published": "Tue, 03 Feb 2026 14:00:00 +0000",
      "value_score": 82,
      "value_signals": [
        "Active exploitation ×2",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "Vulnerability Allows Hackers to Hijack OpenClaw AI Assistant",
      "link": "https://www.securityweek.com/vulnerability-allows-hackers-to-hijack-openclaw-ai-assistant/",
      "summary": "OpenClaw (aka Moltbot and Clawdbot) is vulnerable to one-click remote code execution attacks. The post Vulnerability Allows Hackers to Hijack OpenClaw AI Assistant appeared first on SecurityWeek .",
      "published": "Tue, 03 Feb 2026 13:44:55 +0000",
      "value_score": 30,
      "value_signals": [
        "RCE"
      ]
    },
    {
      "source": "Security Week",
      "title": "Hackers Leak 5.1 Million Panera Bread Records",
      "link": "https://www.securityweek.com/hackers-leak-5-1-million-panera-bread-accounts/",
      "summary": "ShinyHunters has claimed the theft of 14 million records from the US bakery-cafe chain’s systems. The post Hackers Leak 5.1 Million Panera Bread Records appeared first on SecurityWeek .",
      "published": "Tue, 03 Feb 2026 12:16:31 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Security Week",
      "title": "Russia’s APT28 Rapidly Weaponizes Newly Patched Office Vulnerability",
      "link": "https://www.securityweek.com/russias-apt28-rapidly-weaponizes-newly-patched-office-vulnerability/",
      "summary": "The attacks targeting Europe were analyzed by Ukraine’s CERT-UA and the cybersecurity company Zscaler. The post Russia’s APT28 Rapidly Weaponizes Newly Patched Office Vulnerability appeared first on SecurityWeek .",
      "published": "Tue, 03 Feb 2026 11:22:52 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Kasada Raises $20 Million for Anti-Bot Expansion",
      "link": "https://www.securityweek.com/kasada-raises-20-million-for-anti-bot-expansion/",
      "summary": "The company will invest in market expansion and accelerating product capabilities. The post Kasada Raises $20 Million for Anti-Bot Expansion appeared first on SecurityWeek .",
      "published": "Tue, 03 Feb 2026 11:00:00 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "ShinyHunters-Branded Extortion Activity Expands, Escalates",
      "link": "https://www.securityweek.com/shinyhunters-branded-extortion-activity-expands-escalates/",
      "summary": "Hackers rely on evolved vishing and login harvesting to compromise SSO credentials for unauthorized MFA enrollment. The post ShinyHunters-Branded Extortion Activity Expands, Escalates appeared first on SecurityWeek .",
      "published": "Mon, 02 Feb 2026 15:28:16 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "summary": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "published": "Wed, 31 Aug 2022 12:57:48 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "published": "Tue, 30 Aug 2022 16:00:43 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "published": "Mon, 29 Aug 2022 14:56:19 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "published": "Fri, 26 Aug 2022 16:44:27 +0000",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "published": "Thu, 25 Aug 2022 18:47:15 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Twitter Whistleblower Complaint: The TL;DR Version",
      "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
      "summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk.",
      "published": "Wed, 24 Aug 2022 14:17:04 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
      "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
      "summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP.",
      "published": "Tue, 23 Aug 2022 13:19:58 +0000",
      "value_score": 50,
      "value_signals": [
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Fake Reservation Links Prey on Weary Travelers",
      "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
      "summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels.",
      "published": "Mon, 22 Aug 2022 13:59:06 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "CISA Alerts",
      "title": "Synectix LAN 232 TRIO",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-034-04",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could result in an unauthenticated attacker modifying critical device settings or factory resetting the device. The following versions of Synectix LAN 232 TRIO are affected: LAN 232 TRIO vers:all/* (CVE-2026-1633) CVSS Vendor Equipment Vulnerabilities v3 10 Synectix Synectix LAN 232 TRIO Missing Authentication for Critical Function Background Critical Infrastructure Sectors: Critical Manufacturing, Emergency Services, Energy, Inform",
      "published": "Tue, 03 Feb 26 12:00:00 +0000",
      "value_score": 75,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "High severity ×4",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Mitsubishi Electric FREQSHIP-mini for Windows",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-034-01",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an attacker to gain unauthorized access to, modify, delete, or destroy information stored on the system where the affected product is installed, or cause a denial-of-service condition on the affected system. The following versions of Mitsubishi Electric FREQSHIP-mini for Windows are affected: FREQSHIP-mini for Windows >=8.0.0|<=8.0.2 (CVE-2025-10314) CVSS Vendor Equipment Vulnerabilities v3 8.8 Mitsubishi Electric Mitsub",
      "published": "Tue, 03 Feb 26 12:00:00 +0000",
      "value_score": 59,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Avation Light Engine Pro",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-034-02",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an attacker to take full control of the device. The following versions of Avation Light Engine Pro are affected: Light Engine Pro vers:all/* (CVE-2026-1341) CVSS Vendor Equipment Vulnerabilities v3 9.8 Avation Avation Light Engine Pro Missing Authentication for Critical Function Background Critical Infrastructure Sectors: Commercial Facilities Countries/Areas Deployed: Worldwide Company Headquarters Location: Australia V",
      "published": "Tue, 03 Feb 26 12:00:00 +0000",
      "value_score": 75,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds Four Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/02/03/cisa-adds-four-known-exploited-vulnerabilities-catalog",
      "summary": "CISA has added four new vulnerabilities to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2019-19006 Sangoma FreePBX Improper Authentication Vulnerability CVE-2021-39935 GitLab Community and Enterprise Editions Server-Side Request Forgery (SSRF) Vulnerability CVE-2025-40551 SolarWinds Web Help Desk Deserialization of Untrusted Data Vulnerability CVE-2025-64328 Sangoma FreePBX OS Command Injection Vulnerability These types of vulnerabilities are ",
      "published": "Tue, 03 Feb 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "CISA/KEV ×5",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "RISS SRL MOMA Seismic Station",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-034-03",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could result in an unauthenticated attacker creating a denial-of-service condition. The following versions of RISS SRL MOMA Seismic Station are affected: MOMA Seismic Station <=v2.4.2520 (CVE-2026-1632) CVSS Vendor Equipment Vulnerabilities v3 9.1 RISS SRL RISS SRL MOMA Seismic Station Missing Authentication for Critical Function Background Critical Infrastructure Sectors: Critical Manufacturing, Dams, Energy, Water and Wastewater, ",
      "published": "Tue, 03 Feb 26 12:00:00 +0000",
      "value_score": 75,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "High severity ×3",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "KiloView Encoder Series",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-029-01",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an unauthenticated attacker to create or delete administrator accounts, granting full administrative control. The following versions of KiloView Encoder Series are affected: Encoder Series E1 hardware Version 1.4 4.7.2516 (CVE-2026-1453) Encoder Series E1 hardware Version 1.6.20 4.7.2511|4.8.2523|4.8.2611|4.6.2400|4.7.2512|4.8.2561|4.8.2554|4.3.2029|4.8.2555|4.6.2408 (CVE-2026-1453) Encoder Series E1-s hardware Version 1",
      "published": "Thu, 29 Jan 26 12:00:00 +0000",
      "value_score": 85,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Rockwell Automation ArmorStart LT",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-029-02",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could allow an attacker to cause a denial-of-service condition. The following versions of Rockwell Automation ArmorStart LT are affected: ArmorStart LT 290D <=V2.002 (CVE-2025-9464, CVE-2025-9465, CVE-2025-9466, CVE-2025-9278, CVE-2025-9279, CVE-2025-9280, CVE-2025-9281, CVE-2025-9282, CVE-2025-9283) ArmorStart LT 291D <=V2.002 (CVE-2025-9464, CVE-2025-9465, CVE-2025-9466, CVE-2025-9278, CVE-2025-9279, CVE-2025-9280, CVE-2025-928",
      "published": "Thu, 29 Jan 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×15",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Rockwell Automation ControlLogix",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-029-03",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an attacker to cause a denial-of-service condition. The following versions of Rockwell Automation ControlLogix are affected: ControlLogix Redundancy Enhanced Module Catalog 1756-RM2 Firmware vers:all/* (CVE-2025-14027) ControlLogix Redundancy Enhanced Module Catalog 1756-RM2XT Firmware vers:all/* (CVE-2025-14027) CVSS Vendor Equipment Vulnerabilities v3 7.5 Rockwell Automation Rockwell Automation ControlLogix Missing Rel",
      "published": "Thu, 29 Jan 26 12:00:00 +0000",
      "value_score": 85,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "Multiple CVEs",
        "Exploit wording"
      ]
    }
  ],
  "sources": [
    "The Hacker News",
    "BleepingComputer",
    "Krebs on Security",
    "Dark Reading",
    "Security Week",
    "Naked Security",
    "Threatpost",
    "CISA Alerts"
  ]
}