{
  "last_updated": "2026-02-19 22:26",
  "sources_count": 8,
  "articles_count": 56,
  "keywords": [
    "badbox 2 0",
    "windows admin center",
    "venice security emerges",
    "targeting technology manufacturing",
    "scattered lapsus shinyhunters",
    "long term espionage",
    "windows operating systems",
    "arbitrary code execution",
    "50 security holes",
    "things attack surfaces",
    "pose significant risks",
    "interdisciplinary research unit",
    "data allegedly stolen",
    "twitter whistleblower complaint",
    "missing something crucial",
    "ivanti exploitation surges",
    "hacking tax firms",
    "8 1 million",
    "windows clients servers",
    "patched security flaw"
  ],
  "trending": [
    {
      "keyword": "badbox 2 0",
      "mentions": 162
    },
    {
      "keyword": "windows admin center",
      "mentions": 2
    },
    {
      "keyword": "venice security emerges",
      "mentions": 6
    },
    {
      "keyword": "targeting technology manufacturing",
      "mentions": 6
    },
    {
      "keyword": "scattered lapsus shinyhunters",
      "mentions": 131
    },
    {
      "keyword": "long term espionage",
      "mentions": 5
    },
    {
      "keyword": "windows operating systems",
      "mentions": 356
    },
    {
      "keyword": "arbitrary code execution",
      "mentions": 155
    },
    {
      "keyword": "50 security holes",
      "mentions": 80
    },
    {
      "keyword": "things attack surfaces",
      "mentions": 2
    }
  ],
  "articles": [
    {
      "source": "The Hacker News",
      "title": "PromptSpy Android Malware Abuses Gemini AI to Automate Recent-Apps Persistence",
      "link": "https://thehackernews.com/2026/02/promptspy-android-malware-abuses-google.html",
      "summary": "Cybersecurity researchers have discovered what they say is the first Android malware that abuses Gemini, Google's generative artificial intelligence (AI) chatbot, as part of its execution flow and achieves persistence. The malware has been codenamed PromptSpy by ESET. The malware is equipped to capture lockscreen data, block uninstallation efforts, gather device information, take screenshots,",
      "published": "Thu, 19 Feb 2026 23:22:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "INTERPOL Operation Red Card 2.0 Arrests 651 in African Cybercrime Crackdown",
      "link": "https://thehackernews.com/2026/02/interpol-operation-red-card-20-arrests.html",
      "summary": "An international cybercrime operation against online scams has led to 651 arrests and recovered more than $4.3 million as part of an effort led by law enforcement agencies from 16 African countries. The initiative, codenamed Operation Red Card 2.0, took place between December 8, 2025 and January 30, 2026, according to INTERPOL. It targeted infrastructure and actors behind high-yield investment",
      "published": "Thu, 19 Feb 2026 23:20:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Microsoft Patches CVE-2026-26119 Privilege Escalation in Windows Admin Center",
      "link": "https://thehackernews.com/2026/02/microsoft-patches-cve-2026-26119.html",
      "summary": "Microsoft has disclosed a now-patched security flaw in Windows Admin Center that could allow an attacker to escalate their privileges. Windows Admin Center is a locally deployed, browser-based management tool set that lets users manage their Windows Clients, Servers, and Clusters without the need for connecting to the cloud. The high-severity vulnerability, tracked as CVE-2026-26119, carries a",
      "published": "Thu, 19 Feb 2026 23:10:00 +0530",
      "value_score": 66,
      "value_signals": [
        "CVE mentioned ×2",
        "Privilege escalation",
        "Multiple CVEs"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "ThreatsDay Bulletin: OpenSSL RCE, Foxit 0-Days, Copilot Leak, AI Password Flaws & 20+ Stories",
      "link": "https://thehackernews.com/2026/02/threatsday-bulletin-openssl-rce-foxit-0.html",
      "summary": "The cyber threat space doesn’t pause, and this week makes that clear. New risks, new tactics, and new security gaps are showing up across platforms, tools, and industries — often all at the same time. Some developments are headline-level. Others sit in the background but carry long-term impact. Together, they shape how defenders need to think about exposure, response, and preparedness right now",
      "published": "Thu, 19 Feb 2026 20:05:00 +0530",
      "value_score": 42,
      "value_signals": [
        "RCE",
        "Breach/leak"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "From Exposure to Exploitation: How AI Collapses Your Response Window",
      "link": "https://thehackernews.com/2026/02/from-exposure-to-exploitation-how-ai.html",
      "summary": "We’ve all seen this before: a developer deploys a new cloud workload and grants overly broad permissions just to keep the sprint moving. An engineer generates a \"temporary\" API key for testing and forgets to revoke it. In the past, these were minor operational risks, debts you’d eventually pay down during a slower cycle. In 2026, “Eventually” is Now But today, within minutes, AI-powered",
      "published": "Thu, 19 Feb 2026 17:25:00 +0530",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Fake IPTV Apps Spread Massiv Android Malware Targeting Mobile Banking Users",
      "link": "https://thehackernews.com/2026/02/fake-iptv-apps-spread-massiv-android.html",
      "summary": "Cybersecurity researchers have disclosed details of a new Android trojan called Massiv that's designed to facilitate device takeover (DTO) attacks for financial theft. The malware, according to ThreatFabric, masquerades as seemingly harmless IPTV apps to deceive victims, indicating that the activity is primarily singling out users looking for the online TV applications. \"This new threat, while",
      "published": "Thu, 19 Feb 2026 15:54:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "CRESCENTHARVEST Campaign Targets Iran Protest Supporters With RAT Malware",
      "link": "https://thehackernews.com/2026/02/crescentharvest-campaign-targets-iran.html",
      "summary": "Cybersecurity researchers have disclosed details of a new campaign dubbed CRESCENTHARVEST, likely targeting supporters of Iran's ongoing protests to conduct information theft and long-term espionage. The Acronis Threat Research Unit (TRU) said it observed the activity after January 9, with the attacks designed to deliver a malicious payload that serves as a remote access trojan (RAT) and",
      "published": "Thu, 19 Feb 2026 13:43:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Citizen Lab Finds Cellebrite Tool Used on Kenyan Activist’s Phone in Police Custody",
      "link": "https://thehackernews.com/2026/02/citizen-lab-finds-cellebrite-tool-used.html",
      "summary": "New research from the Citizen Lab has found signs that Kenyan authorities used a commercial forensic extraction tool manufactured by Israeli company Cellebrite to break into a prominent dissident's phone, making it the latest case of abuse of the technology targeting civil society. The interdisciplinary research unit at the University of Toronto's Munk School of Global Affairs & Public",
      "published": "Wed, 18 Feb 2026 23:00:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Flaw in Grandstream VoIP phones allows stealthy eavesdropping",
      "link": "https://www.bleepingcomputer.com/news/security/flaw-in-grandstream-voip-phones-allows-stealthy-eavesdropping/",
      "summary": "A critical vulnerability in Grandstream GXP1600 series VoIP phones allows a remote, unauthenticated attacker to gain root privileges and silently eavesdrop on communications. [...]",
      "published": "Thu, 19 Feb 2026 12:16:32 -0500",
      "value_score": 18,
      "value_signals": [
        "High severity"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Google blocked over 1.75 million Play Store app submissions in 2025",
      "link": "https://www.bleepingcomputer.com/news/security/google-blocked-over-175-million-play-store-app-submissions-in-2025/",
      "summary": "Google says that through 2025, it blocked more than 255,000 Android apps from obtaining excessive access to sensitive user data and rejected over 1.75 million apps from being published on Google Play due to policy violations. [...]",
      "published": "Thu, 19 Feb 2026 12:00:00 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "CISA orders feds to patch actively exploited Dell flaw within 3 days",
      "link": "https://www.bleepingcomputer.com/news/security/cisa-orders-feds-to-patch-actively-exploited-dell-flaw-within-3-days/",
      "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) ordered government agencies to patch their systems within three days against a maximum-severity Dell vulnerability that has been under active exploitation since mid-2024. [...]",
      "published": "Thu, 19 Feb 2026 10:30:37 -0500",
      "value_score": 97,
      "value_signals": [
        "Active exploitation",
        "Patch/update ×2",
        "CISA/KEV ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "How infostealers turn stolen credentials into real identities",
      "link": "https://www.bleepingcomputer.com/news/security/how-infostealers-turn-stolen-credentials-into-real-identities/",
      "summary": "Infostealer dumps increasingly tie stolen credentials to real identities, linking usernames, cookies, and behavior across personal and enterprise accounts. Specops explains how analyzing 90,000 dumps shows reuse fuels enterprise risk and how continuous AD scanning disrupts that cycle. [...]",
      "published": "Thu, 19 Feb 2026 10:05:15 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Nigerian man gets eight years in prison for hacking tax firms",
      "link": "https://www.bleepingcomputer.com/news/security/nigerian-man-gets-eight-years-in-prison-for-hacking-tax-firms/",
      "summary": "A Nigerian national was sentenced to eight years in prison for hacking multiple tax preparation firms in Massachusetts and filing fraudulent tax returns seeking over $8.1 million in refunds. [...]",
      "published": "Thu, 19 Feb 2026 08:51:49 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Texas sues TP-Link over Chinese hacking risks, user deception",
      "link": "https://www.bleepingcomputer.com/news/security/texas-sues-tp-link-over-chinese-hacking-risks-user-deception/",
      "summary": "Texas sued networking giant TP-Link Systems, accusing the company of deceptively marketing its routers as secure while allowing Chinese state-backed hackers to exploit firmware vulnerabilities and access users' devices. [...]",
      "published": "Thu, 19 Feb 2026 07:36:51 -0500",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Hackers target Microsoft Entra accounts in device code vishing attacks",
      "link": "https://www.bleepingcomputer.com/news/security/hackers-target-microsoft-entra-accounts-in-device-code-vishing-attacks/",
      "summary": "Threat actors are targeting technology, manufacturing, and financial organizations in campaigns that combine device code phishing and voice phishing (vishing) to abuse the OAuth 2.0 Device Authorization flow and compromise Microsoft Entra accounts. [...]",
      "published": "Thu, 19 Feb 2026 07:30:37 -0500",
      "value_score": 26,
      "value_signals": [
        "Phishing ×2"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Police arrests 651 suspects in African cybercrime crackdown",
      "link": "https://www.bleepingcomputer.com/news/security/police-arrests-651-suspects-in-african-cybercrime-crackdown/",
      "summary": "African authorities arrested 651 suspects and recovered over $4.3 million in a joint operation targeting investment fraud, mobile money scams, and fake loan applications. [...]",
      "published": "Thu, 19 Feb 2026 06:24:17 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Swamps Anonymity Network I2P",
      "link": "https://krebsonsecurity.com/2026/02/kimwolf-botnet-swamps-anonymity-network-i2p/",
      "summary": "For the past week, the massive \"Internet of Things\" (IoT) botnet known as Kimwolf has been disrupting the The Invisible Internet Project (I2P), a decentralized, encrypted communications network designed to anonymize and secure online communications. I2P users started reporting disruptions in the network around the same time the Kimwolf botmasters began relying on it to evade takedown attempts against the botnet's control servers.",
      "published": "Wed, 11 Feb 2026 16:08:11 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×3"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, February 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/02/patch-tuesday-february-2026-edition/",
      "summary": "Microsoft today released updates to fix more than 50 security holes in its Windows operating systems and other software, including patches for a whopping six \"zero-day\" vulnerabilities that attackers are already exploiting in the wild.",
      "published": "Tue, 10 Feb 2026 21:49:53 +0000",
      "value_score": 82,
      "value_signals": [
        "Zero-day",
        "Active exploitation",
        "Patch/update ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Please Don’t Feed the Scattered Lapsus ShinyHunters",
      "link": "https://krebsonsecurity.com/2026/02/please-dont-feed-the-scattered-lapsus-shiny-hunters/",
      "summary": "A prolific data ransom gang that calls itself Scattered Lapsus ShinyHunters (SLSH) has a distinctive playbook when it seeks to extort payment from victim firms: Harassing, threatening and even swatting executives and their families, all while notifying journalists and regulators… Read More »",
      "published": "Mon, 02 Feb 2026 16:15:16 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Who Operates the Badbox 2.0 Botnet?",
      "link": "https://krebsonsecurity.com/2026/01/who-operates-the-badbox-2-0-botnet/",
      "summary": "The cybercriminals in control of Kimwolf -- a disruptive botnet that has infected more than 2 million devices -- recently shared a screenshot indicating they'd compromised the control panel for Badbox 2.0, a vast China-based botnet powered by malicious software that comes pre-installed on many Android TV streaming boxes. Both the FBI and Google say they are hunting for the people behind Badbox 2.0, and thanks to bragging by the Kimwolf botmasters we may now have a much clearer idea about that.",
      "published": "Mon, 26 Jan 2026 16:11:38 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×3"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
      "link": "https://krebsonsecurity.com/2026/01/kimwolf-botnet-lurking-in-corporate-govt-networks/",
      "summary": "A new Internet-of-Things botnet called Kimwolf has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf's ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.",
      "published": "Tue, 20 Jan 2026 18:19:13 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×2"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, January 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "published": "Wed, 14 Jan 2026 00:47:38 +0000",
      "value_score": 40,
      "value_signals": [
        "Patch/update ×2",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Who Benefited from the Aisuru and Kimwolf Botnets?",
      "link": "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
      "summary": "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we'll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf's spread.",
      "published": "Thu, 08 Jan 2026 23:23:43 +0000",
      "value_score": 20,
      "value_signals": [
        "Botnet"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "The Kimwolf Botnet is Stalking Your Local Network",
      "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
      "summary": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.",
      "published": "Fri, 02 Jan 2026 14:20:10 +0000",
      "value_score": 26,
      "value_signals": [
        "Botnet",
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Best-in-Class 'Starkiller' Phishing Kit Bypasses MFA",
      "link": "https://www.darkreading.com/threat-intelligence/starkiller-phishing-kit-mfa",
      "summary": "A user-friendly PhaaS tool beats standard methods for detecting phishing attacks by live-proxying legitimate login sites.",
      "published": "Thu, 19 Feb 2026 22:06:58 GMT",
      "value_score": 26,
      "value_signals": [
        "Phishing ×2"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Abu Dhabi Finance Week Exposed VIP Passport Details",
      "link": "https://www.darkreading.com/cyber-risk/abu-dhabi-finance-week-leaked-vip-passport-details",
      "summary": "Unprotected cloud data sends the wrong signal at a time when the emirate's trying to attract investors and establish itself as a global financial center.",
      "published": "Thu, 19 Feb 2026 20:50:14 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Connected and Compromised: When IoT Devices Turn Into Threats",
      "link": "https://www.darkreading.com/iot/connected-compromised-iot-devices-turn-threats",
      "summary": "Reused passwords, a lack of network segmentation, and poor sanitization processes make the Internet of Things' attack surfaces more dangerous.",
      "published": "Thu, 19 Feb 2026 15:18:23 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "More Than 40% of South Africans Were Scammed in 2025",
      "link": "https://www.darkreading.com/cybersecurity-analytics/south-africans-scammed-2025",
      "summary": "Survey underscores the reality that scammers follow \"scalable opportunities and low friction,\" rather than rich targets that tend to be better protected.",
      "published": "Thu, 19 Feb 2026 07:00:00 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Scam Abuses Gemini Chatbots to Convince People to Buy Fake Crypto",
      "link": "https://www.darkreading.com/endpoint-security/scam-abuses-gemini-chatbots-convince-people-buy-fake-crypto",
      "summary": "A convincing presale site for phony \"Google Coin\" features an AI assistant that engages victims with a slick sales pitch, funneling payment to attackers.",
      "published": "Wed, 18 Feb 2026 21:47:01 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Critical Grandstream VoIP Bug Highlights SMB Security Blind Spot",
      "link": "https://www.darkreading.com/threat-intelligence/grandstream-bug-voip-security-blind-spot",
      "summary": "CVE-2026-2329 allows unauthenticated root-level access to SMB phone infrastructure, so attackers can intercept calls, commit toll fraud, and impersonate users.",
      "published": "Wed, 18 Feb 2026 21:15:08 GMT",
      "value_score": 36,
      "value_signals": [
        "CVE mentioned",
        "High severity"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Threat Intelligence Has a Human-Shaped Blind Spot",
      "link": "https://www.darkreading.com/threat-intelligence/human-shaped-blind-spot",
      "summary": "How I realized what I was taught to about threat intelligence was missing something crucial.",
      "published": "Wed, 18 Feb 2026 20:56:22 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Dell's Hard-Coded Flaw: A Nation-State Goldmine",
      "link": "https://www.darkreading.com/application-security/dells-hard-coded-flaw-a-nation-state-goldmine",
      "summary": "A China-related attacker has exploited the vendor flaw since mid-2024, allowing it to move laterally, maintain persistent access, and deploy malware.",
      "published": "Wed, 18 Feb 2026 20:49:36 GMT",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "French Government Says 1.2 Million Bank Accounts Exposed in Breach",
      "link": "https://www.securityweek.com/french-government-says-1-2-million-bank-accounts-exposed-in-breach/",
      "summary": "The Ministry of Economy reported discovering unauthorized access to the national bank account registry FICOBA. The post French Government Says 1.2 Million Bank Accounts Exposed in Breach appeared first on SecurityWeek .",
      "published": "Thu, 19 Feb 2026 15:02:58 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Security Week",
      "title": "Nearly 1 Million User Records Compromised in Figure Data Breach",
      "link": "https://www.securityweek.com/nearly-1-million-user-records-compromised-in-figure-data-breach/",
      "summary": "The blockchain-based lender has confirmed a data breach after ShinyHunters leaked over 2GB of data allegedly stolen from the company. The post Nearly 1 Million User Records Compromised in Figure Data Breach appeared first on SecurityWeek .",
      "published": "Thu, 19 Feb 2026 13:19:08 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×3"
      ]
    },
    {
      "source": "Security Week",
      "title": "Venice Security Emerges From Stealth With $33M Funding for Privileged Access Management",
      "link": "https://www.securityweek.com/venice-security-emerges-from-stealth-with-33m-funding-for-privileged-access-management/",
      "summary": "Formerly named Valkyrie, the company’s funding includes $25 million raised in a Series A round. The post Venice Security Emerges From Stealth With $33M Funding for Privileged Access Management appeared first on SecurityWeek .",
      "published": "Thu, 19 Feb 2026 12:23:41 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Ivanti Exploitation Surges as Zero-Day Attacks Traced Back to July 2025",
      "link": "https://www.securityweek.com/ivanti-exploitation-surges-as-zero-day-attacks-traced-back-to-july-2025/",
      "summary": "Security researchers have seen the vulnerabilities being exploited to deliver shells, conduct reconnaissance, and download malware. The post Ivanti Exploitation Surges as Zero-Day Attacks Traced Back to July 2025 appeared first on SecurityWeek .",
      "published": "Thu, 19 Feb 2026 11:56:29 +0000",
      "value_score": 66,
      "value_signals": [
        "Zero-day ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "OpenClaw Security Issues Continue as SecureClaw Open Source Tool Debuts",
      "link": "https://www.securityweek.com/openclaw-security-issues-continue-as-secureclaw-open-source-tool-debuts/",
      "summary": "OpenClaw faces security vulnerabilities and misconfiguration risks despite rapid patches and its transition to an OpenAI-backed foundation. The post OpenClaw Security Issues Continue as SecureClaw Open Source Tool Debuts appeared first on SecurityWeek .",
      "published": "Thu, 19 Feb 2026 11:00:00 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "German Rail Giant Deutsche Bahn Hit by Large-Scale DDoS Attack",
      "link": "https://www.securityweek.com/german-rail-giant-deutsche-bahn-hit-by-large-scale-ddos-attack/",
      "summary": "The cyberattack disrupted information and booking systems and lasted for several hours. The post German Rail Giant Deutsche Bahn Hit by Large-Scale DDoS Attack appeared first on SecurityWeek .",
      "published": "Thu, 19 Feb 2026 09:16:20 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "New Keenadu Android Malware Found on Thousands of Devices",
      "link": "https://www.securityweek.com/new-keenadu-android-malware-found-on-thousands-of-devices/",
      "summary": "The malware has been preinstalled on many devices but it has also been distributed through Google Play and other app stores. The post New Keenadu Android Malware Found on Thousands of Devices appeared first on SecurityWeek .",
      "published": "Wed, 18 Feb 2026 15:41:25 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Cogent Security Raises $42 Million for AI-Driven Vulnerability Management",
      "link": "https://www.securityweek.com/cogent-security-raises-42-million-for-ai-driven-vulnerability-management/",
      "summary": "The Series A funding round, led by Bain Capital, brings the total raised by Cogent to $53 million. The post Cogent Security Raises $42 Million for AI-Driven Vulnerability Management appeared first on SecurityWeek .",
      "published": "Wed, 18 Feb 2026 14:47:07 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "summary": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "published": "Wed, 31 Aug 2022 12:57:48 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "published": "Tue, 30 Aug 2022 16:00:43 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "published": "Mon, 29 Aug 2022 14:56:19 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "published": "Fri, 26 Aug 2022 16:44:27 +0000",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "published": "Thu, 25 Aug 2022 18:47:15 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Twitter Whistleblower Complaint: The TL;DR Version",
      "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
      "summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk.",
      "published": "Wed, 24 Aug 2022 14:17:04 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
      "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
      "summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP.",
      "published": "Tue, 23 Aug 2022 13:19:58 +0000",
      "value_score": 50,
      "value_signals": [
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Fake Reservation Links Prey on Weary Travelers",
      "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
      "summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels.",
      "published": "Mon, 22 Aug 2022 13:59:06 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "CISA Alerts",
      "title": "EnOcean SmartServer IoT",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-050-01",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could allow an attacker to remotely execute arbitrary code and bypass ASLR. The following versions of EnOcean SmartServer IoT are affected: SmartServer IoT <=4.60.009 (CVE-2026-20761, CVE-2026-22885) CVSS Vendor Equipment Vulnerabilities v3 8.1 EnOcean Edge Inc EnOcean SmartServer IoT Improper Neutralization of Special Elements used in a Command ('Command Injection'), Out-of-bounds Read Background Critical Infrastructure Sectors:",
      "published": "Thu, 19 Feb 26 12:00:00 +0000",
      "value_score": 93,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "High severity",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Welker OdorEyes EcoSystem Pulse Bypass System with XL4 Controller",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-050-04",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could result in an over- or under-odorization event. The following versions of Welker OdorEyes EcoSystem Pulse Bypass System with XL4 Controller are affected: OdorEyes EcoSystem Pulse Bypass System with XL4 Controller vers:all/* (CVE-2026-24790) CVSS Vendor Equipment Vulnerabilities v3 8.2 Welker Welker OdorEyes EcoSystem Pulse Bypass System with XL4 Controller Missing Authentication for Critical Function Background Critical Infrast",
      "published": "Thu, 19 Feb 26 12:00:00 +0000",
      "value_score": 75,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Jinan USR IOT Technology Limited (PUSR) USR-W610",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-050-03",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could result in authentication being disabled, a denial-of-service condition, or an attacker stealing valid user credentials, including administrator credentials. The following versions of Jinan USR IOT Technology Limited (PUSR) USR-W610 are affected: USR-W610 <=3.1.1.0 (CVE-2026-25715, CVE-2026-24455, CVE-2026-26049, CVE-2026-26048) CVSS Vendor Equipment Vulnerabilities v3 9.8 Jinan USR IOT Technology Limited (PUSR) Jinan USR IO",
      "published": "Thu, 19 Feb 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Valmet DNA Engineering Web Tools",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-050-02",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an unauthenticated attacker to manipulate the web maintenance services URL to achieve arbitrary file read access. The following versions of Valmet DNA Engineering Web Tools are affected: Valmet DNA Engineering Web Tools <=C2022 (CVE-2025-15577) CVSS Vendor Equipment Vulnerabilities v3 8.6 Valmet Valmet DNA Engineering Web Tools Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal') Background Crit",
      "published": "Thu, 19 Feb 26 12:00:00 +0000",
      "value_score": 59,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds Two Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/02/18/cisa-adds-two-known-exploited-vulnerabilities-catalog",
      "summary": "CISA has added two new vulnerabilities to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2021-22175 GitLab Server-Side Request Forgery (SSRF) Vulnerability CVE-2026-22769 Dell RecoverPoint for Virtual Machines (RP4VMs) Use of Hard-coded Credentials Vulnerability These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Red",
      "published": "Wed, 18 Feb 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "CISA/KEV ×5",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Delta Electronics ASDA-Soft",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-048-02",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability may allow an attacker to write arbitrary data beyond the bounds of a stack-allocated buffer, leading to the corruption of a structured exception handler (SEH). The following versions of Delta Electronics ASDA-Soft are affected: ASDA-Soft <=7.2.0.0 (CVE-2026-1361) CVSS Vendor Equipment Vulnerabilities v3 7.8 Delta Electronics Delta Electronics ASDA-Soft Stack-based Buffer Overflow Background Critical Infrastructure Sectors: Critical ",
      "published": "Tue, 17 Feb 26 12:00:00 +0000",
      "value_score": 75,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Siemens Simcenter Femap and Nastran",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-048-01",
      "summary": "View CSAF Summary Siemens Simcenter Femap and Nastran is affected by multiple file parsing vulnerabilities that could be triggered when the application reads files in NDB and XDB formats. If a user is tricked to open a malicious file with any of the affected products, this could lead the application to crash or potentially lead to arbitrary code execution. Siemens has released new versions for the affected products and recommends to update to the latest versions. The following versions of Siemen",
      "published": "Tue, 17 Feb 26 12:00:00 +0000",
      "value_score": 43,
      "value_signals": [
        "Source boost: CISA Alerts",
        "Patch/update"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds Four Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/02/17/cisa-adds-four-known-exploited-vulnerabilities-catalog",
      "summary": "CISA has added four new vulnerabilities to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2008-0015 Microsoft Windows Video ActiveX Control Remote Code Execution Vulnerability CVE-2020-7796 Synacor Zimbra Collaboration Suite (ZCS) Server-Side Request Forgery Vulnerability CVE-2024-7694 TeamT5 ThreatSonar Anti-Ransomware Unrestricted Upload of File with Dangerous Type Vulnerability CVE-2026-2441 Google Chromium CSS Use-After-Free Vulnerability Th",
      "published": "Tue, 17 Feb 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "Ransomware",
        "RCE",
        "CISA/KEV ×5",
        "Multiple CVEs"
      ]
    }
  ],
  "sources": [
    "The Hacker News",
    "BleepingComputer",
    "Krebs on Security",
    "Dark Reading",
    "Security Week",
    "Naked Security",
    "Threatpost",
    "CISA Alerts"
  ]
}