{
  "last_updated": "2026-01-23 14:21",
  "sources_count": 8,
  "articles_count": 56,
  "keywords": [
    "phishers abuse sharepoint",
    "single automation system",
    "executive order signed",
    "persistent remote access",
    "sso login vulnerabilities",
    "twitter whistleblower complaint",
    "sprawling phishing campaign",
    "rated 9 8",
    "phishing campaign zeroes",
    "multi stage adversary",
    "leverages stolen credentials",
    "johnson controls inc",
    "ipad devices due",
    "business without slowing",
    "ai slop reports",
    "scream europe frets",
    "growing across europe",
    "attacks bypass authentication",
    "patched devices similar",
    "internal network behind"
  ],
  "trending": [
    {
      "keyword": "phishers abuse sharepoint",
      "mentions": 1
    },
    {
      "keyword": "single automation system",
      "mentions": 11
    },
    {
      "keyword": "executive order signed",
      "mentions": 2
    },
    {
      "keyword": "persistent remote access",
      "mentions": 2
    },
    {
      "keyword": "sso login vulnerabilities",
      "mentions": 1
    },
    {
      "keyword": "twitter whistleblower complaint",
      "mentions": 445
    },
    {
      "keyword": "sprawling phishing campaign",
      "mentions": 97
    },
    {
      "keyword": "rated 9 8",
      "mentions": 33
    },
    {
      "keyword": "phishing campaign zeroes",
      "mentions": 18
    },
    {
      "keyword": "multi stage adversary",
      "mentions": 3
    }
  ],
  "articles": [
    {
      "source": "The Hacker News",
      "title": "Fortinet Confirms Active FortiCloud SSO Bypass on Fully Patched FortiGate Firewalls",
      "link": "https://thehackernews.com/2026/01/fortinet-confirms-active-forticloud-sso.html",
      "summary": "Fortinet has officially confirmed that it's working to completely plug a FortiCloud SSO authentication bypass vulnerability following reports of fresh exploitation activity on fully-patched firewalls. \"In the last 24 hours, we have identified a number of cases where the exploit was to a device that had been fully upgraded to the latest release at the time of the attack, which suggested a new",
      "published": "Fri, 23 Jan 2026 18:00:00 +0530",
      "value_score": 31,
      "value_signals": [
        "Auth bypass",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "TikTok Forms U.S. Joint Venture to Continue Operations Under 2025 Executive Order",
      "link": "https://thehackernews.com/2026/01/tiktok-forms-us-joint-venture-to.html",
      "summary": "TikTok on Friday officially announced that it formed a joint venture that will allow the hugely popular video-sharing application to continue operating in the U.S. The new venture, named TikTok USDS Joint Venture LLC, has been established in compliance with the Executive Order signed by U.S. President Donald Trump in September 2025, the platform said. The new deal will see TikTok's Chinese",
      "published": "Fri, 23 Jan 2026 17:00:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Phishing Attack Uses Stolen Credentials to Install LogMeIn RMM for Persistent Access",
      "link": "https://thehackernews.com/2026/01/phishing-attack-uses-stolen-credentials.html",
      "summary": "Cybersecurity researchers have disclosed details of a new dual-vector campaign that leverages stolen credentials to deploy legitimate Remote Monitoring and Management (RMM) software for persistent remote access to compromised hosts. \"Instead of deploying custom viruses, attackers are bypassing security perimeters by weaponizing the necessary IT tools that administrators trust,\" KnowBe4 Threat",
      "published": "Fri, 23 Jan 2026 16:48:00 +0530",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Microsoft Flags Multi-Stage AitM Phishing and BEC Attacks Targeting Energy Firms",
      "link": "https://thehackernews.com/2026/01/microsoft-flags-multi-stage-aitm.html",
      "summary": "Microsoft has warned of a multi‑stage adversary‑in‑the‑middle (AitM) phishing and business email compromise (BEC) campaign targeting multiple organizations in the energy sector. \"The campaign abused SharePoint file‑sharing services to deliver phishing payloads and relied on inbox rule creation to maintain persistence and evade user awareness,\" the Microsoft Defender Security Research Team said.",
      "published": "Fri, 23 Jan 2026 13:55:00 +0530",
      "value_score": 26,
      "value_signals": [
        "Phishing ×3"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "New Osiris Ransomware Emerges as New Strain Using POORTRY Driver in BYOVD Attack",
      "link": "https://thehackernews.com/2026/01/new-osiris-ransomware-emerges-as-new.html",
      "summary": "Cybersecurity researchers have disclosed details of a new ransomware family called Osiris that targeted a major food service franchisee operator in Southeast Asia in November 2025. The attack leveraged a malicious driver called POORTRY as part of a known technique referred to as bring your own vulnerable driver (BYOVD) to disarm security software, the Symantec and Carbon Black Threat Hunter",
      "published": "Thu, 22 Jan 2026 23:30:00 +0530",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Critical GNU InetUtils telnetd Flaw Lets Attackers Bypass Login and Gain Root Access",
      "link": "https://thehackernews.com/2026/01/critical-gnu-inetutils-telnetd-flaw.html",
      "summary": "A critical security flaw has been disclosed in the GNU InetUtils telnet daemon (telnetd) that went unnoticed for nearly 11 years. The vulnerability, tracked as CVE-2026-24061, is rated 9.8 out of 10.0 on the CVSS scoring system. It affects all versions of GNU InetUtils from version 1.9.3 up to and including version 2.7. \"Telnetd in GNU Inetutils through 2.7 allows remote authentication bypass",
      "published": "Thu, 22 Jan 2026 22:00:00 +0530",
      "value_score": 59,
      "value_signals": [
        "CVE mentioned",
        "Auth bypass",
        "High severity ×2"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "ThreatsDay Bulletin: Pixel Zero-Click, Redis RCE, China C2s, RAT Ads, Crypto Scams & 15+ Stories",
      "link": "https://thehackernews.com/2026/01/threatsday-bulletin-pixel-zero-click.html",
      "summary": "Most of this week’s threats didn’t rely on new tricks. They relied on familiar systems behaving exactly as designed, just in the wrong hands. Ordinary files, routine services, and trusted workflows were enough to open doors without forcing them. What stands out is how little friction attackers now need. Some activity focused on quiet reach and coverage, others on timing and reuse. The emphasis",
      "published": "Thu, 22 Jan 2026 19:53:00 +0530",
      "value_score": 30,
      "value_signals": [
        "RCE"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Filling the Most Common Gaps in Google Workspace Security",
      "link": "https://thehackernews.com/2026/01/filling-most-common-gaps-in-google.html",
      "summary": "Security teams at agile, fast-growing companies often have the same mandate: secure the business without slowing it down. Most teams inherit a tech stack optimized for breakneck growth, not resilience. In these environments, the security team is the helpdesk, the compliance expert, and the incident response team all rolled into one. Securing the cloud office in this scenario is all about",
      "published": "Thu, 22 Jan 2026 17:00:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft: Outlook for iOS crashes, freezes due to coding error",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-outlook-for-ios-crashes-freezes-due-to-coding-error/",
      "summary": "Microsoft confirmed today that Outlook mobile may crash or freeze when launched on iPad devices due to a coding error. [...]",
      "published": "Fri, 23 Jan 2026 08:34:25 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Hackers get $1,047,000 for 76 zero-days at Pwn2Own Automotive 2026",
      "link": "https://www.bleepingcomputer.com/news/security/hackers-get-1-047-000-for-76-zero-days-at-pwn2own-automotive-2026/",
      "summary": "Pwn2Own Automotive 2026 has ended with security researchers earning $1,047,000 after exploiting 76 zero-day vulnerabilities between January 21 and January 23. [...]",
      "published": "Fri, 23 Jan 2026 07:50:11 -0500",
      "value_score": 41,
      "value_signals": [
        "Zero-day",
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Fortinet confirms critical FortiCloud auth bypass not fully patched",
      "link": "https://www.bleepingcomputer.com/news/security/fortinet-confirms-critical-forticloud-auth-bypass-not-fully-patched/",
      "summary": "Days after admins began reporting that their fully patched firewalls are being hacked, Fortinet confirmed it's working to fully address a critical FortiCloud SSO authentication bypass vulnerability that should have already been patched since early December. [...]",
      "published": "Fri, 23 Jan 2026 05:39:03 -0500",
      "value_score": 56,
      "value_signals": [
        "Auth bypass ×2",
        "High severity ×2"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Okta SSO accounts targeted in vishing-based data theft attacks",
      "link": "https://www.bleepingcomputer.com/news/security/okta-sso-accounts-targeted-in-vishing-based-data-theft-attacks/",
      "summary": "Okta is warning about custom phishing kits built specifically for voice-based social engineering (vishing) attacks. BleepingComputer has learned that these kits are being used in active attacks to steal Okta SSO credentials for data theft. [...]",
      "published": "Thu, 22 Jan 2026 16:43:43 -0500",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Curl ending bug bounty program after flood of AI slop reports",
      "link": "https://www.bleepingcomputer.com/news/security/curl-ending-bug-bounty-program-after-flood-of-ai-slop-reports/",
      "summary": "The developer of the popular curl command-line utility and library announced that the project will end its HackerOne security bug bounty program at the end of this month, after being overwhelmed by low-quality AI-generated vulnerability reports. [...]",
      "published": "Thu, 22 Jan 2026 14:01:36 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "SmarterMail auth bypass flaw now exploited to hijack admin accounts",
      "link": "https://www.bleepingcomputer.com/news/security/smartermail-auth-bypass-flaw-now-exploited-to-hijack-admin-accounts/",
      "summary": "Hackers began exploiting an authentication bypass vulnerability in SmarterTools' SmarterMail email server and collaboration tool that allows resetting admin passwords. [...]",
      "published": "Thu, 22 Jan 2026 13:44:21 -0500",
      "value_score": 46,
      "value_signals": [
        "Auth bypass ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft Teams to add brand impersonation warnings to calls",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-teams-to-add-brand-impersonation-warnings-to-calls/",
      "summary": "Microsoft will soon add new fraud protection features to Teams calls, warning users about external callers who attempt to impersonate trusted organizations in social engineering attacks. [...]",
      "published": "Thu, 22 Jan 2026 11:28:47 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "INC ransomware opsec fail allowed data recovery for 12 US orgs",
      "link": "https://www.bleepingcomputer.com/news/security/inc-ransomware-opsec-fail-allowed-data-recovery-for-12-us-orgs/",
      "summary": "An operational security failure allowed researchers to recover data that the INC ransomware gang stole from a dozen U.S. organizations. [...]",
      "published": "Thu, 22 Jan 2026 11:21:17 -0500",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
      "link": "https://krebsonsecurity.com/2026/01/kimwolf-botnet-lurking-in-corporate-govt-networks/",
      "summary": "A new Internet-of-Things botnet called Kimwolf has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf's ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.",
      "published": "Tue, 20 Jan 2026 18:19:13 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×2"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, January 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "published": "Wed, 14 Jan 2026 00:47:38 +0000",
      "value_score": 40,
      "value_signals": [
        "Patch/update ×2",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Who Benefited from the Aisuru and Kimwolf Botnets?",
      "link": "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
      "summary": "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we'll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf's spread.",
      "published": "Thu, 08 Jan 2026 23:23:43 +0000",
      "value_score": 20,
      "value_signals": [
        "Botnet"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "The Kimwolf Botnet is Stalking Your Local Network",
      "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
      "summary": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.",
      "published": "Fri, 02 Jan 2026 14:20:10 +0000",
      "value_score": 26,
      "value_signals": [
        "Botnet",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Happy 16th Birthday, KrebsOnSecurity.com!",
      "link": "https://krebsonsecurity.com/2025/12/happy-16th-birthday-krebsonsecurity-com/",
      "summary": "KrebsOnSecurity.com celebrates its 16th anniversary today! A huge \"thank you\" to all of our readers -- newcomers, long-timers and drive-by critics alike. Your engagement this past year here has been tremendous and truly a salve on a handful of dark days. Happily, comeuppance was a strong theme running through our coverage in 2025, with a primary focus on entities that enabled complex and globally-dispersed cybercrime services.",
      "published": "Mon, 29 Dec 2025 20:23:26 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Dismantling Defenses: Trump 2.0 Cyber Year in Review",
      "link": "https://krebsonsecurity.com/2025/12/dismantling-defenses-trump-2-0-cyber-year-in-review/",
      "summary": "The Trump administration has pursued a staggering range of policy pivots this past year that threaten to weaken the nation’s ability and willingness to address a broad spectrum of technology challenges, from cybersecurity and privacy to countering disinformation, fraud and corruption. These shifts, along with the president’s efforts to restrict free speech and freedom of the press, have come at such a rapid clip that many readers probably aren’t even aware of them all.",
      "published": "Fri, 19 Dec 2025 15:14:55 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Most Parked Domains Now Serving Malicious Content",
      "link": "https://krebsonsecurity.com/2025/12/most-parked-domains-now-serving-malicious-content/",
      "summary": "Direct navigation -- the act of visiting a website by manually typing a domain name in a web browser -- has never been riskier: A new study finds the vast majority of \"parked\" domains -- mostly expired or dormant domain names, or common misspellings of popular websites -- are now configured to redirect visitors to sites that foist scams and malware.",
      "published": "Tue, 16 Dec 2025 14:14:48 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Microsoft Patch Tuesday, December 2025 Edition",
      "link": "https://krebsonsecurity.com/2025/12/microsoft-patch-tuesday-december-2025-edition/",
      "summary": "Microsoft today pushed updates to fix at least 56 security flaws in its Windows operating systems and supported software. This final Patch Tuesday of 2025 tackles one zero-day bug that is already being exploited, as well as two publicly disclosed vulnerabilities.",
      "published": "Tue, 09 Dec 2025 23:18:29 +0000",
      "value_score": 57,
      "value_signals": [
        "Zero-day",
        "Patch/update ×3",
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Risky Chinese Electric Buses Spark Aussie Gov't Review",
      "link": "https://www.darkreading.com/cyber-risk/chinese-electric-buses-aussie-govt",
      "summary": "Deployed across Australia and Europe, China's electric buses are vulnerable to cybercriminals and sport a virtual kill switch the Chinese state could activate.",
      "published": "Thu, 22 Jan 2026 22:13:49 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Fortinet Firewalls Hit With Malicious Configuration Changes",
      "link": "https://www.darkreading.com/cloud-security/fortinet-firewalls-malicious-configuration-changes",
      "summary": "Automated infections of potentially fully patched FortiGate devices are allowing threat actors to steal firewall configuration files.",
      "published": "Thu, 22 Jan 2026 21:18:42 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "From a Whisper to a Scream: Europe Frets About Overreliance on US Tech",
      "link": "https://www.darkreading.com/cybersecurity-operations/europe-frets-about-overreliance-on-us-tech",
      "summary": "Concern is growing across Europe about relying on US cybersecurity companies, and Greenland takeover talk is eroding trust across the EU even further.",
      "published": "Thu, 22 Jan 2026 18:09:00 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Latin American Orgs Lack Confidence in Cyber Defenses, Skills",
      "link": "https://www.darkreading.com/cyber-risk/latin-american-confidence-cyber-defenses-skills",
      "summary": "Cybersecurity professionals in Latin America are least likely to have faith in their countries' preparedness for cyberattacks on critical infrastructure, the World Economic Forum says.",
      "published": "Thu, 22 Jan 2026 16:05:18 GMT",
      "value_score": 18,
      "value_signals": [
        "High severity"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "DPRK Actors Deploy VS Code Tunnels for Remote Hacking",
      "link": "https://www.darkreading.com/endpoint-security/dprk-vs-code-tunnels-remote-hacking",
      "summary": "A spear-phishing campaign tied to the Democratic People's Republic of Korea (DPRK) uses trusted Microsoft infrastructure to avoid detection.",
      "published": "Thu, 22 Jan 2026 14:05:11 GMT",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "AI Agents Undermine Progress in Browser Security",
      "link": "https://www.darkreading.com/application-security/ai-agents-undermine-progress-browser-security",
      "summary": "Web browser companies have put in substantial effort over the past three decades to strengthen the browser security stack against abuses. Agentic browsers are undoing all that work.",
      "published": "Wed, 21 Jan 2026 23:06:50 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "'Contagious Interview' Attack Now Delivers Backdoor Via VS Code",
      "link": "https://www.darkreading.com/cyber-risk/contagious-interview-attack-delivers-backdoor",
      "summary": "Once trust is granted to the repository's author, a malicious app executes arbitrary commands on the victim's system with no other user interaction.",
      "published": "Wed, 21 Jan 2026 22:00:37 GMT",
      "value_score": 22,
      "value_signals": [
        "Backdoor"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Phishing Campaign Zeroes in on LastPass Customers",
      "link": "https://www.darkreading.com/application-security/phishing-campaign-zeroes-lastpass-customers",
      "summary": "The bait incudes plausible subject lines and credible messages, most likely thanks to attackers' use of large language models to craft them.",
      "published": "Wed, 21 Jan 2026 20:22:02 GMT",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Security Week",
      "title": "Fortinet Confirms FortiCloud SSO Exploitation Against Patched Devices",
      "link": "https://www.securityweek.com/fortinet-confirms-forticloud-sso-exploitation-against-patched-devices/",
      "summary": "Similar to recent FortiCloud single sign-on (SSO) login vulnerabilities, the attacks bypass authentication. The post Fortinet Confirms FortiCloud SSO Exploitation Against Patched Devices appeared first on SecurityWeek .",
      "published": "Fri, 23 Jan 2026 14:00:07 +0000",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "In Other News: €1.2B GDPR Fines, Net-NTLMv1 Rainbow Tables, Rockwell Security Notice",
      "link": "https://www.securityweek.com/in-other-news-e1-2b-gdpr-fines-net-ntlmv1-rainbow-tables-rockwell-security-notice/",
      "summary": "Other noteworthy stories that might have slipped under the radar: Cloudflare WAF bypass, Canonical Snap Store abused for malware delivery, Curl terminating bug bounty program The post In Other News: €1.2B GDPR Fines, Net-NTLMv1 Rainbow Tables, Rockwell Security Notice appeared first on SecurityWeek .",
      "published": "Fri, 23 Jan 2026 13:53:29 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Phishers Abuse SharePoint in New Campaign Targeting Energy Sector",
      "link": "https://www.securityweek.com/phishers-abuse-sharepoint-in-new-campaign-targeting-energy-sector/",
      "summary": "Threat actors are leveraging the file-sharing service for payload delivery in AitM phishing and BEC attacks. The post Phishers Abuse SharePoint in New Campaign Targeting Energy Sector appeared first on SecurityWeek .",
      "published": "Fri, 23 Jan 2026 13:19:11 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Security Week",
      "title": "Cyber Insights 2026: Regulations and the Tangled Mess of Compliance Requirements",
      "link": "https://www.securityweek.com/cyber-insights-2026-regulations-and-the-tangled-mess-of-compliance-requirements/",
      "summary": "Cyber regulations are where politics meets business – where business becomes subject to political realities. The post Cyber Insights 2026: Regulations and the Tangled Mess of Compliance Requirements appeared first on SecurityWeek .",
      "published": "Fri, 23 Jan 2026 12:30:00 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Under Armour Looking Into Data Breach Affecting Customers’ Email Addresses",
      "link": "https://www.securityweek.com/under-armour-looking-into-data-breach-affecting-customers-email-addresses/",
      "summary": "Under Armour is investigating a recent data breach that purloined customers’ email addresses and other personal information. The post Under Armour Looking Into Data Breach Affecting Customers’ Email Addresses appeared first on SecurityWeek .",
      "published": "Fri, 23 Jan 2026 12:01:18 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×3"
      ]
    },
    {
      "source": "Security Week",
      "title": "Organizations Warned of Exploited Zimbra Collaboration Vulnerability",
      "link": "https://www.securityweek.com/organizations-warned-of-exploited-zimbra-collaboration-vulnerability/",
      "summary": "CISA has added the Zimbra flaw to the KEV catalog along with three other bugs exploited in the wild. The post Organizations Warned of Exploited Zimbra Collaboration Vulnerability appeared first on SecurityWeek .",
      "published": "Fri, 23 Jan 2026 11:47:24 +0000",
      "value_score": 81,
      "value_signals": [
        "Active exploitation",
        "CISA/KEV ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "Infotainment, EV Charger Exploits Earn Hackers $1M at Pwn2Own Automotive 2026",
      "link": "https://www.securityweek.com/infotainment-ev-charger-exploits-earn-hackers-1m-at-pwn2own-automotive-2026/",
      "summary": "Pwn2Own participants disclosed a total of 76 vulnerabilities during the three-day event. The post Infotainment, EV Charger Exploits Earn Hackers $1M at Pwn2Own Automotive 2026 appeared first on SecurityWeek .",
      "published": "Fri, 23 Jan 2026 11:33:22 +0000",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "Fresh SmarterMail Flaw Exploited for Admin Access",
      "link": "https://www.securityweek.com/fresh-smartermail-flaw-exploited-for-admin-access/",
      "summary": "The exploitation of the authentication bypass vulnerability started two days after patches were released. The post Fresh SmarterMail Flaw Exploited for Admin Access appeared first on SecurityWeek .",
      "published": "Fri, 23 Jan 2026 10:34:09 +0000",
      "value_score": 31,
      "value_signals": [
        "Auth bypass",
        "Exploit wording"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "summary": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "published": "Wed, 31 Aug 2022 12:57:48 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "published": "Tue, 30 Aug 2022 16:00:43 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "published": "Mon, 29 Aug 2022 14:56:19 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "published": "Fri, 26 Aug 2022 16:44:27 +0000",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "published": "Thu, 25 Aug 2022 18:47:15 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Twitter Whistleblower Complaint: The TL;DR Version",
      "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
      "summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk.",
      "published": "Wed, 24 Aug 2022 14:17:04 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
      "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
      "summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP.",
      "published": "Tue, 23 Aug 2022 13:19:58 +0000",
      "value_score": 50,
      "value_signals": [
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Fake Reservation Links Prey on Weary Travelers",
      "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
      "summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels.",
      "published": "Mon, 22 Aug 2022 13:59:06 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "CISA Alerts",
      "title": "Rockwell Automation CompactLogix 5370",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-022-03",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an attacker to cause a denial-of-service condition. The following versions of Rockwell Automation CompactLogix 5370 are affected: CompactLogix 5370 (CVE-2025-11743) CompactLogix 5370 (CVE-2025-11743) CompactLogix 5370 (CVE-2025-11743) CVSS Vendor Equipment Vulnerabilities v3 6.5 Rockwell Automation Rockwell Automation CompactLogix 5370 Improper Validation of Specified Quantity in Input Background Critical Infrastructure ",
      "published": "Thu, 22 Jan 26 12:00:00 +0000",
      "value_score": 97,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×3",
        "High severity",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Schneider Electric EcoStruxure Process Expert",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-022-01",
      "summary": "View CSAF Summary Schneider Electric is aware of a vulnerability in its EcoStruxureTM Process and EcoStruxure™ Process Expert for AVEVA System Platform products. The EcoStruxureTM Process is a single automation system to engineer, operate, and maintain your entire infrastructure for a sustainable, productive and market-agile plant. The EcoStruxure™ Process Expert for AVEVA System Platform product enables users to achieve operational profitability from design engineering to meeting the demands of",
      "published": "Thu, 22 Jan 26 12:00:00 +0000",
      "value_score": 35,
      "value_signals": [
        "Source boost: CISA Alerts"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "EVMAPA",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-022-08",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could lead to degraded service, a denial-of-service, or unauthorized remote command execution, which could lead to spoofing or a manipulation of charging station statuses. The following versions of EVMAPA are affected: EVMAPA (CVE-2025-54816, CVE-2025-53968, CVE-2025-55705) CVSS Vendor Equipment Vulnerabilities v3 9.4 EVMAPA EVMAPA Missing Authentication for Critical Function, Improper Restriction of Excessive Authentication Atte",
      "published": "Thu, 22 Jan 26 12:00:00 +0000",
      "value_score": 97,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×3",
        "High severity",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Weintek cMT X Series HMI EasyWeb Service",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-022-05",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could allow a low-level user to alter privileges and gain full control to the device. The following versions of Weintek cMT X Series HMI EasyWeb Service are affected: cMT3072XH (CVE-2025-14750, CVE-2025-14751) cMT3072XH(T) (CVE-2025-14750, CVE-2025-14751) cMT-SVRX-820 (CVE-2025-14750, CVE-2025-14751) cMT-CTRL01 (CVE-2025-14750, CVE-2025-14751) CVSS Vendor Equipment Vulnerabilities v3 8.3 Weintek Weintek cMT X Series HMI EasyWeb S",
      "published": "Thu, 22 Jan 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×8",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds Four Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/01/22/cisa-adds-four-known-exploited-vulnerabilities-catalog",
      "summary": "CISA has added four new vulnerabilities to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2025-31125 Vite Vitejs Improper Access Control Vulnerability CVE-2025-34026 Versa Concerto Improper Authentication Vulnerability CVE-2025-54313 Prettier eslint-config-prettier Embedded Malicious Code Vulnerability CVE-2025-68645 Synacor Zimbra Collaboration Suite (ZCS) PHP Remote File Inclusion Vulnerability These types of vulnerabilities are frequent attac",
      "published": "Thu, 22 Jan 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "CISA/KEV ×5",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Delta Electronics DIAView",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-022-07",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could enable an attacker to execute arbitrary code. The following versions of Delta Electronics DIAView are affected: DIAView (CVE-2026-0975) CVSS Vendor Equipment Vulnerabilities v3 7.8 Delta Electronics Delta Electronics DIAView Improper Neutralization of Special Elements used in a Command ('Command Injection') Background Critical Infrastructure Sectors: Chemical, Commercial Facilities, Critical Manufacturing, Energy, Transportati",
      "published": "Thu, 22 Jan 26 12:00:00 +0000",
      "value_score": 75,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Johnson Controls Inc. iSTAR Configuration Utility (ICU) tool",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-022-04",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an attacker to cause a failure within the operating system of the machine hosting the ICU tool. The following versions of Johnson Controls Inc. iSTAR Configuration Utility (ICU) tool are affected: iSTAR Configuration Utility (ICU) tool (CVE-2025-26386) CVSS Vendor Equipment Vulnerabilities v3 7.1 Johnson Controls Inc. Johnson Controls Inc. iSTAR Configuration Utility (ICU) tool Stack-based Buffer Overflow Background Crit",
      "published": "Thu, 22 Jan 26 12:00:00 +0000",
      "value_score": 59,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "AutomationDirect CLICK Programmable Logic Controller",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-022-02",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could allow an attacker to impersonate users, escalate privileges, gain unauthorized access to systems and services, and decrypt sensitive data. The following versions of AutomationDirect CLICK Programmable Logic Controller are affected: CLICK Programmable Logic Controller (CVE-2025-67652, CVE-2025-25051) CLICK Programmable Logic Controller (CVE-2025-67652, CVE-2025-25051) CLICK Programmable Logic Controller (CVE-2025-67652, CVE-",
      "published": "Thu, 22 Jan 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×5",
        "Multiple CVEs",
        "Exploit wording"
      ]
    }
  ],
  "sources": [
    "The Hacker News",
    "BleepingComputer",
    "Krebs on Security",
    "Dark Reading",
    "Security Week",
    "Naked Security",
    "Threatpost",
    "CISA Alerts"
  ]
}