{
  "last_updated": "2026-02-26 04:12",
  "sources_count": 8,
  "articles_count": 56,
  "keywords": [
    "badbox 2 0",
    "critical vulnerability affecting",
    "scattered lapsus shinyhunters",
    "russia peter williams",
    "prolific elusive actor",
    "digital battlespace report",
    "remote code execution",
    "windows operating systems",
    "make things simpler",
    "50 security holes",
    "twitter whistleblower complaint",
    "system admin user",
    "legitimate site forwarding",
    "cve 2026 20127",
    "mission critical priority",
    "multiple building systems",
    "targeting international governments",
    "dark web openclaw",
    "cyberattack american manufacturer",
    "attacks targeting telecom"
  ],
  "trending": [
    {
      "keyword": "badbox 2 0",
      "mentions": 220
    },
    {
      "keyword": "critical vulnerability affecting",
      "mentions": 8
    },
    {
      "keyword": "scattered lapsus shinyhunters",
      "mentions": 189
    },
    {
      "keyword": "russia peter williams",
      "mentions": 7
    },
    {
      "keyword": "prolific elusive actor",
      "mentions": 5
    },
    {
      "keyword": "digital battlespace report",
      "mentions": 7
    },
    {
      "keyword": "remote code execution",
      "mentions": 131
    },
    {
      "keyword": "windows operating systems",
      "mentions": 419
    },
    {
      "keyword": "make things simpler",
      "mentions": 6
    },
    {
      "keyword": "50 security holes",
      "mentions": 130
    }
  ],
  "articles": [
    {
      "source": "The Hacker News",
      "title": "Google Disrupts UNC2814 GRIDTIDE Campaign After 53 Breaches Across 42 Countries",
      "link": "https://thehackernews.com/2026/02/google-disrupts-unc2814-gridtide.html",
      "summary": "Google on Wednesday disclosed that it worked with industry partners to disrupt the infrastructure of a suspected China-nexus cyber espionage group tracked as UNC2814 that breached at least 53 organizations across 42 countries. \"This prolific, elusive actor has a long history of targeting international governments and global telecommunications organizations across Africa, Asia, and the Americas,\"",
      "published": "Wed, 25 Feb 2026 23:16:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Claude Code Flaws Allow Remote Code Execution and API Key Exfiltration",
      "link": "https://thehackernews.com/2026/02/claude-code-flaws-allow-remote-code.html",
      "summary": "Cybersecurity researchers have disclosed multiple security vulnerabilities in Anthropic's Claude Code, an artificial intelligence (AI)-powered coding assistant, that could result in remote code execution and theft of API credentials. \"The vulnerabilities exploit various configuration mechanisms, including Hooks, Model Context Protocol (MCP) servers, and environment variables – executing",
      "published": "Wed, 25 Feb 2026 22:30:00 +0530",
      "value_score": 56,
      "value_signals": [
        "RCE ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "SLH Offers $500–$1,000 Per Call to Recruit Women for IT Help Desk Vishing Attacks",
      "link": "https://thehackernews.com/2026/02/slh-offers-5001000-per-call-to-recruit.html",
      "summary": "The notorious cybercrime collective known as Scattered LAPSUS$ Hunters (SLH) has been observed offering financial incentives to recruit women to pull off social engineering attacks. The idea is to hire them for voice phishing campaigns targeting IT help desks, Dataminr said in a new threat brief. The group is said to be offering anywhere between $500 and $1,000 upfront per call, in addition to",
      "published": "Wed, 25 Feb 2026 20:36:00 +0530",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Top 5 Ways Broken Triage Increases Business Risk Instead of Reducing It",
      "link": "https://thehackernews.com/2026/02/top-5-ways-broken-triage-increases.html",
      "summary": "Triage is supposed to make things simpler. In a lot of teams, it does the opposite. When you can’t reach a confident verdict early, alerts turn into repeat checks, back-and-forth, and “just escalate it” calls. That cost doesn’t stay inside the SOC; it shows up as missed SLAs, higher cost per case, and more room for real threats to slip through. So where does triage go wrong? Here are five triage",
      "published": "Wed, 25 Feb 2026 20:00:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Malicious NuGet Packages Stole ASP.NET Data; npm Package Dropped Malware",
      "link": "https://thehackernews.com/2026/02/malicious-nuget-packages-stole-aspnet.html",
      "summary": "Cybersecurity researchers have discovered four malicious NuGet packages that are designed to target ASP.NET web application developers to steal sensitive data. The campaign, discovered by Socket, exfiltrates ASP.NET Identity data, including user accounts, role assignments, and permission mappings, as well as manipulates authorization rules to create persistent backdoors in victim applications.",
      "published": "Wed, 25 Feb 2026 18:13:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Manual Processes Are Putting National Security at Risk",
      "link": "https://thehackernews.com/2026/02/manual-processes-are-putting-national.html",
      "summary": "Why automating sensitive data transfers is now a mission-critical priority More than half of national security organizations still rely on manual processes to transfer sensitive data, according to The CYBER360: Defending the Digital Battlespace report. This should alarm every defense and government leader because manual handling of sensitive data is not just inefficient, it is a systemic",
      "published": "Wed, 25 Feb 2026 16:30:00 +0530",
      "value_score": 18,
      "value_signals": [
        "High severity"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Defense Contractor Employee Jailed for Selling 8 Zero-Days to Russian Broker",
      "link": "https://thehackernews.com/2026/02/defense-contractor-employee-jailed-for.html",
      "summary": "A 39-year-old Australian national who was previously employed at U.S. defense contractor L3Harris has been sentenced to a little over seven years in prison for selling eight zero-day exploits to Russian exploit broker Operation Zero in exchange for millions of dollars. Peter Williams pleaded guilty to two counts of theft of trade secrets in October 2025. In addition to the jail term, Williams",
      "published": "Wed, 25 Feb 2026 14:19:00 +0530",
      "value_score": 41,
      "value_signals": [
        "Zero-day",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "SolarWinds Patches 4 Critical Serv-U 15.5 Flaws Allowing Root Code Execution",
      "link": "https://thehackernews.com/2026/02/solarwinds-patches-4-critical-serv-u.html",
      "summary": "SolarWinds has released updates to address four critical security flaws in its Serv-U file transfer software that, if successfully exploited, could result in remote code execution. The vulnerabilities, all rated 9.1 on the CVSS scoring system, are listed below - CVE-2025-40538 - A broken access control vulnerability that allows an attacker to create a system admin user and execute arbitrary",
      "published": "Wed, 25 Feb 2026 12:34:00 +0530",
      "value_score": 70,
      "value_signals": [
        "CVE mentioned",
        "RCE",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Medical device maker UFP Technologies warns of data stolen in cyberattack",
      "link": "https://www.bleepingcomputer.com/news/security/medical-device-maker-ufp-technologies-warns-of-data-stolen-in-cyberattack/",
      "summary": "American manufacturer of medical devices, UFP Technologies, has disclosed that a cybersecurity incident has compromised its IT systems and data. [...]",
      "published": "Wed, 25 Feb 2026 18:02:16 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Fake Next.js job interview tests backdoor developer's devices",
      "link": "https://www.bleepingcomputer.com/news/security/fake-nextjs-job-interview-tests-backdoor-developers-devices/",
      "summary": "The Microsoft Defender team has discovered a coordinated campaign targeting software developers through malicious repositories posing as legitimate Next.js projects and technical assessment materials, including recruiting coding tests. [...]",
      "published": "Wed, 25 Feb 2026 16:47:12 -0500",
      "value_score": 22,
      "value_signals": [
        "Backdoor"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Critical Cisco SD-WAN bug exploited in zero-day attacks since 2023",
      "link": "https://www.bleepingcomputer.com/news/security/critical-cisco-sd-wan-bug-exploited-in-zero-day-attacks-since-2023/",
      "summary": "Cisco is warning that a critical authentication bypass vulnerability in Cisco Catalyst SD-WAN, tracked as CVE-2026-20127, was actively exploited in zero-day attacks that allowed remote attackers to compromise controllers and add malicious rogue peers to targeted networks. [...]",
      "published": "Wed, 25 Feb 2026 13:01:51 -0500",
      "value_score": 100,
      "value_signals": [
        "CVE mentioned",
        "Zero-day ×2",
        "Active exploitation",
        "Auth bypass",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Chinese cyberspies breached dozens of telecom firms, govt agencies",
      "link": "https://www.bleepingcomputer.com/news/security/chinese-cyberspies-breached-dozens-of-telecom-firms-govt-agencies/",
      "summary": "Google's Threat Intelligence Group (GTIG), Mandiant, and partners disrupted a global espionage campaign attributed to a suspected Chinese threat actor that used SaaS API calls to hide malicious traffic in attacks targeting telecom and government networks. [...]",
      "published": "Wed, 25 Feb 2026 12:00:15 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Marquis sues SonicWall over backup breach that led to ransomware attack",
      "link": "https://www.bleepingcomputer.com/news/security/marquis-sues-sonicwall-over-backup-breach-that-led-to-ransomware-attack/",
      "summary": "Marquis Software Solutions has filed a lawsuit against SonicWall, accusing the cybersecurity company of gross negligence and misrepresentation that allegedly led to a ransomware attack disrupting operations at 74 U.S. banks. [...]",
      "published": "Wed, 25 Feb 2026 10:54:44 -0500",
      "value_score": 58,
      "value_signals": [
        "Ransomware ×2",
        "Breach/leak"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "The OpenClaw Hype: Analysis of Chatter from Open-Source Deep and Dark Web",
      "link": "https://www.bleepingcomputer.com/news/security/the-openclaw-hype-analysis-of-chatter-from-open-source-deep-and-dark-web/",
      "summary": "OpenClaw has sparked heavy Telegram and dark web chatter, but Flare's data shows more research hype than mass exploitation. Flare explains how its telemetry found real supply-chain risk in the skills marketplace, yet limited signs of large-scale criminal operationalization. [...]",
      "published": "Wed, 25 Feb 2026 10:01:11 -0500",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Zyxel warns of critical RCE flaw affecting over a dozen routers",
      "link": "https://www.bleepingcomputer.com/news/security/zyxel-warns-of-critical-rce-flaw-affecting-over-a-dozen-routers/",
      "summary": "Taiwan networking provider Zyxel has released security updates to address a critical vulnerability affecting over a dozen router models that can allow unauthenticated attackers to gain remote command execution on unpatched devices. [...]",
      "published": "Wed, 25 Feb 2026 07:53:02 -0500",
      "value_score": 46,
      "value_signals": [
        "RCE",
        "High severity ×2"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "US sanctions Russian broker for buying stolen zero-day exploits",
      "link": "https://www.bleepingcomputer.com/news/security/us-sanctions-russian-exploit-broker-for-buying-stolen-zero-days/",
      "summary": "The U.S. Treasury Department has sanctioned a Russian exploit broker who bought stolen hacking tools from a former executive of a U.S. defense contractor. [...]",
      "published": "Wed, 25 Feb 2026 05:31:13 -0500",
      "value_score": 41,
      "value_signals": [
        "Zero-day",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "‘Starkiller’ Phishing Service Proxies Real Login Pages, MFA",
      "link": "https://krebsonsecurity.com/2026/02/starkiller-phishing-service-proxies-real-login-pages-mfa/",
      "summary": "Most phishing websites are little more than static copies of login pages for popular online destinations, and they are often quickly taken down by anti-abuse activists and security firms. But a stealthy new phishing-as-a-service offering lets customers sidestep both of these pitfalls: It uses cleverly disguised links to load the target brand's real website, and then acts as a relay between the target and the legitimate site -- forwarding the victim's username, password and multi-factor authentic",
      "published": "Fri, 20 Feb 2026 20:00:30 +0000",
      "value_score": 26,
      "value_signals": [
        "Phishing ×3"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Swamps Anonymity Network I2P",
      "link": "https://krebsonsecurity.com/2026/02/kimwolf-botnet-swamps-anonymity-network-i2p/",
      "summary": "For the past week, the massive \"Internet of Things\" (IoT) botnet known as Kimwolf has been disrupting the The Invisible Internet Project (I2P), a decentralized, encrypted communications network designed to anonymize and secure online communications. I2P users started reporting disruptions in the network around the same time the Kimwolf botmasters began relying on it to evade takedown attempts against the botnet's control servers.",
      "published": "Wed, 11 Feb 2026 16:08:11 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×3"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, February 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/02/patch-tuesday-february-2026-edition/",
      "summary": "Microsoft today released updates to fix more than 50 security holes in its Windows operating systems and other software, including patches for a whopping six \"zero-day\" vulnerabilities that attackers are already exploiting in the wild.",
      "published": "Tue, 10 Feb 2026 21:49:53 +0000",
      "value_score": 82,
      "value_signals": [
        "Zero-day",
        "Active exploitation",
        "Patch/update ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Please Don’t Feed the Scattered Lapsus ShinyHunters",
      "link": "https://krebsonsecurity.com/2026/02/please-dont-feed-the-scattered-lapsus-shiny-hunters/",
      "summary": "A prolific data ransom gang that calls itself Scattered Lapsus ShinyHunters (SLSH) has a distinctive playbook when it seeks to extort payment from victim firms: Harassing, threatening and even swatting executives and their families, all while notifying journalists and regulators… Read More »",
      "published": "Mon, 02 Feb 2026 16:15:16 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Who Operates the Badbox 2.0 Botnet?",
      "link": "https://krebsonsecurity.com/2026/01/who-operates-the-badbox-2-0-botnet/",
      "summary": "The cybercriminals in control of Kimwolf -- a disruptive botnet that has infected more than 2 million devices -- recently shared a screenshot indicating they'd compromised the control panel for Badbox 2.0, a vast China-based botnet powered by malicious software that comes pre-installed on many Android TV streaming boxes. Both the FBI and Google say they are hunting for the people behind Badbox 2.0, and thanks to bragging by the Kimwolf botmasters we may now have a much clearer idea about that.",
      "published": "Mon, 26 Jan 2026 16:11:38 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×3"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
      "link": "https://krebsonsecurity.com/2026/01/kimwolf-botnet-lurking-in-corporate-govt-networks/",
      "summary": "A new Internet-of-Things botnet called Kimwolf has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf's ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.",
      "published": "Tue, 20 Jan 2026 18:19:13 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×2"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, January 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "published": "Wed, 14 Jan 2026 00:47:38 +0000",
      "value_score": 40,
      "value_signals": [
        "Patch/update ×2",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Who Benefited from the Aisuru and Kimwolf Botnets?",
      "link": "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
      "summary": "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we'll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf's spread.",
      "published": "Thu, 08 Jan 2026 23:23:43 +0000",
      "value_score": 20,
      "value_signals": [
        "Botnet"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Chinese Police Use ChatGPT to Smear Japan PM Takaichi",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/chinese-police-chatgpt-smear-japan-pm-takaichi",
      "summary": "A Chinese keyboard warrior inadvertently leaked information about politically motivated influence operations through a ChatGPT account.",
      "published": "Thu, 26 Feb 2026 00:00:00 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Flaws in Claude Code Put Developers' Machines at Risk",
      "link": "https://www.darkreading.com/application-security/flaws-claude-code-developer-machines-risk",
      "summary": "The vulnerabilities highlight a big drawback to integrating AI into software development workflows and the potential impact on supply chains.",
      "published": "Wed, 25 Feb 2026 22:02:32 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "RAMP Forum Seizure Fractures Ransomware Ecosystem",
      "link": "https://www.darkreading.com/threat-intelligence/ramp-forum-seizure-fractures-ransomware-ecosystem",
      "summary": "Researchers suggest defenders monitor how these malicious groups re-form and leverage the useful threat intel to guide their next moves.",
      "published": "Wed, 25 Feb 2026 21:14:21 GMT",
      "value_score": 28,
      "value_signals": [
        "Ransomware"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "PCI Council Says Threats to Payments Systems Are Speeding Up",
      "link": "https://www.darkreading.com/cyber-risk/pci-council-threats-payments-systems-speeding-up",
      "summary": "The PCI Security Standards Council experienced a record year in many regards, but its first annual report shows it needs to work even faster to stay ahead of attackers.",
      "published": "Wed, 25 Feb 2026 19:15:33 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Malicious Next.js Repos Target Developers Via Fake Job Interviews",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/malicious-nextjs-repos-developers-fake-job-interviews",
      "summary": "Linked to North Korean fake job-recruitment campaigns, the poisoned repositories are aimed at establishing persistent access to infected machines.",
      "published": "Wed, 25 Feb 2026 16:42:00 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Why 'Call This Number' TOAD Emails Beat Gateways",
      "link": "https://www.darkreading.com/threat-intelligence/why-call-this-number-toad-emails-beat-gateways",
      "summary": "Attackers are bypassing email gateways through telephone-oriented attack delivery (TOAD), in which the only email payload is a phone number.",
      "published": "Wed, 25 Feb 2026 14:00:00 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "'Richter Scale' Model Measures Magnitude of OT Cyber Incidents",
      "link": "https://www.darkreading.com/ics-ot-security/richter-scale-model-measures-cyber-incidents",
      "summary": "ICS/OT experts have devised a scoring system for rating the severity and effects of cybersecurity events in operational technology environments.",
      "published": "Wed, 25 Feb 2026 12:00:00 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Operation Red Card 2.0 Leads to 651 Arrests in Africa",
      "link": "https://www.darkreading.com/cybersecurity-operations/operation-red-card-2-0-leads-to-651-arrests-in-africa",
      "summary": "In the latest operation targeting cybercrime groups, African law enforcement agencies cooperated with Interpol and cybersecurity firms to recover more than $4.3 million.",
      "published": "Wed, 25 Feb 2026 08:00:00 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "The Blast Radius Problem: Stolen Credentials Are Weaponizing Agentic AI",
      "link": "https://www.securityweek.com/the-blast-radius-problem-stolen-credentials-are-weaponizing-agentic-ai/",
      "summary": "More than half (56%) of the 400,000 vulnerabilities IBM X-Force tracked in 2025 required no authentication before exploitation. The post The Blast Radius Problem: Stolen Credentials Are Weaponizing Agentic AI appeared first on SecurityWeek .",
      "published": "Wed, 25 Feb 2026 16:16:40 +0000",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "Google Disrupts Chinese Hackers Targeting Telecoms, Governments",
      "link": "https://www.securityweek.com/google-disrupts-chinese-cyberespionage-campaign-targeting-telecoms-governments/",
      "summary": "The UNC2814 threat actor has been active since at least 2017, targeting organizations across 42 countries. The post Google Disrupts Chinese Hackers Targeting Telecoms, Governments appeared first on SecurityWeek .",
      "published": "Wed, 25 Feb 2026 16:01:45 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "SolarWinds Patches Four Critical Serv-U Vulnerabilities",
      "link": "https://www.securityweek.com/solarwinds-patches-four-critical-serv-u-vulnerabilities/",
      "summary": "The four security defects could be exploited for remote code execution but require administrative privileges. The post SolarWinds Patches Four Critical Serv-U Vulnerabilities appeared first on SecurityWeek .",
      "published": "Wed, 25 Feb 2026 15:30:00 +0000",
      "value_score": 52,
      "value_signals": [
        "RCE",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "Medical Device Maker UFP Technologies Hit by Cyberattack",
      "link": "https://www.securityweek.com/medical-device-maker-ufp-technologies-hit-by-cyberattack/",
      "summary": "UFP Technologies appears to have been targeted in a ransomware attack that involved data theft and file-encrypting malware. The post Medical Device Maker UFP Technologies Hit by Cyberattack appeared first on SecurityWeek .",
      "published": "Wed, 25 Feb 2026 13:40:46 +0000",
      "value_score": 28,
      "value_signals": [
        "Ransomware"
      ]
    },
    {
      "source": "Security Week",
      "title": "Ex-US Defense Contractor Executive Jailed for Selling Exploits to Russia",
      "link": "https://www.securityweek.com/ex-us-defense-contractor-executive-jailed-for-selling-exploits-to-russia/",
      "summary": "Peter Williams was sentenced to 87 months in prison for selling cyber exploits to a Russian broker. The post Ex-US Defense Contractor Executive Jailed for Selling Exploits to Russia appeared first on SecurityWeek .",
      "published": "Wed, 25 Feb 2026 12:59:30 +0000",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "CarGurus Data Breach Impacts Over 12 Million Users",
      "link": "https://www.securityweek.com/over-12-million-users-impacted-by-cargurus-data-breach/",
      "summary": "Hackers claim to have stolen personally identifiable information and internal corporate data from the automotive firm. The post CarGurus Data Breach Impacts Over 12 Million Users appeared first on SecurityWeek .",
      "published": "Wed, 25 Feb 2026 12:30:00 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Security Week",
      "title": "SecurityWeek Report: 426 Cybersecurity M&A Deals Announced in 2025",
      "link": "https://www.securityweek.com/securityweek-report-426-cybersecurity-ma-deals-announced-in-2025/",
      "summary": "SecurityWeek’s M&A data indicates that today's market is more disciplined, and it seems to favor GRC, data protection, and identity. The post SecurityWeek Report: 426 Cybersecurity M&A Deals Announced in 2025 appeared first on SecurityWeek .",
      "published": "Wed, 25 Feb 2026 12:00:00 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Wynn Resorts Confirms Data Breach After Hackers Remove It From Leak Site",
      "link": "https://www.securityweek.com/wynn-resorts-confirms-data-breach-after-hackers-remove-it-from-leak-site/",
      "summary": "The high-end casino and hotel operator has admitted that employee data was stolen by ShinyHunters. The post Wynn Resorts Confirms Data Breach After Hackers Remove It From Leak Site appeared first on SecurityWeek .",
      "published": "Wed, 25 Feb 2026 11:35:48 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×4"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "summary": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "published": "Wed, 31 Aug 2022 12:57:48 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "published": "Tue, 30 Aug 2022 16:00:43 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "published": "Mon, 29 Aug 2022 14:56:19 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "published": "Fri, 26 Aug 2022 16:44:27 +0000",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "published": "Thu, 25 Aug 2022 18:47:15 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Twitter Whistleblower Complaint: The TL;DR Version",
      "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
      "summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk.",
      "published": "Wed, 24 Aug 2022 14:17:04 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
      "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
      "summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP.",
      "published": "Tue, 23 Aug 2022 13:19:58 +0000",
      "value_score": 50,
      "value_signals": [
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Fake Reservation Links Prey on Weary Travelers",
      "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
      "summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels.",
      "published": "Mon, 22 Aug 2022 13:59:06 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds Two Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/02/25/cisa-adds-two-known-exploited-vulnerabilities-catalog",
      "summary": "CISA has added two new vulnerabilities to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2022-20775 Cisco Catalyst SD-WAN Path Traversal Vulnerability CVE-2026-20127 Cisco Catalyst SD-WAN Controller and Manager Authentication Bypass Vulnerability These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Signif",
      "published": "Wed, 25 Feb 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "Auth bypass",
        "CISA/KEV ×5",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA and Partners Release Guidance for Ongoing Global Exploitation of Cisco SD-WAN Systems",
      "link": "https://www.cisa.gov/news-events/alerts/2026/02/25/cisa-and-partners-release-guidance-ongoing-global-exploitation-cisco-sd-wan-systems",
      "summary": "The purpose of this Alert is to provide resources for organizations with Cisco Software-Defined Wide-Area Networking (SD-WAN) systems, including Federal Civilian Executive Branch (FCEB) agencies, to address ongoing exploitation of multiple vulnerabilities. Notably, the Cybersecurity and Infrastructure Security Agency (CISA) has added CVE-2026-20127 and CVE-2022-20775 to its Known Exploited Vulnerabilities (KEV) Catalog on Feb. 25, 2026. As a result of the malicious cyber activity and vulnerabili",
      "published": "Wed, 25 Feb 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "CISA/KEV ×4",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "InSAT MasterSCADA BUK-TS",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-055-01",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities may allow remote code execution. The following versions of InSAT MasterSCADA BUK-TS are affected: MasterSCADA BUK-TS vers:all/* (CVE-2026-21410, CVE-2026-22553) CVSS Vendor Equipment Vulnerabilities v3 9.8 InSAT InSAT MasterSCADA BUK-TS Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection'), Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection') Background Critical",
      "published": "Tue, 24 Feb 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "RCE",
        "High severity",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/02/24/cisa-adds-one-known-exploited-vulnerability-catalog",
      "summary": "CISA has added one new vulnerability to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2026-25108 Soliton Systems K.K. FileZen OS Command Injection Vulnerability This type of vulnerability is a frequent attack vector for malicious cyber actors and poses significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of Known Exploited Vulnerabilities established the KEV Catalog as a living li",
      "published": "Tue, 24 Feb 26 12:00:00 +0000",
      "value_score": 99,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "CISA/KEV ×6",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Gardyn Home Kit",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-055-03",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could allow unauthenticated users to access and control edge devices, access cloud-based devices and user information without authentication, and pivot to other edge devices managed in the Gardyn cloud environment. The following versions of Gardyn Home Kit are affected: Home Kit Firmware Gardyn Home Kit Mobile Application <2.11.0 (CVE-2025-29628, CVE-2025-29629, CVE-2025-29631, CVE-2025-1242) Gardyn Home Kit Cloud API <2.12.2026 ",
      "published": "Tue, 24 Feb 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Schneider Electric EcoStruxure Building Operation Workstation",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-055-02",
      "summary": "View CSAF Summary Schneider Electric is aware of a vulnerability in EcoStruxure Building Operation Workstation and EcoStruxure Building Operation WebStation. [EcoStruxure Building Operation (EBO)](https://www.se.com/ww/en/product-range/62111-ecostruxure-building-operation-software/#overview) is an open and scalable software platform providing insight, control and management of multiple building systems and devices in one mobile-enabled convenient view. It delivers valuable data for decision-maki",
      "published": "Tue, 24 Feb 26 12:00:00 +0000",
      "value_score": 35,
      "value_signals": [
        "Source boost: CISA Alerts"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds Two Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/02/20/cisa-adds-two-known-exploited-vulnerabilities-catalog",
      "summary": "CISA has added two new vulnerabilities to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2025-49113 RoundCube Webmail Deserialization of Untrusted Data Vulnerability CVE-2025-68461 RoundCube Webmail Cross-site Scripting Vulnerability These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of",
      "published": "Fri, 20 Feb 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "CISA/KEV ×5",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Valmet DNA Engineering Web Tools",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-050-02",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an unauthenticated attacker to manipulate the web maintenance services URL to achieve arbitrary file read access. The following versions of Valmet DNA Engineering Web Tools are affected: Valmet DNA Engineering Web Tools <=C2022 (CVE-2025-15577) CVSS Vendor Equipment Vulnerabilities v3 8.6 Valmet Valmet DNA Engineering Web Tools Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal') Background Crit",
      "published": "Thu, 19 Feb 26 12:00:00 +0000",
      "value_score": 59,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "Exploit wording"
      ]
    }
  ],
  "sources": [
    "The Hacker News",
    "BleepingComputer",
    "Krebs on Security",
    "Dark Reading",
    "Security Week",
    "Naked Security",
    "Threatpost",
    "CISA Alerts"
  ]
}