{
  "last_updated": "2026-01-26 03:52",
  "sources_count": 8,
  "articles_count": 56,
  "keywords": [
    "phishers abuse sharepoint",
    "applications ai agents",
    "single automation system",
    "persistent remote access",
    "executive order signed",
    "executive order 14144",
    "windows 11 devices",
    "widely available products",
    "twitter whistleblower complaint",
    "tracking security flaws",
    "sport remote connectivity",
    "shinyhunters claim hacks",
    "protect human decisions",
    "1password digital vault",
    "windows operating systems",
    "january updates microsoft",
    "vehicle infotainment systems",
    "solely protecting systems",
    "scream europe frets",
    "growing across europe"
  ],
  "trending": [
    {
      "keyword": "phishers abuse sharepoint",
      "mentions": 31
    },
    {
      "keyword": "applications ai agents",
      "mentions": 21
    },
    {
      "keyword": "single automation system",
      "mentions": 41
    },
    {
      "keyword": "persistent remote access",
      "mentions": 32
    },
    {
      "keyword": "executive order signed",
      "mentions": 32
    },
    {
      "keyword": "executive order 14144",
      "mentions": 29
    },
    {
      "keyword": "windows 11 devices",
      "mentions": 7
    },
    {
      "keyword": "widely available products",
      "mentions": 29
    },
    {
      "keyword": "twitter whistleblower complaint",
      "mentions": 475
    },
    {
      "keyword": "tracking security flaws",
      "mentions": 14
    }
  ],
  "articles": [
    {
      "source": "The Hacker News",
      "title": "Multi-Stage Phishing Campaign Targets Russia with Amnesia RAT and Ransomware",
      "link": "https://thehackernews.com/2026/01/multi-stage-phishing-campaign-targets.html",
      "summary": "A new multi-stage phishing campaign has been observed targeting users in Russia with ransomware and a remote access trojan called Amnesia RAT. \"The attack begins with social engineering lures delivered via business-themed documents crafted to appear routine and benign,\" Fortinet FortiGuard Labs researcher Cara Lin said in a technical breakdown published this week. \"These documents and",
      "published": "Sat, 24 Jan 2026 16:39:00 +0530",
      "value_score": 62,
      "value_signals": [
        "Ransomware ×2",
        "Phishing ×2"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "New DynoWiper Malware Used in Attempted Sandworm Attack on Polish Power Sector",
      "link": "https://thehackernews.com/2026/01/new-dynowiper-malware-used-in-attempted.html",
      "summary": "The Russian nation-state hacking group known as Sandworm has been attributed to what has been described as the \"largest cyber attack\" targeting Poland's power system in the last week of December 2025. The attack was unsuccessful, the country's energy minister, Milosz Motyka, said last week. \"The command of the cyberspace forces has diagnosed in the last days of the year the strongest attack on",
      "published": "Sat, 24 Jan 2026 13:51:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Who Approved This Agent? Rethinking Access, Accountability, and Risk in the Age of AI Agents",
      "link": "https://thehackernews.com/2026/01/who-approved-this-agent-rethinking.html",
      "summary": "AI agents are accelerating how work gets done. They schedule meetings, access data, trigger workflows, write code, and take action in real time, pushing productivity beyond human speed across the enterprise. Then comes the moment every security team eventually hits: “Wait… who approved this?” Unlike users or applications, AI agents are often deployed quickly, shared broadly,",
      "published": "Sat, 24 Jan 2026 13:50:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "CISA Adds Actively Exploited VMware vCenter Flaw CVE-2024-37079 to KEV Catalog",
      "link": "https://thehackernews.com/2026/01/cisa-adds-actively-exploited-vmware.html",
      "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Friday added a critical security flaw affecting Broadcom VMware vCenter Server that was patched in June 2024 to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild. The vulnerability in question is CVE-2024-37079 (CVSS score: 9.8), which refers to a heap overflow in the",
      "published": "Sat, 24 Jan 2026 13:39:00 +0530",
      "value_score": 100,
      "value_signals": [
        "CVE mentioned ×2",
        "Active exploitation ×2",
        "CISA/KEV ×5",
        "High severity",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "CISA Updates KEV Catalog with Four Actively Exploited Software Vulnerabilities",
      "link": "https://thehackernews.com/2026/01/cisa-updates-kev-catalog-with-four.html",
      "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Thursday added four security flaws to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation in the wild. The list of vulnerabilities is as follows - CVE-2025-68645 (CVSS score: 8.8) - A PHP remote file inclusion vulnerability in Synacor Zimbra Collaboration Suite (ZCS) that could allow a",
      "published": "Fri, 23 Jan 2026 20:54:00 +0530",
      "value_score": 100,
      "value_signals": [
        "CVE mentioned",
        "Active exploitation ×2",
        "CISA/KEV ×5",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Fortinet Confirms Active FortiCloud SSO Bypass on Fully Patched FortiGate Firewalls",
      "link": "https://thehackernews.com/2026/01/fortinet-confirms-active-forticloud-sso.html",
      "summary": "Fortinet has officially confirmed that it's working to completely plug a FortiCloud SSO authentication bypass vulnerability following reports of fresh exploitation activity on fully-patched firewalls. \"In the last 24 hours, we have identified a number of cases where the exploit was to a device that had been fully upgraded to the latest release at the time of the attack, which suggested a new",
      "published": "Fri, 23 Jan 2026 18:00:00 +0530",
      "value_score": 31,
      "value_signals": [
        "Auth bypass",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "TikTok Forms U.S. Joint Venture to Continue Operations Under 2025 Executive Order",
      "link": "https://thehackernews.com/2026/01/tiktok-forms-us-joint-venture-to.html",
      "summary": "TikTok on Friday officially announced that it formed a joint venture that will allow the hugely popular video-sharing application to continue operating in the U.S. The new venture, named TikTok USDS Joint Venture LLC, has been established in compliance with the Executive Order signed by U.S. President Donald Trump in September 2025, the platform said. The new deal will see TikTok's Chinese",
      "published": "Fri, 23 Jan 2026 17:00:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Phishing Attack Uses Stolen Credentials to Install LogMeIn RMM for Persistent Access",
      "link": "https://thehackernews.com/2026/01/phishing-attack-uses-stolen-credentials.html",
      "summary": "Cybersecurity researchers have disclosed details of a new dual-vector campaign that leverages stolen credentials to deploy legitimate Remote Monitoring and Management (RMM) software for persistent remote access to compromised hosts. \"Instead of deploying custom viruses, attackers are bypassing security perimeters by weaponizing the necessary IT tools that administrators trust,\" KnowBe4 Threat",
      "published": "Fri, 23 Jan 2026 16:48:00 +0530",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "ChatGPT Temporary chat feature is getting a much-needed upgrade",
      "link": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-temporary-chat-feature-is-getting-a-much-needed-upgrade/",
      "summary": "OpenAI is testing a big upgrade for ChatGPT's temporary chat feature. The update will allow you to retain personalization in temporary chat, and still block temporary chat from influencing your account. [...]",
      "published": "Sun, 25 Jan 2026 20:01:12 -0500",
      "value_score": 18,
      "value_signals": [
        "Patch/update"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "1Password adds pop-up warnings for suspected phishing sites",
      "link": "https://www.bleepingcomputer.com/news/security/1password-adds-pop-up-warnings-for-suspected-phishing-sites/",
      "summary": "The 1Password digital vault and password manager has added built-in protection against phishing URLs to help users identify malicious pages and prevent them from sharing account credentials with threat actors. [...]",
      "published": "Sun, 25 Jan 2026 10:17:12 -0500",
      "value_score": 26,
      "value_signals": [
        "Phishing ×2"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft investigates Windows 11 boot failures after January updates",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-investigates-windows-11-boot-failures-after-january-updates/",
      "summary": "Microsoft is investigating reports that some Windows 11 devices are failing to boot with \"UNMOUNTABLE_BOOT_VOLUME\" errors after installing the January 2026 Patch Tuesday security updates. [...]",
      "published": "Sun, 25 Jan 2026 08:20:28 -0500",
      "value_score": 18,
      "value_signals": [
        "Patch/update"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft releases emergency OOB update to fix Outlook freezes",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-emergency-oob-update-to-fix-outlook-freezes/",
      "summary": "Microsoft has released emergency, out-of-band updates on Saturday for Windows 10, Windows 11, and Windows Server to fix an issue that prevented Microsoft Outlook classic from opening when using PSTs stored in cloud storage. [...]",
      "published": "Sat, 24 Jan 2026 20:59:15 -0500",
      "value_score": 26,
      "value_signals": [
        "Patch/update ×3"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Sandworm hackers linked to failed wiper attack on Poland’s energy systems",
      "link": "https://www.bleepingcomputer.com/news/security/sandworm-hackers-linked-to-failed-wiper-attack-on-polands-energy-systems/",
      "summary": "A cyberattack targeting Poland's power grid in late December 2025 has been linked to the Russian state-sponsored hacking group Sandworm, which attempted to deploy a new destructive data-wiping malware dubbed DynoWiper during the attack.. [...]",
      "published": "Sat, 24 Jan 2026 16:58:42 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Konni hackers target blockchain engineers with AI-built malware",
      "link": "https://www.bleepingcomputer.com/news/security/konni-hackers-target-blockchain-engineers-with-ai-built-malware/",
      "summary": "The North Korean hacker group Konni (Opal Sleet, TA406) is using AI-generated PowerShell malware to target developers and engineers in the blockchain sector. [...]",
      "published": "Sat, 24 Jan 2026 10:23:46 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "ShinyHunters claim hacks of Okta, Microsoft SSO accounts for data theft",
      "link": "https://www.bleepingcomputer.com/news/security/shinyhunters-claim-to-be-behind-sso-account-data-theft-attacks/",
      "summary": "The ShinyHunters extortion gang claims it is behind a wave of ongoing voice phishing attacks targeting single sign-on (SSO) accounts at Okta, Microsoft, and Google, enabling threat actors to breach corporate SaaS platforms and steal company data for extortion. [...]",
      "published": "Fri, 23 Jan 2026 18:35:03 -0500",
      "value_score": 30,
      "value_signals": [
        "Breach/leak",
        "Phishing"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Malicious AI extensions on VSCode Marketplace steal developer data",
      "link": "https://www.bleepingcomputer.com/news/security/malicious-ai-extensions-on-vscode-marketplace-steal-developer-data/",
      "summary": "Two malicious extensions in Microsoft's Visual Studio Code (VSCode) Marketplace that were collectively installed 1.5 million times, exfiltrate developer data to China-based servers. [...]",
      "published": "Fri, 23 Jan 2026 15:11:58 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
      "link": "https://krebsonsecurity.com/2026/01/kimwolf-botnet-lurking-in-corporate-govt-networks/",
      "summary": "A new Internet-of-Things botnet called Kimwolf has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf's ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.",
      "published": "Tue, 20 Jan 2026 18:19:13 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×2"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, January 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "published": "Wed, 14 Jan 2026 00:47:38 +0000",
      "value_score": 40,
      "value_signals": [
        "Patch/update ×2",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Who Benefited from the Aisuru and Kimwolf Botnets?",
      "link": "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
      "summary": "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we'll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf's spread.",
      "published": "Thu, 08 Jan 2026 23:23:43 +0000",
      "value_score": 20,
      "value_signals": [
        "Botnet"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "The Kimwolf Botnet is Stalking Your Local Network",
      "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
      "summary": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.",
      "published": "Fri, 02 Jan 2026 14:20:10 +0000",
      "value_score": 26,
      "value_signals": [
        "Botnet",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Happy 16th Birthday, KrebsOnSecurity.com!",
      "link": "https://krebsonsecurity.com/2025/12/happy-16th-birthday-krebsonsecurity-com/",
      "summary": "KrebsOnSecurity.com celebrates its 16th anniversary today! A huge \"thank you\" to all of our readers -- newcomers, long-timers and drive-by critics alike. Your engagement this past year here has been tremendous and truly a salve on a handful of dark days. Happily, comeuppance was a strong theme running through our coverage in 2025, with a primary focus on entities that enabled complex and globally-dispersed cybercrime services.",
      "published": "Mon, 29 Dec 2025 20:23:26 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Dismantling Defenses: Trump 2.0 Cyber Year in Review",
      "link": "https://krebsonsecurity.com/2025/12/dismantling-defenses-trump-2-0-cyber-year-in-review/",
      "summary": "The Trump administration has pursued a staggering range of policy pivots this past year that threaten to weaken the nation’s ability and willingness to address a broad spectrum of technology challenges, from cybersecurity and privacy to countering disinformation, fraud and corruption. These shifts, along with the president’s efforts to restrict free speech and freedom of the press, have come at such a rapid clip that many readers probably aren’t even aware of them all.",
      "published": "Fri, 19 Dec 2025 15:14:55 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Most Parked Domains Now Serving Malicious Content",
      "link": "https://krebsonsecurity.com/2025/12/most-parked-domains-now-serving-malicious-content/",
      "summary": "Direct navigation -- the act of visiting a website by manually typing a domain name in a web browser -- has never been riskier: A new study finds the vast majority of \"parked\" domains -- mostly expired or dormant domain names, or common misspellings of popular websites -- are now configured to redirect visitors to sites that foist scams and malware.",
      "published": "Tue, 16 Dec 2025 14:14:48 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Microsoft Patch Tuesday, December 2025 Edition",
      "link": "https://krebsonsecurity.com/2025/12/microsoft-patch-tuesday-december-2025-edition/",
      "summary": "Microsoft today pushed updates to fix at least 56 security flaws in its Windows operating systems and supported software. This final Patch Tuesday of 2025 tackles one zero-day bug that is already being exploited, as well as two publicly disclosed vulnerabilities.",
      "published": "Tue, 09 Dec 2025 23:18:29 +0000",
      "value_score": 57,
      "value_signals": [
        "Zero-day",
        "Patch/update ×3",
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "2025 Was a Wake-Up Call to Protect Human Decisions, Not Just Systems",
      "link": "https://www.darkreading.com/cyber-risk/wake-up-call-to-protect-human-decisions-not-just-systems",
      "summary": "Cybersecurity must shift from solely protecting systems to safeguarding human decision-making under uncertainty and system failures.",
      "published": "Sat, 24 Jan 2026 00:55:56 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Swipe, Plug-in, Pwned: Researchers Find New Ways to Hack Vehicles",
      "link": "https://www.darkreading.com/endpoint-security/researchers-find-new-ways-hack-vehicles",
      "summary": "Security researchers exploited dozens of vulnerabilities in vehicle infotainment systems and EV chargers during the latest Pwn2Own contest at Automotive World 2026.",
      "published": "Fri, 23 Jan 2026 21:04:17 GMT",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Exploited Zero-Day Flaw in Cisco UC Could Affect Millions",
      "link": "https://www.darkreading.com/endpoint-security/exploited-zero-day-flaw-cisco-uc-affect-millions",
      "summary": "Mass scanning is underway for CVE-2026-20045, which Cisco tagged as critical because successful exploitation could lead to a complete system takeover.",
      "published": "Fri, 23 Jan 2026 20:56:42 GMT",
      "value_score": 67,
      "value_signals": [
        "CVE mentioned",
        "Zero-day",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Europe's GCVE Raises Concerns Over Fragmentation in Vulnerability Databases",
      "link": "https://www.darkreading.com/cyber-risk/gcve-raises-concerns-fragmentation-vulnerability-database",
      "summary": "GCVE would enhance global collaboration, flexibility, and efficiency in tracking security flaws. Duplicate entries and a decentralization policy may create more chaos for defenders.",
      "published": "Fri, 23 Jan 2026 20:31:58 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Healthy Security Cultures Want People to Report Risks",
      "link": "https://www.darkreading.com/cyber-risk/healthy-security-cultures-thrive-on-risk-reporting",
      "summary": "The signs of an effective security culture are shifting as companies call on CISOs and security teams to raise their hands unabashedly.",
      "published": "Fri, 23 Jan 2026 16:45:35 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Risky Chinese Electric Buses Spark Aussie Gov't Review",
      "link": "https://www.darkreading.com/cyber-risk/chinese-electric-buses-aussie-govt",
      "summary": "Deployed across Australia and Europe, China's electric buses are vulnerable to cybercriminals and sport remote connectivity some worry the Chinese state could exploit.",
      "published": "Thu, 22 Jan 2026 22:13:49 GMT",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Fortinet Firewalls Hit With Malicious Configuration Changes",
      "link": "https://www.darkreading.com/cloud-security/fortinet-firewalls-malicious-configuration-changes",
      "summary": "Automated infections of potentially fully patched FortiGate devices are allowing threat actors to steal firewall configuration files.",
      "published": "Thu, 22 Jan 2026 21:18:42 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "From a Whisper to a Scream: Europe Frets About Overreliance on US Tech",
      "link": "https://www.darkreading.com/cybersecurity-operations/europe-frets-about-overreliance-on-us-tech",
      "summary": "Concern is growing across Europe about relying on US cybersecurity companies, and Greenland takeover talk is eroding trust across the EU even further.",
      "published": "Thu, 22 Jan 2026 18:09:00 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Nike Probing Potential Security Incident as Hackers Threaten to Leak Data",
      "link": "https://www.securityweek.com/nike-probing-potential-security-incident-as-hackers-threaten-to-leak-data/",
      "summary": "The WorldLeaks cybercrime group claims to have stolen information from the footwear and apparel giant’s systems. The post Nike Probing Potential Security Incident as Hackers Threaten to Leak Data appeared first on SecurityWeek .",
      "published": "Sat, 24 Jan 2026 08:45:43 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Security Week",
      "title": "Fortinet Confirms FortiCloud SSO Exploitation Against Patched Devices",
      "link": "https://www.securityweek.com/fortinet-confirms-forticloud-sso-exploitation-against-patched-devices/",
      "summary": "Similar to recent FortiCloud single sign-on (SSO) login vulnerabilities, the attacks bypass authentication. The post Fortinet Confirms FortiCloud SSO Exploitation Against Patched Devices appeared first on SecurityWeek .",
      "published": "Fri, 23 Jan 2026 14:00:07 +0000",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "In Other News: €1.2B GDPR Fines, Net-NTLMv1 Rainbow Tables, Rockwell Security Notice",
      "link": "https://www.securityweek.com/in-other-news-e1-2b-gdpr-fines-net-ntlmv1-rainbow-tables-rockwell-security-notice/",
      "summary": "Other noteworthy stories that might have slipped under the radar: Cloudflare WAF bypass, Canonical Snap Store abused for malware delivery, Curl terminating bug bounty program The post In Other News: €1.2B GDPR Fines, Net-NTLMv1 Rainbow Tables, Rockwell Security Notice appeared first on SecurityWeek .",
      "published": "Fri, 23 Jan 2026 13:53:29 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Phishers Abuse SharePoint in New Campaign Targeting Energy Sector",
      "link": "https://www.securityweek.com/phishers-abuse-sharepoint-in-new-campaign-targeting-energy-sector/",
      "summary": "Threat actors are leveraging the file-sharing service for payload delivery in AitM phishing and BEC attacks. The post Phishers Abuse SharePoint in New Campaign Targeting Energy Sector appeared first on SecurityWeek .",
      "published": "Fri, 23 Jan 2026 13:19:11 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Security Week",
      "title": "Cyber Insights 2026: Regulations and the Tangled Mess of Compliance Requirements",
      "link": "https://www.securityweek.com/cyber-insights-2026-regulations-and-the-tangled-mess-of-compliance-requirements/",
      "summary": "Cyber regulations are where politics meets business – where business becomes subject to political realities. The post Cyber Insights 2026: Regulations and the Tangled Mess of Compliance Requirements appeared first on SecurityWeek .",
      "published": "Fri, 23 Jan 2026 12:30:00 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Under Armour Looking Into Data Breach Affecting Customers’ Email Addresses",
      "link": "https://www.securityweek.com/under-armour-looking-into-data-breach-affecting-customers-email-addresses/",
      "summary": "Under Armour is investigating a recent data breach that purloined customers’ email addresses and other personal information. The post Under Armour Looking Into Data Breach Affecting Customers’ Email Addresses appeared first on SecurityWeek .",
      "published": "Fri, 23 Jan 2026 12:01:18 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×3"
      ]
    },
    {
      "source": "Security Week",
      "title": "Organizations Warned of Exploited Zimbra Collaboration Vulnerability",
      "link": "https://www.securityweek.com/organizations-warned-of-exploited-zimbra-collaboration-vulnerability/",
      "summary": "CISA has added the Zimbra flaw to the KEV catalog along with three other bugs exploited in the wild. The post Organizations Warned of Exploited Zimbra Collaboration Vulnerability appeared first on SecurityWeek .",
      "published": "Fri, 23 Jan 2026 11:47:24 +0000",
      "value_score": 81,
      "value_signals": [
        "Active exploitation",
        "CISA/KEV ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "Infotainment, EV Charger Exploits Earn Hackers $1M at Pwn2Own Automotive 2026",
      "link": "https://www.securityweek.com/infotainment-ev-charger-exploits-earn-hackers-1m-at-pwn2own-automotive-2026/",
      "summary": "Pwn2Own participants disclosed a total of 76 vulnerabilities during the three-day event. The post Infotainment, EV Charger Exploits Earn Hackers $1M at Pwn2Own Automotive 2026 appeared first on SecurityWeek .",
      "published": "Fri, 23 Jan 2026 11:33:22 +0000",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "summary": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "published": "Wed, 31 Aug 2022 12:57:48 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "published": "Tue, 30 Aug 2022 16:00:43 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "published": "Mon, 29 Aug 2022 14:56:19 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "published": "Fri, 26 Aug 2022 16:44:27 +0000",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "published": "Thu, 25 Aug 2022 18:47:15 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Twitter Whistleblower Complaint: The TL;DR Version",
      "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
      "summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk.",
      "published": "Wed, 24 Aug 2022 14:17:04 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
      "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
      "summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP.",
      "published": "Tue, 23 Aug 2022 13:19:58 +0000",
      "value_score": 50,
      "value_signals": [
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Fake Reservation Links Prey on Weary Travelers",
      "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
      "summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels.",
      "published": "Mon, 22 Aug 2022 13:59:06 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/01/23/cisa-adds-one-known-exploited-vulnerability-catalog",
      "summary": "CISA has added one new vulnerability to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2024-37079 Broadcom VMware vCenter Server Out-of-bounds Write Vulnerability This type of vulnerability is a frequent attack vector for malicious cyber actors and poses significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of Known Exploited Vulnerabilities established the KEV Catalog as a living l",
      "published": "Fri, 23 Jan 26 12:00:00 +0000",
      "value_score": 99,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "CISA/KEV ×6",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Product Categories for Technologies That Use Post-Quantum Cryptography Standards",
      "link": "https://www.cisa.gov/resources-tools/resources/product-categories-technologies-use-post-quantum-cryptography-standards",
      "summary": "Executive Summary In response to the June 6, 2025, Executive Order (EO) 14306, “Sustaining Select Efforts to Strengthen the Nation’s Cybersecurity and Amending Executive Order 13694 and Executive Order 14144,” the Cybersecurity and Infrastructure Security Agency (CISA) is providing and regularly updating the below lists to aid in post-quantum cryptography (PQC) adoption. The lists include hardware and software categories with example types of widely available products that use PQC standards to p",
      "published": "Fri, 23 Jan 26 12:00:00 +0000",
      "value_score": 55,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CISA/KEV"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Schneider Electric EcoStruxure Process Expert",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-022-01",
      "summary": "View CSAF Summary Schneider Electric is aware of a vulnerability in its EcoStruxureTM Process and EcoStruxure™ Process Expert for AVEVA System Platform products. The EcoStruxureTM Process is a single automation system to engineer, operate, and maintain your entire infrastructure for a sustainable, productive and market-agile plant. The EcoStruxure™ Process Expert for AVEVA System Platform product enables users to achieve operational profitability from design engineering to meeting the demands of",
      "published": "Thu, 22 Jan 26 12:00:00 +0000",
      "value_score": 35,
      "value_signals": [
        "Source boost: CISA Alerts"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "EVMAPA",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-022-08",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could lead to degraded service, a denial-of-service, or unauthorized remote command execution, which could lead to spoofing or a manipulation of charging station statuses. The following versions of EVMAPA are affected: EVMAPA (CVE-2025-54816, CVE-2025-53968, CVE-2025-55705) CVSS Vendor Equipment Vulnerabilities v3 9.4 EVMAPA EVMAPA Missing Authentication for Critical Function, Improper Restriction of Excessive Authentication Atte",
      "published": "Thu, 22 Jan 26 12:00:00 +0000",
      "value_score": 97,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×3",
        "High severity",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Rockwell Automation CompactLogix 5370",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-022-03",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an attacker to cause a denial-of-service condition. The following versions of Rockwell Automation CompactLogix 5370 are affected: CompactLogix 5370 (CVE-2025-11743) CompactLogix 5370 (CVE-2025-11743) CompactLogix 5370 (CVE-2025-11743) CVSS Vendor Equipment Vulnerabilities v3 6.5 Rockwell Automation Rockwell Automation CompactLogix 5370 Improper Validation of Specified Quantity in Input Background Critical Infrastructure ",
      "published": "Thu, 22 Jan 26 12:00:00 +0000",
      "value_score": 97,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×3",
        "High severity",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds Four Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/01/22/cisa-adds-four-known-exploited-vulnerabilities-catalog",
      "summary": "CISA has added four new vulnerabilities to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2025-31125 Vite Vitejs Improper Access Control Vulnerability CVE-2025-34026 Versa Concerto Improper Authentication Vulnerability CVE-2025-54313 Prettier eslint-config-prettier Embedded Malicious Code Vulnerability CVE-2025-68645 Synacor Zimbra Collaboration Suite (ZCS) PHP Remote File Inclusion Vulnerability These types of vulnerabilities are frequent attac",
      "published": "Thu, 22 Jan 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "CISA/KEV ×5",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Delta Electronics DIAView",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-022-07",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could enable an attacker to execute arbitrary code. The following versions of Delta Electronics DIAView are affected: DIAView (CVE-2026-0975) CVSS Vendor Equipment Vulnerabilities v3 7.8 Delta Electronics Delta Electronics DIAView Improper Neutralization of Special Elements used in a Command ('Command Injection') Background Critical Infrastructure Sectors: Chemical, Commercial Facilities, Critical Manufacturing, Energy, Transportati",
      "published": "Thu, 22 Jan 26 12:00:00 +0000",
      "value_score": 75,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Johnson Controls Inc. iSTAR Configuration Utility (ICU) tool",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-022-04",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an attacker to cause a failure within the operating system of the machine hosting the ICU tool. The following versions of Johnson Controls Inc. iSTAR Configuration Utility (ICU) tool are affected: iSTAR Configuration Utility (ICU) tool (CVE-2025-26386) CVSS Vendor Equipment Vulnerabilities v3 7.1 Johnson Controls Inc. Johnson Controls Inc. iSTAR Configuration Utility (ICU) tool Stack-based Buffer Overflow Background Crit",
      "published": "Thu, 22 Jan 26 12:00:00 +0000",
      "value_score": 59,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "Exploit wording"
      ]
    }
  ],
  "sources": [
    "The Hacker News",
    "BleepingComputer",
    "Krebs on Security",
    "Dark Reading",
    "Security Week",
    "Naked Security",
    "Threatpost",
    "CISA Alerts"
  ]
}