{
  "last_updated": "2026-01-14 18:27",
  "sources_count": 8,
  "articles_count": 56,
  "keywords": [
    "malicious cyber actors",
    "windows operating systems",
    "twitter whistleblower complaint",
    "sprawling phishing campaign",
    "cvss scoring system",
    "china chinese cyberattacks",
    "microsoft licensing data",
    "detection technology will",
    "exfiltrate sensitive data",
    "internal network behind",
    "114 flaws eight",
    "buy seraphic security",
    "vulnerabilities earned microsoft's",
    "core windows component",
    "today we'll dig",
    "strong theme running",
    "stack space exhaustion",
    "scoops nestled inside",
    "restrict free speech",
    "resources without limits"
  ],
  "trending": [
    {
      "keyword": "malicious cyber actors",
      "mentions": 170
    },
    {
      "keyword": "windows operating systems",
      "mentions": 79
    },
    {
      "keyword": "twitter whistleblower complaint",
      "mentions": 339
    },
    {
      "keyword": "sprawling phishing campaign",
      "mentions": 60
    },
    {
      "keyword": "cvss scoring system",
      "mentions": 36
    },
    {
      "keyword": "china chinese cyberattacks",
      "mentions": 9
    },
    {
      "keyword": "microsoft licensing data",
      "mentions": 2
    },
    {
      "keyword": "detection technology will",
      "mentions": 1
    },
    {
      "keyword": "exfiltrate sensitive data",
      "mentions": 2
    },
    {
      "keyword": "internal network behind",
      "mentions": 60
    }
  ],
  "articles": [
    {
      "source": "The Hacker News",
      "title": "AI Agents Are Becoming Privilege Escalation Paths",
      "link": "https://thehackernews.com/2026/01/ai-agents-are-becoming-privilege.html",
      "summary": "AI agents have quickly moved from experimental tools to core components of daily workflows across security, engineering, IT, and operations. What began as individual productivity aids, like personal code assistants, chatbots, and copilots, has evolved into shared, organization-wide agents embedded in critical processes. These agents can orchestrate workflows across multiple systems, for example:",
      "published": "Wed, 14 Jan 2026 20:37:00 +0530",
      "value_score": 30,
      "value_signals": [
        "Privilege escalation",
        "High severity"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Hackers Exploit c-ares DLL Side-Loading to Bypass Security and Deploy Malware",
      "link": "https://thehackernews.com/2026/01/hackers-exploit-c-ares-dll-side-loading.html",
      "summary": "Security experts have disclosed details of an active malware campaign that's exploiting a DLL side-loading vulnerability in a legitimate binary associated with the open-source c-ares library to bypass security controls and deliver a wide range of commodity trojans and stealers. \"Attackers achieve evasion by pairing a malicious libcares-2.dll with any signed version of the legitimate ahost.exe (",
      "published": "Wed, 14 Jan 2026 19:48:00 +0530",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Fortinet Fixes Critical FortiSIEM Flaw Allowing Unauthenticated Remote Code Execution",
      "link": "https://thehackernews.com/2026/01/fortinet-fixes-critical-fortisiem-flaw.html",
      "summary": "Fortinet has released updates to fix a critical security flaw impacting FortiSIEM that could allow an unauthenticated attacker to achieve code execution on susceptible instances. The operating system (OS) injection vulnerability, tracked as CVE-2025-64155, is rated 9.4 out of 10.0 on the CVSS scoring system. \"An improper neutralization of special elements used in an OS command ('OS command",
      "published": "Wed, 14 Jan 2026 17:23:00 +0530",
      "value_score": 72,
      "value_signals": [
        "CVE mentioned",
        "RCE",
        "Patch/update",
        "High severity ×2"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "New Research: 64% of 3rd-Party Applications Access Sensitive Data Without Justification",
      "link": "https://thehackernews.com/2026/01/new-research-64-of-3rd-party.html",
      "summary": "Research analyzing 4,700 leading websites reveals that 64% of third-party applications now access sensitive data without business justification, up from 51% in 2024. Government sector malicious activity spiked from 2% to 12.9%, while 1 in 7 Education sites show active compromise. Specific offenders: Google Tag Manager (8% of violations), Shopify (5%), Facebook Pixel (4%). Download the",
      "published": "Wed, 14 Jan 2026 16:30:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Microsoft Fixes 114 Windows Flaws in January 2026 Patch, One Actively Exploited",
      "link": "https://thehackernews.com/2026/01/microsoft-fixes-114-windows-flaws-in.html",
      "summary": "Microsoft on Tuesday rolled out its first security update for 2026, addressing 114 security flaws, including one vulnerability that it said has been actively exploited in the wild. Of the 114 flaws, eight are rated Critical, and 106 are rated Important in severity. As many as 58 vulnerabilities have been classified as privilege escalation, followed by 22 information disclosure, 21 remote code",
      "published": "Wed, 14 Jan 2026 15:08:00 +0530",
      "value_score": 100,
      "value_signals": [
        "Active exploitation ×3",
        "Privilege escalation",
        "Patch/update ×2",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Critical Node.js Vulnerability Can Cause Server Crashes via async_hooks Stack Overflow",
      "link": "https://thehackernews.com/2026/01/critical-nodejs-vulnerability-can-cause.html",
      "summary": "Node.js has released updates to fix what it described as a critical security issue impacting \"virtually every production Node.js app\" that, if successfully exploited, could trigger a denial-of-service (DoS) condition. \"Node.js/V8 makes a best-effort attempt to recover from stack space exhaustion with a catchable error, which frameworks have come to rely on for service availability,\" Node.js's",
      "published": "Wed, 14 Jan 2026 12:35:00 +0530",
      "value_score": 40,
      "value_signals": [
        "Patch/update",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "PLUGGYAPE Malware Uses Signal and WhatsApp to Target Ukrainian Defense Forces",
      "link": "https://thehackernews.com/2026/01/pluggyape-malware-uses-signal-and.html",
      "summary": "The Computer Emergency Response Team of Ukraine (CERT-UA) has disclosed details of new cyber attacks targeting its defense forces with malware known as PLUGGYAPE between October and December 2025. The activity has been attributed with medium confidence to a Russian hacking group tracked as Void Blizzard (aka Laundry Bear or UAC-0190). The threat actor is believed to be active since at least",
      "published": "Wed, 14 Jan 2026 11:18:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Long-Running Web Skimming Campaign Steals Credit Cards From Online Checkout Pages",
      "link": "https://thehackernews.com/2026/01/long-running-web-skimming-campaign.html",
      "summary": "Cybersecurity researchers have discovered a major web skimming campaign that has been active since January 2022, targeting several major payment networks like American Express, Diners Club, Discover, JCB Co., Ltd., Mastercard, and UnionPay. \"Enterprise organizations that are clients of these payment providers are the most likely to be impacted,\" Silent Push said in a report published today.",
      "published": "Tue, 13 Jan 2026 23:00:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Verizon Wireless outage puts phones in SOS mode without cell service",
      "link": "https://www.bleepingcomputer.com/news/mobile/verizon-wireless-outage-puts-phones-in-sos-mode-without-cell-service/",
      "summary": "Verizon Wireless is suffering a massive outage in the US, with customers reporting their phones stuck in SOS mode with no cellular service. [...]",
      "published": "Wed, 14 Jan 2026 13:27:25 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft updates Windows DLL that triggered security alerts",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-updates-windows-dll-that-triggered-security-alerts/",
      "summary": "Microsoft has resolved a known issue that was causing security applications to incorrectly flag a core Windows component, the company said in a service alert posted this week. [...]",
      "published": "Wed, 14 Jan 2026 11:44:09 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "ConsentFix debrief: Insights from the new OAuth phishing attack",
      "link": "https://www.bleepingcomputer.com/news/security/consentfix-debrief-insights-from-the-new-oauth-phishing-attack/",
      "summary": "ConsentFix is an OAuth phishing technique abusing browser-based authorization flows to hijack Microsoft accounts. Push Security shares new insights from continued tracking, community research, and evolving attacker techniques. [...]",
      "published": "Wed, 14 Jan 2026 10:01:11 -0500",
      "value_score": 26,
      "value_signals": [
        "Phishing ×2"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Reprompt attack hijacked Microsoft Copilot sessions for data theft",
      "link": "https://www.bleepingcomputer.com/news/security/reprompt-attack-let-hackers-hijack-microsoft-copilot-sessions/",
      "summary": "Researchers identified an attack method dubbed \"Reprompt\" that could allow attackers to infiltrate a user's Microsoft Copilot session and issue commands to exfiltrate sensitive data. [...]",
      "published": "Wed, 14 Jan 2026 09:00:00 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Cloud marketplace Pax8 accidentally exposes data on 1,800 MSP partners",
      "link": "https://www.bleepingcomputer.com/news/security/cloud-marketplace-pax8-accidentally-exposes-data-on-1-800-msp-partners/",
      "summary": "Cloud marketplace and distributor Pax8 has confirmed that it mistakenly sent an email to fewer than 40 UK-based partners containing a spreadsheet with internal business information, including MSP customer and Microsoft licensing data. [...]",
      "published": "Wed, 14 Jan 2026 07:01:07 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Victorian Department of Education says hackers stole students’ data",
      "link": "https://www.bleepingcomputer.com/news/security/victorian-department-of-education-notifies-parents-of-data-breach/",
      "summary": "The Department of Education in Victoria, Australia, notified parents that attackers gained access to a database containing the personal information of current and former students. [...]",
      "published": "Wed, 14 Jan 2026 06:44:56 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft: Windows 365 update blocks access to Cloud PC sessions",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-365-update-blocks-access-to-cloud-pc-sessions/",
      "summary": "Microsoft confirmed that a recent Windows 365 update is blocking customers from accessing their Microsoft 365 Cloud PC sessions. [...]",
      "published": "Wed, 14 Jan 2026 04:55:06 -0500",
      "value_score": 26,
      "value_signals": [
        "Patch/update ×2"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Monroe University says 2024 data breach affects 320,000 people",
      "link": "https://www.bleepingcomputer.com/news/security/monroe-university-says-2024-data-breach-affects-320-000-people/",
      "summary": "Monroe University revealed that threat actors stole the personal, financial, and health information of over 320,000 people after breaching its systems in a December 2024 cyberattack. [...]",
      "published": "Wed, 14 Jan 2026 03:57:00 -0500",
      "value_score": 22,
      "value_signals": [
        "Breach/leak"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, January 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "published": "Wed, 14 Jan 2026 00:47:38 +0000",
      "value_score": 40,
      "value_signals": [
        "Patch/update ×2",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Who Benefited from the Aisuru and Kimwolf Botnets?",
      "link": "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
      "summary": "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we'll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf's spread.",
      "published": "Thu, 08 Jan 2026 23:23:43 +0000",
      "value_score": 20,
      "value_signals": [
        "Botnet"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "The Kimwolf Botnet is Stalking Your Local Network",
      "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
      "summary": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.",
      "published": "Fri, 02 Jan 2026 14:20:10 +0000",
      "value_score": 26,
      "value_signals": [
        "Botnet",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Happy 16th Birthday, KrebsOnSecurity.com!",
      "link": "https://krebsonsecurity.com/2025/12/happy-16th-birthday-krebsonsecurity-com/",
      "summary": "KrebsOnSecurity.com celebrates its 16th anniversary today! A huge \"thank you\" to all of our readers -- newcomers, long-timers and drive-by critics alike. Your engagement this past year here has been tremendous and truly a salve on a handful of dark days. Happily, comeuppance was a strong theme running through our coverage in 2025, with a primary focus on entities that enabled complex and globally-dispersed cybercrime services.",
      "published": "Mon, 29 Dec 2025 20:23:26 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Dismantling Defenses: Trump 2.0 Cyber Year in Review",
      "link": "https://krebsonsecurity.com/2025/12/dismantling-defenses-trump-2-0-cyber-year-in-review/",
      "summary": "The Trump administration has pursued a staggering range of policy pivots this past year that threaten to weaken the nation’s ability and willingness to address a broad spectrum of technology challenges, from cybersecurity and privacy to countering disinformation, fraud and corruption. These shifts, along with the president’s efforts to restrict free speech and freedom of the press, have come at such a rapid clip that many readers probably aren’t even aware of them all.",
      "published": "Fri, 19 Dec 2025 15:14:55 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Most Parked Domains Now Serving Malicious Content",
      "link": "https://krebsonsecurity.com/2025/12/most-parked-domains-now-serving-malicious-content/",
      "summary": "Direct navigation -- the act of visiting a website by manually typing a domain name in a web browser -- has never been riskier: A new study finds the vast majority of \"parked\" domains -- mostly expired or dormant domain names, or common misspellings of popular websites -- are now configured to redirect visitors to sites that foist scams and malware.",
      "published": "Tue, 16 Dec 2025 14:14:48 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Microsoft Patch Tuesday, December 2025 Edition",
      "link": "https://krebsonsecurity.com/2025/12/microsoft-patch-tuesday-december-2025-edition/",
      "summary": "Microsoft today pushed updates to fix at least 56 security flaws in its Windows operating systems and supported software. This final Patch Tuesday of 2025 tackles one zero-day bug that is already being exploited, as well as two publicly disclosed vulnerabilities.",
      "published": "Tue, 09 Dec 2025 23:18:29 +0000",
      "value_score": 57,
      "value_signals": [
        "Zero-day",
        "Patch/update ×3",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Drones to Diplomas: How Russia’s Largest Private University is Linked to a $25M Essay Mill",
      "link": "https://krebsonsecurity.com/2025/12/drones-to-diplomas-how-russias-largest-private-university-is-linked-to-a-25m-essay-mill/",
      "summary": "A sprawling academic cheating network turbocharged by Google Ads that has generated nearly $25 million in revenue has curious connections to a Kremlin-connected oligarch whose Russian university builds drones for Russia's war against Ukraine.",
      "published": "Sat, 06 Dec 2025 14:45:03 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Secure Your Spot at RSAC 2026 Conference",
      "link": "https://www.darkreading.com/events/rsac-2026-conference",
      "summary": "",
      "published": "2026-03-23T11:00:00.000Z",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "'VoidLink' Malware Poses Advanced Threat to Linux Systems",
      "link": "https://www.darkreading.com/cloud-security/voidlink-malware-advanced-threat-linux-systems",
      "summary": "Researchers discovered a modular, \"cloud-first\" framework that is feature-rich and designed to maintain stealthy, long-term access to Linux environments.",
      "published": "Wed, 14 Jan 2026 15:59:49 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Taiwan Endures Greater Cyber Pressure From China",
      "link": "https://www.darkreading.com/cyber-risk/taiwan-sees-greater-cyber-pressure-from-china",
      "summary": "Chinese cyberattacks on Taiwan's critical infrastructure — including energy utilities and hospitals — rose 6% in 2025, averaging 2.63 million attacks a day.",
      "published": "Wed, 14 Jan 2026 02:00:00 GMT",
      "value_score": 18,
      "value_signals": [
        "High severity"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "CrowdStrike to Buy Seraphic Security in Bid to Boost Browser Security",
      "link": "https://www.darkreading.com/remote-workforce/crowdstrike-buy-seraphic-security-boost-browser-security",
      "summary": "The browser protection and detection technology will be integrated into CrowdStrike's Falcon platform to protect endpoints, browser sessions, and cloud applications.",
      "published": "Tue, 13 Jan 2026 23:59:37 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "CISO Succession Crisis Highlights How Turnover Amplifies Security Risks",
      "link": "https://www.darkreading.com/cyber-risk/ciso-succession-crisis-highlights-turnover-amplifies-security-risks",
      "summary": "When cybersecurity leadership turns over too fast, risk does not reset. It compounds.",
      "published": "Tue, 13 Jan 2026 23:45:27 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "'Most Severe AI Vulnerability to Date' Hits ServiceNow",
      "link": "https://www.darkreading.com/remote-workforce/ai-vulnerability-servicenow",
      "summary": "ServiceNow tacked agentic AI onto a largely unguarded legacy chatbot, exposing customers' data and connected systems.",
      "published": "Tue, 13 Jan 2026 21:44:48 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Microsoft Starts 2026 With a Bang: A Freshly Exploited Zero-Day",
      "link": "https://www.darkreading.com/application-security/microsofts-starts-2026-bang-zero-day",
      "summary": "The vendor's first Patch Tuesday of the year also contains fixes for 112 CVEs, nearly double the amount from last month.",
      "published": "Tue, 13 Jan 2026 21:11:37 GMT",
      "value_score": 49,
      "value_signals": [
        "Zero-day",
        "Patch/update",
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Shadow#Reactor Uses Text Files to Deliver Remcos RAT",
      "link": "https://www.darkreading.com/endpoint-security/shadow-reactor-uses-text-files-to-deliver-remcos-rat",
      "summary": "Attackers use a sophisticated delivery mechanism of text-only files for RAT deployment, showcasing a clever way to bypass defensive tools and rely on the target's own utilities.",
      "published": "Tue, 13 Jan 2026 17:46:57 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Aikido Security Raises $60 Million at $1 Billion Valuation",
      "link": "https://www.securityweek.com/aikido-security-raises-60-million-at-1-billion-valuation/",
      "summary": "The developer security company has raised a total of more than $84 million in funding. The post Aikido Security Raises $60 Million at $1 Billion Valuation appeared first on SecurityWeek .",
      "published": "Wed, 14 Jan 2026 18:01:10 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Investor Lawsuit Over CrowdStrike Outage Dismissed",
      "link": "https://www.securityweek.com/investor-lawsuit-over-crowdstrike-outage-dismissed/",
      "summary": "A judge has ruled that the plaintiffs failed to demonstrate intent to defraud investors. The post Investor Lawsuit Over CrowdStrike Outage Dismissed appeared first on SecurityWeek .",
      "published": "Wed, 14 Jan 2026 17:13:03 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "RedVDS Cybercrime Service Disrupted by Microsoft and Law Enforcement",
      "link": "https://www.securityweek.com/redvds-cybercrime-service-disrupted-by-microsoft-and-law-enforcement/",
      "summary": "RedVDS enables threat actors to set up servers that can be used for phishing, BEC attacks, account takeover, and fraud. The post RedVDS Cybercrime Service Disrupted by Microsoft and Law Enforcement appeared first on SecurityWeek .",
      "published": "Wed, 14 Jan 2026 15:00:00 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Security Week",
      "title": "Predator Spyware Turns Failed Attacks Into Intelligence for Future Exploits",
      "link": "https://www.securityweek.com/predator-spywares-granular-anti-analysis-features-exposed/",
      "summary": "The Predator spyware is more sophisticated and dangerous than previously realized. The post Predator Spyware Turns Failed Attacks Into Intelligence for Future Exploits appeared first on SecurityWeek .",
      "published": "Wed, 14 Jan 2026 14:00:00 +0000",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "Novee Emerges From Stealth With $51.5 Million in Funding",
      "link": "https://www.securityweek.com/novee-emerges-from-stealth-with-51-5-million-in-funding/",
      "summary": "Novee provides continuous AI-driven penetration testing to uncover and address novel vulnerabilities. The post Novee Emerges From Stealth With $51.5 Million in Funding appeared first on SecurityWeek .",
      "published": "Wed, 14 Jan 2026 13:15:35 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "WitnessAI Raises $58 Million for AI Security Platform",
      "link": "https://www.securityweek.com/witnessai-raises-58-million-for-ai-security-platform/",
      "summary": "The company will use the fresh investment to accelerate its global go-to-market and product expansion. The post WitnessAI Raises $58 Million for AI Security Platform appeared first on SecurityWeek .",
      "published": "Wed, 14 Jan 2026 11:49:40 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Robo-Advisor Betterment Discloses Data Breach",
      "link": "https://www.securityweek.com/robo-advisor-betterment-discloses-data-breach/",
      "summary": "A threat actor breached Betterment’s systems, accessed customer information, and sent scam crypto-related messages. The post Robo-Advisor Betterment Discloses Data Breach appeared first on SecurityWeek .",
      "published": "Wed, 14 Jan 2026 10:50:45 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Security Week",
      "title": "Fortinet Patches Critical Vulnerabilities in FortiFone, FortiSIEM",
      "link": "https://www.securityweek.com/fortinet-patches-critical-vulnerabilities-in-fortifone-fortisiem/",
      "summary": "Exploitable without authentication, the two security defects could lead to configuration leak and code execution. The post Fortinet Patches Critical Vulnerabilities in FortiFone, FortiSIEM appeared first on SecurityWeek .",
      "published": "Wed, 14 Jan 2026 09:56:38 +0000",
      "value_score": 44,
      "value_signals": [
        "Breach/leak",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "summary": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "published": "Wed, 31 Aug 2022 12:57:48 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "published": "Tue, 30 Aug 2022 16:00:43 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "published": "Mon, 29 Aug 2022 14:56:19 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "published": "Fri, 26 Aug 2022 16:44:27 +0000",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "published": "Thu, 25 Aug 2022 18:47:15 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Twitter Whistleblower Complaint: The TL;DR Version",
      "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
      "summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk.",
      "published": "Wed, 24 Aug 2022 14:17:04 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
      "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
      "summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP.",
      "published": "Tue, 23 Aug 2022 13:19:58 +0000",
      "value_score": 50,
      "value_signals": [
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Fake Reservation Links Prey on Weary Travelers",
      "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
      "summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels.",
      "published": "Mon, 22 Aug 2022 13:59:06 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "CISA Alerts",
      "title": "Secure Connectivity Principles for Operational Technology (OT)",
      "link": "https://www.cisa.gov/resources-tools/resources/secure-connectivity-principles-operational-technology-ot",
      "summary": "CISA and the UK National Cyber Security Centre (NCSC-UK), in collaboration with federal and international partners, have released Secure Connectivity Principles for Operational Technology (OT) guidance to help asset owners address increasing business and regulatory pressures for connectivity into operational technology (OT) networks. This guidance outlines eight principles to use as a framework to design, secure, and manage connectivity into OT environments. These principles are particularly cri",
      "published": "Wed, 14 Jan 26 12:00:00 +0000",
      "value_score": 55,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CISA/KEV"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Rockwell Automation 432ES-IG3 Series A",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-013-01",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could result in a denial-of-service condition. The following versions of Rockwell Automation 432ES-IG3 Series A are affected: 432ES-IG3 Series A (CVE-2025-9368) CVSS Vendor Equipment Vulnerabilities v3 7.5 Rockwell Automation Rockwell Automation 432ES-IG3 Series A Allocation of Resources Without Limits or Throttling Background Critical Infrastructure Sectors: Critical Manufacturing Countries/Areas Deployed: Worldwide Company Headqua",
      "published": "Tue, 13 Jan 26 12:00:00 +0000",
      "value_score": 75,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Rockwell Automation FactoryTalk DataMosaix Private Cloud",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-013-02",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an attacker to perform unauthorized sensitive database operations. The following versions of Rockwell Automation FactoryTalk DataMosaix Private Cloud are affected: FactoryTalk DataMosaix Private Cloud (CVE-2025-12807) FactoryTalk DataMosaix Private Cloud (CVE-2025-12807) FactoryTalk DataMosaix Private Cloud (CVE-2025-12807) CVSS Vendor Equipment Vulnerabilities v3 8.8 Rockwell Automation Rockwell Automation FactoryTalk D",
      "published": "Tue, 13 Jan 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×3",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/01/13/cisa-adds-one-known-exploited-vulnerability-catalog",
      "summary": "CISA has added one new vulnerability to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2026-20805 Microsoft Windows Information Disclosure Vulnerability This type of vulnerability is a frequent attack vector for malicious cyber actors and poses significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of Known Exploited Vulnerabilities established the KEV Catalog as a living list of kno",
      "published": "Tue, 13 Jan 26 12:00:00 +0000",
      "value_score": 99,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "CISA/KEV ×6",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "YoSmart YoLink Smart Hub",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-013-03",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could allow an attacker to remotely control other users' smart home devices, intercept sensitive data, and hijack sessions. The following versions of YoSmart YoLink Smart Hub are affected: YoSmart server (CVE-2025-59449, CVE-2025-59451) YoLink Smart Hub (CVE-2025-59452) YoLink Mobile Appication (CVE-2025-59448) CVSS Vendor Equipment Vulnerabilities v3 5.8 YoSmart YoSmart YoLink Smart Hub Incorrect Authorization, Generation of Pre",
      "published": "Tue, 13 Jan 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/01/12/cisa-adds-one-known-exploited-vulnerability-catalog",
      "summary": "CISA has added one new vulnerability to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2025-8110 Gogs Path Traversal Vulnerability This type of vulnerability is a frequent attack vector for malicious cyber actors and poses significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of Known Exploited Vulnerabilities established the KEV Catalog as a living list of known Common Vulnerabilit",
      "published": "Mon, 12 Jan 26 12:00:00 +0000",
      "value_score": 99,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "CISA/KEV ×6",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Hitachi Energy Asset Suite",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-008-01",
      "summary": "View CSAF Summary Hitachi Energy is aware of a Jasper Report vulnerability that affects the Asset Suite product versions mentioned in this document below. This vulnerability can be exploited to carry out remote code execution (RCE) attack on the product. Please refer to the Recommended Immediate Actions for information about the mitigation/remediation. The following versions of Hitachi Energy Asset Suite are affected: Asset Suite (CVE-2025-10492) CVSS Vendor Equipment Vulnerabilities v3 9.8 Hita",
      "published": "Thu, 08 Jan 26 12:00:00 +0000",
      "value_score": 99,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "RCE ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds Two Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/01/07/cisa-adds-two-known-exploited-vulnerabilities-catalog",
      "summary": "CISA has added two new vulnerabilities to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2009-0556 Microsoft Office PowerPoint Code Injection Vulnerability CVE-2025-37164 HPE OneView Code Injection Vulnerability These types of vulnerabilities are frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of Known Exploited Vulne",
      "published": "Wed, 07 Jan 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "CISA/KEV ×5",
        "Multiple CVEs",
        "Exploit wording"
      ]
    }
  ],
  "sources": [
    "The Hacker News",
    "BleepingComputer",
    "Krebs on Security",
    "Dark Reading",
    "Security Week",
    "Naked Security",
    "Threatpost",
    "CISA Alerts"
  ]
}