{
  "last_updated": "2026-02-28 18:26",
  "sources_count": 8,
  "articles_count": 56,
  "keywords": [
    "scattered lapsus shinyhunters",
    "badbox 2 0",
    "mobility46 mobility46 se",
    "ev2go ev2go io",
    "cloudcharge cloudcharge se",
    "bypass authentication cause",
    "61 million worth",
    "third party patching",
    "gain unauthorized access",
    "anthropic technology openai",
    "windows operating systems",
    "twitter whistleblower complaint",
    "prefix aiza embedded",
    "fake identification documents",
    "claude won t",
    "chargemap chargemap com",
    "uses zoho workdrive",
    "uses removable media",
    "50 security holes",
    "cryptocurrency investment scams"
  ],
  "trending": [
    {
      "keyword": "scattered lapsus shinyhunters",
      "mentions": 219
    },
    {
      "keyword": "badbox 2 0",
      "mentions": 250
    },
    {
      "keyword": "mobility46 mobility46 se",
      "mentions": 24
    },
    {
      "keyword": "ev2go ev2go io",
      "mentions": 24
    },
    {
      "keyword": "cloudcharge cloudcharge se",
      "mentions": 24
    },
    {
      "keyword": "bypass authentication cause",
      "mentions": 16
    },
    {
      "keyword": "61 million worth",
      "mentions": 12
    },
    {
      "keyword": "third party patching",
      "mentions": 14
    },
    {
      "keyword": "gain unauthorized access",
      "mentions": 24
    },
    {
      "keyword": "anthropic technology openai",
      "mentions": 11
    }
  ],
  "articles": [
    {
      "source": "The Hacker News",
      "title": "ClawJacked Flaw Lets Malicious Sites Hijack Local OpenClaw AI Agents via WebSocket",
      "link": "https://thehackernews.com/2026/02/clawjacked-flaw-lets-malicious-sites.html",
      "summary": "OpenClaw has fixed a high-severity security issue that, if successfully exploited, could have allowed a malicious website to connect to a locally running artificial intelligence (AI) agent and take over control. \"Our vulnerability lives in the core system itself – no plugins, no marketplace, no user-installed extensions – just the bare OpenClaw gateway, running exactly as documented,\" Oasis",
      "published": "Sat, 28 Feb 2026 22:51:00 +0530",
      "value_score": 24,
      "value_signals": [
        "Patch/update",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Thousands of Public Google Cloud API Keys Exposed with Gemini Access After API Enablement",
      "link": "https://thehackernews.com/2026/02/thousands-of-public-google-cloud-api.html",
      "summary": "New research has found that Google Cloud API keys, typically designated as project identifiers for billing purposes, could be abused to authenticate to sensitive Gemini endpoints and access private data. The findings come from Truffle Security, which discovered nearly 3,000 Google API keys (identified by the prefix \"AIza\") embedded in client-side code to provide Google-related services like",
      "published": "Sat, 28 Feb 2026 15:26:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Pentagon Designates Anthropic Supply Chain Risk Over AI Military Dispute",
      "link": "https://thehackernews.com/2026/02/pentagon-designates-anthropic-supply.html",
      "summary": "Anthropic on Friday hit back after U.S. Secretary of Defense Pete Hegseth directed the Pentagon to designate the artificial intelligence (AI) upstart as a \"supply chain risk.\" \"This action follows months of negotiations that reached an impasse over two exceptions we requested to the lawful use of our AI model, Claude: the mass domestic surveillance of Americans and fully autonomous weapons,\" the",
      "published": "Sat, 28 Feb 2026 10:27:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "DoJ Seizes $61 Million in Tether Linked to Pig Butchering Crypto Scams",
      "link": "https://thehackernews.com/2026/02/doj-seizes-61-million-in-tether-linked.html",
      "summary": "The U.S. Department of Justice (DoJ) this week announced the seizure of $61 million worth of Tether that were allegedly associated with bogus cryptocurrency schemes known as pig butchering. The confiscated funds were traced to cryptocurrency addresses used for the laundering of criminally derived proceeds stolen from victims of cryptocurrency investment scams, the department added. \"Criminal",
      "published": "Fri, 27 Feb 2026 23:41:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "900+ Sangoma FreePBX Instances Compromised in Ongoing Web Shell Attacks",
      "link": "https://thehackernews.com/2026/02/900-sangoma-freepbx-instances.html",
      "summary": "The Shadowserver Foundation has revealed that over 900 Sangoma FreePBX instances still remain infected with web shells as part of attacks that exploited a command injection vulnerability starting in December 2025. Of these, 401 instances are located in the U.S., followed by 51 in Brazil, 43 in Canada, 40 in Germany, and 36 in France. The non-profit entity said the compromises are likely",
      "published": "Fri, 27 Feb 2026 23:29:00 +0530",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Malicious Go Crypto Module Steals Passwords, Deploys Rekoobe Backdoor",
      "link": "https://thehackernews.com/2026/02/malicious-go-crypto-module-steals.html",
      "summary": "Cybersecurity researchers have disclosed details of a malicious Go module that's designed to harvest passwords, create persistent access via SSH, and deliver a Linux backdoor named Rekoobe. The Go module, github[.]com/xinfeisoft/crypto, impersonates the legitimate \"golang.org/x/crypto\" codebase, but injects malicious code that's responsible for exfiltrating secrets entered via terminal password",
      "published": "Fri, 27 Feb 2026 21:03:00 +0530",
      "value_score": 34,
      "value_signals": [
        "Backdoor ×2"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "ScarCruft Uses Zoho WorkDrive and USB Malware to Breach Air-Gapped Networks",
      "link": "https://thehackernews.com/2026/02/scarcruft-uses-zoho-workdrive-and-usb.html",
      "summary": "The North Korean threat actor known as ScarCruft has been attributed to a fresh set of tools, including a backdoor that uses Zoho WorkDrive for command-and-control (C2) communications to fetch more payloads and an implant that uses removable media to relay commands and breach air-gapped networks. The campaign, codenamed Ruby Jumper by Zscaler ThreatLabz, involves the deployment of malware",
      "published": "Fri, 27 Feb 2026 18:13:00 +0530",
      "value_score": 46,
      "value_signals": [
        "Breach/leak ×2",
        "Backdoor"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Trojanized Gaming Tools Spread Java-Based RAT via Browser and Chat Platforms",
      "link": "https://thehackernews.com/2026/02/trojanized-gaming-tools-spread-java.html",
      "summary": "Threat actors are luring unsuspecting users into running trojanized gaming utilities that are distributed via browsers and chat platforms to distribute a remote access trojan (RAT). \"A malicious downloader staged a portable Java runtime and executed a malicious Java archive (JAR) file named jd-gui.jar,\" the Microsoft Threat Intelligence team said in a post on X. \"This downloader used PowerShell",
      "published": "Fri, 27 Feb 2026 15:36:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "$4.8M in crypto stolen after Korean tax agency exposes wallet seed",
      "link": "https://www.bleepingcomputer.com/news/security/48m-in-crypto-stolen-after-korean-tax-agency-exposes-wallet-seed/",
      "summary": "South Korea's National Tax Service accidentally exposed the mnemonic recovery phrase of a seized cryptocurrency wallet in an official press release, allowing hackers to steal 6.4 billion won ($4.8M) worth in cryptocurrency. [...]",
      "published": "Sat, 28 Feb 2026 10:17:23 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft testing Windows 11 batch file security improvements",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-testing-windows-11-batch-file-security-improvements/",
      "summary": "Microsoft is rolling out new Windows 11 Insider Preview builds that improve security and performance during batch file or CMD script execution. [...]",
      "published": "Fri, 27 Feb 2026 15:00:27 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "APT37 hackers use new malware to breach air-gapped networks",
      "link": "https://www.bleepingcomputer.com/news/security/apt37-hackers-use-new-malware-to-breach-air-gapped-networks/",
      "summary": "North Korean hackers are deploying newly uncovered tools to move data between internet-connected and air-gapped systems, spread via removable drives, and conduct covert surveillance. [...]",
      "published": "Fri, 27 Feb 2026 14:21:25 -0500",
      "value_score": 22,
      "value_signals": [
        "Breach/leak"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Europol-led crackdown on The Com hackers leads to 30 arrests",
      "link": "https://www.bleepingcomputer.com/news/security/police-crackdown-on-the-com-cybercrime-gang-leads-to-30-arrests/",
      "summary": "A yearlong Europol-coordinated operation dubbed \"Project Compass\" has led to 30 arrests and 179 suspects being tied to \"The Com,\" an online cybercrime collective that targets children and teenagers. [...]",
      "published": "Fri, 27 Feb 2026 13:20:15 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "CISA warns that RESURGE malware can be dormant on Ivanti devices",
      "link": "https://www.bleepingcomputer.com/news/security/cisa-warns-that-resurge-malware-can-be-dormant-on-ivanti-devices/",
      "summary": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has released new details about RESURGE, a malicious implant used in zero-day attacks exploiting CVE-2025-0282 to breach Ivanti Connect Secure devices. [...]",
      "published": "Fri, 27 Feb 2026 10:57:04 -0500",
      "value_score": 100,
      "value_signals": [
        "CVE mentioned",
        "Zero-day",
        "Breach/leak",
        "CISA/KEV ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Third-Party Patching and the Business Footprint We All Share",
      "link": "https://www.bleepingcomputer.com/news/security/third-party-patching-and-the-business-footprint-we-all-share/",
      "summary": "Everyday tools like PDF readers, email clients, and archive utilities quietly define the real attack surface. Action1 explains how third-party software drift increases exploit risk and why consistent patching reduces exposure across endpoints. [...]",
      "published": "Fri, 27 Feb 2026 10:00:10 -0500",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Ukrainian man pleads guilty to running AI-powered fake ID site",
      "link": "https://www.bleepingcomputer.com/news/security/ukrainian-man-pleads-guilty-to-running-ai-powered-fake-id-site/",
      "summary": "A Ukrainian man has pleaded guilty to operating OnlyFake, an AI-powered website that generated and sold more than 10,000 photos of fake identification documents to customers worldwide. [...]",
      "published": "Fri, 27 Feb 2026 07:30:07 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Previously harmless Google API keys now expose Gemini AI data",
      "link": "https://www.bleepingcomputer.com/news/security/previously-harmless-google-api-keys-now-expose-gemini-ai-data/",
      "summary": "Google API keys for services like Maps embedded in accessible client-side code could be used to authenticate to the Gemini AI assistant and access private data. [...]",
      "published": "Thu, 26 Feb 2026 15:55:29 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Who is the Kimwolf Botmaster “Dort”?",
      "link": "https://krebsonsecurity.com/2026/02/who-is-the-kimwolf-botmaster-dort/",
      "summary": "In early January 2026, KrebsOnSecurity revealed how a security researcher disclosed a vulnerability that was used to assemble Kimwolf, the world's largest and most disruptive botnet. Since then, the person in control of Kimwolf -- who goes by the handle \"Dort\" -- has coordinated a barrage of distributed denial-of-service (DDoS), doxing and email flooding attacks against the researcher and this author, and more recently caused a SWAT team to be sent to the researcher's home. This post examines wh",
      "published": "Sat, 28 Feb 2026 12:01:57 +0000",
      "value_score": 20,
      "value_signals": [
        "Botnet"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "‘Starkiller’ Phishing Service Proxies Real Login Pages, MFA",
      "link": "https://krebsonsecurity.com/2026/02/starkiller-phishing-service-proxies-real-login-pages-mfa/",
      "summary": "Most phishing websites are little more than static copies of login pages for popular online destinations, and they are often quickly taken down by anti-abuse activists and security firms. But a stealthy new phishing-as-a-service offering lets customers sidestep both of these pitfalls: It uses cleverly disguised links to load the target brand's real website, and then acts as a relay between the target and the legitimate site -- forwarding the victim's username, password and multi-factor authentic",
      "published": "Fri, 20 Feb 2026 20:00:30 +0000",
      "value_score": 26,
      "value_signals": [
        "Phishing ×3"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Swamps Anonymity Network I2P",
      "link": "https://krebsonsecurity.com/2026/02/kimwolf-botnet-swamps-anonymity-network-i2p/",
      "summary": "For the past week, the massive \"Internet of Things\" (IoT) botnet known as Kimwolf has been disrupting the The Invisible Internet Project (I2P), a decentralized, encrypted communications network designed to anonymize and secure online communications. I2P users started reporting disruptions in the network around the same time the Kimwolf botmasters began relying on it to evade takedown attempts against the botnet's control servers.",
      "published": "Wed, 11 Feb 2026 16:08:11 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×3"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, February 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/02/patch-tuesday-february-2026-edition/",
      "summary": "Microsoft today released updates to fix more than 50 security holes in its Windows operating systems and other software, including patches for a whopping six \"zero-day\" vulnerabilities that attackers are already exploiting in the wild.",
      "published": "Tue, 10 Feb 2026 21:49:53 +0000",
      "value_score": 82,
      "value_signals": [
        "Zero-day",
        "Active exploitation",
        "Patch/update ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Please Don’t Feed the Scattered Lapsus ShinyHunters",
      "link": "https://krebsonsecurity.com/2026/02/please-dont-feed-the-scattered-lapsus-shiny-hunters/",
      "summary": "A prolific data ransom gang that calls itself Scattered Lapsus ShinyHunters (SLSH) has a distinctive playbook when it seeks to extort payment from victim firms: Harassing, threatening and even swatting executives and their families, all while notifying journalists and regulators… Read More »",
      "published": "Mon, 02 Feb 2026 16:15:16 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Who Operates the Badbox 2.0 Botnet?",
      "link": "https://krebsonsecurity.com/2026/01/who-operates-the-badbox-2-0-botnet/",
      "summary": "The cybercriminals in control of Kimwolf -- a disruptive botnet that has infected more than 2 million devices -- recently shared a screenshot indicating they'd compromised the control panel for Badbox 2.0, a vast China-based botnet powered by malicious software that comes pre-installed on many Android TV streaming boxes. Both the FBI and Google say they are hunting for the people behind Badbox 2.0, and thanks to bragging by the Kimwolf botmasters we may now have a much clearer idea about that.",
      "published": "Mon, 26 Jan 2026 16:11:38 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×3"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
      "link": "https://krebsonsecurity.com/2026/01/kimwolf-botnet-lurking-in-corporate-govt-networks/",
      "summary": "A new Internet-of-Things botnet called Kimwolf has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf's ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.",
      "published": "Tue, 20 Jan 2026 18:19:13 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×2"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, January 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "published": "Wed, 14 Jan 2026 00:47:38 +0000",
      "value_score": 40,
      "value_signals": [
        "Patch/update ×2",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Life Mirrors Art: Ransomware Hits Hospitals on TV &amp; IRL",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/ransomware-hospitals-tv-irl",
      "summary": "HBO's \"The Pitt\" is showing audiences what a real Mississippi healthcare system is going through this week, thanks to a ransomware attack.",
      "published": "Fri, 27 Feb 2026 20:48:05 GMT",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Cities Hosting Major Events Need More Focus on Wireless, Drone Defense",
      "link": "https://www.darkreading.com/cyber-risk/cities-major-events-wireless-drone-defense",
      "summary": "Major events like the FIFA World Cup need to look beyond traditional physical and cyber security to active and passive wireless threats, say experts.",
      "published": "Fri, 27 Feb 2026 20:23:17 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "The Case for Why Better Breach Transparency Matters",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/why-better-breach-transparency-matters",
      "summary": "It's become a standard practice for organizations to disclose the bare minimum about a data breach, or worse — not disclose the incident at all.",
      "published": "Fri, 27 Feb 2026 16:18:19 GMT",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Claude Code Security Shows Promise, Not Perfection",
      "link": "https://www.darkreading.com/application-security/claude-code-security-shows-promise-not-perfection",
      "summary": "Claude Code's introduction rippled across the stock market, but researchers and analysts say its impact was overstated, as they peel back the layers.",
      "published": "Fri, 27 Feb 2026 14:00:00 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Marquis v. SonicWall Lawsuit Ups the Breach Blame Game",
      "link": "https://www.darkreading.com/cloud-security/marquis-sonicwall-lawsuit-breach-blame-game",
      "summary": "When a company gets breached through a third-party security vendor, who should bear responsibility? For one FinTech company, the answer is the firewall provider.",
      "published": "Thu, 26 Feb 2026 22:02:41 GMT",
      "value_score": 22,
      "value_signals": [
        "Breach/leak"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Cisco SD-WAN Zero-Day Under Exploitation for 3 Years",
      "link": "https://www.darkreading.com/vulnerabilities-threats/cisco-sd-wan-zero-day-exploitation-3-years",
      "summary": "The maximum-severity vulnerability CVE-2026-20127 was exploited by an unknown but sophisticated threat actor who left very little evidence behind.",
      "published": "Thu, 26 Feb 2026 21:45:56 GMT",
      "value_score": 59,
      "value_signals": [
        "CVE mentioned",
        "Zero-day",
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Chinese Police Use ChatGPT to Smear Japan PM Takaichi",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/chinese-police-chatgpt-smear-japan-pm-takaichi",
      "summary": "A Chinese keyboard warrior inadvertently leaked information about politically motivated influence operations through a ChatGPT account.",
      "published": "Thu, 26 Feb 2026 00:00:00 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Flaws in Claude Code Put Developers' Machines at Risk",
      "link": "https://www.darkreading.com/application-security/flaws-claude-code-developer-machines-risk",
      "summary": "The vulnerabilities highlight a big drawback to integrating AI into software development workflows and the potential impact on supply chains.",
      "published": "Wed, 25 Feb 2026 22:02:32 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Canadian Tire Data Breach Impacts 38 Million Accounts",
      "link": "https://www.securityweek.com/canadian-tire-data-breach-impacts-38-million-accounts/",
      "summary": "Names, addresses, email addresses, phone numbers, and encrypted passwords were compromised in the attack. The post Canadian Tire Data Breach Impacts 38 Million Accounts appeared first on SecurityWeek .",
      "published": "Sat, 28 Feb 2026 11:50:00 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Security Week",
      "title": "Trump Orders All Federal Agencies to Phase Out Use of Anthropic Technology",
      "link": "https://www.securityweek.com/trump-orders-all-federal-agencies-to-phase-out-use-of-anthropic-technology/",
      "summary": "OpenAI and Google, along with Elon Musk’s xAI, also have contracts to supply their AI models to the military. The post Trump Orders All Federal Agencies to Phase Out Use of Anthropic Technology appeared first on SecurityWeek .",
      "published": "Fri, 27 Feb 2026 21:30:55 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "In Other News: ATT&CK Advisory Council, Russian Cyberattacks Aid Missile Strikes, Predator Bypasses iOS Indicators",
      "link": "https://www.securityweek.com/in-other-news-attck-advisory-council-russian-cyberattacks-aid-missile-strikes-predator-bypasses-ios-indicators/",
      "summary": "Other noteworthy stories that might have slipped under the radar: cyber valuations surge, OpenAI disrupts malicious AI use, ShinyHunters claims Odido breach. The post In Other News: ATT&CK Advisory Council, Russian Cyberattacks Aid Missile Strikes, Predator Bypasses iOS Indicators appeared first on SecurityWeek .",
      "published": "Fri, 27 Feb 2026 15:23:39 +0000",
      "value_score": 22,
      "value_signals": [
        "Breach/leak"
      ]
    },
    {
      "source": "Security Week",
      "title": "38 Million Allegedly Impacted by ManoMano Data Breach",
      "link": "https://www.securityweek.com/38-million-allegedly-impacted-by-manomano-data-breach/",
      "summary": "Hackers stole personal information such as names, email addresses, phone numbers, and other information. The post 38 Million Allegedly Impacted by ManoMano Data Breach appeared first on SecurityWeek .",
      "published": "Fri, 27 Feb 2026 13:41:27 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Security Week",
      "title": "900 Sangoma FreePBX Instances Infected With Web Shells",
      "link": "https://www.securityweek.com/900-sangoma-freepbx-instances-infected-with-web-shells/",
      "summary": "The attacks exploited a post-authentication command injection vulnerability in the endpoint manager’s interface. The post 900 Sangoma FreePBX Instances Infected With Web Shells appeared first on SecurityWeek .",
      "published": "Fri, 27 Feb 2026 13:24:25 +0000",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "Chilean Carding Shop Operator Extradited to US",
      "link": "https://www.securityweek.com/chilean-carding-shop-operator-extradited-to-us/",
      "summary": "The 24-year-old suspect has been accused of trafficking over 26,000 cards from a single brand. The post Chilean Carding Shop Operator Extradited to US appeared first on SecurityWeek .",
      "published": "Fri, 27 Feb 2026 12:34:54 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Anthropic Refuses to Bend to Pentagon on AI Safeguards as Dispute Nears Deadline",
      "link": "https://www.securityweek.com/anthropic-refuses-to-bend-to-pentagon-on-ai-safeguards-as-dispute-nears-deadline/",
      "summary": "Anthropic said it sought narrow assurances from the Pentagon that Claude won’t be used for mass surveillance of Americans or in fully autonomous weapons. The post Anthropic Refuses to Bend to Pentagon on AI Safeguards as Dispute Nears Deadline appeared first on SecurityWeek .",
      "published": "Fri, 27 Feb 2026 12:34:42 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Aeternum Botnet Loader Employs Polygon Blockchain C&C to Boost Resilience",
      "link": "https://www.securityweek.com/aeternum-botnet-loader-employs-polygon-blockchain-cc-to-boost-resilience/",
      "summary": "Aeternum operates on smart contracts, making its command-and-control (C&C) infrastructure difficult to disrupt. The post Aeternum Botnet Loader Employs Polygon Blockchain C&C to Boost Resilience appeared first on SecurityWeek .",
      "published": "Fri, 27 Feb 2026 12:02:53 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "summary": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "published": "Wed, 31 Aug 2022 12:57:48 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "published": "Tue, 30 Aug 2022 16:00:43 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "published": "Mon, 29 Aug 2022 14:56:19 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "published": "Fri, 26 Aug 2022 16:44:27 +0000",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "published": "Thu, 25 Aug 2022 18:47:15 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Twitter Whistleblower Complaint: The TL;DR Version",
      "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
      "summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk.",
      "published": "Wed, 24 Aug 2022 14:17:04 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
      "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
      "summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP.",
      "published": "Tue, 23 Aug 2022 13:19:58 +0000",
      "value_score": 50,
      "value_signals": [
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Fake Reservation Links Prey on Weary Travelers",
      "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
      "summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels.",
      "published": "Mon, 22 Aug 2022 13:59:06 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "CISA Alerts",
      "title": "Chargemap chargemap.com",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-057-05",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could enable attackers to gain unauthorized administrative control over vulnerable charging stations or disrupt charging services through denial-of-service attacks. The following versions of Chargemap chargemap.com are affected: chargemap.com vers:all/* (CVE-2026-25851, CVE-2026-20792, CVE-2026-25711, CVE-2026-20791) CVSS Vendor Equipment Vulnerabilities v3 9.4 Chargemap Chargemap chargemap.com Missing Authentication for Critical",
      "published": "Thu, 26 Feb 26 12:00:00 +0000",
      "value_score": 97,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "High severity",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Yokogawa CENTUM VP R6, R7",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-057-09",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could allow an attacker to terminate the software stack process, cause a denial-of-service condition, or execute arbitrary code. The following versions of Yokogawa CENTUM VP R6, R7 are affected: Vnet/IP Interface Package for CENTUM VP R6 (VP6C3300) <=R1.07.00 (CVE-2025-1924, CVE-2025-48019, CVE-2025-48020, CVE-2025-48021, CVE-2025-48022, CVE-2025-48023) Vnet/IP Interface Package for CENTUM VP R7 (VP7C3300) <=R1.07.00 (CVE-2025-19",
      "published": "Thu, 26 Feb 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×6",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Pelco, Inc. Sarix Pro 3 Series IP Cameras",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-057-02",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow attackers to gain unauthorized access to sensitive device data, bypass surveillance controls, and expose facilities to privacy breaches, operational risks, and regulatory compliance issues. The following versions of Pelco, Inc. Sarix Pro 3 Series IP Cameras are affected: Sarix Professional IMP 3 Series <=02.52 (CVE-2026-1241) Sarix Professional IXP 3 Series <=02.52 (CVE-2026-1241) Sarix Professional IBP 3 Series <=02.52 ",
      "published": "Thu, 26 Feb 26 12:00:00 +0000",
      "value_score": 85,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Copeland XWEB and XWEB Pro",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-057-10",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could allow an attacker to bypass authentication, cause a denial-of-service condition, cause memory corruption, and execute arbitrary code. The following versions of Copeland XWEB and XWEB Pro are affected: XWEB 300D PRO <=1.12.1 (CVE-2026-25085, CVE-2026-21718, CVE-2026-24663, CVE-2026-21389, CVE-2026-25111, CVE-2026-20742, CVE-2026-24517, CVE-2026-25195, CVE-2026-20910, CVE-2026-24689, CVE-2026-25109, CVE-2026-20902, CVE-2026-2",
      "published": "Thu, 26 Feb 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×12",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "EV Energy ev.energy",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-057-07",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could enable attackers to gain unauthorized administrative control over vulnerable charging stations or disrupt charging services through denial-of-service attacks. The following versions of EV Energy ev.energy are affected: ev.energy vers:all/* (CVE-2026-27772, CVE-2026-24445, CVE-2026-26290, CVE-2026-25774) CVSS Vendor Equipment Vulnerabilities v3 9.4 EV Energy EV Energy ev.energy Missing Authentication for Critical Function, I",
      "published": "Thu, 26 Feb 26 12:00:00 +0000",
      "value_score": 97,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "High severity",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Mobility46 mobility46.se",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-057-08",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could enable attackers to gain unauthorized administrative control over vulnerable charging stations or disrupt charging services through denial-of-service attacks. The following versions of Mobility46 mobility46.se are affected: mobility46.se vers:all/* (CVE-2026-27028, CVE-2026-26305, CVE-2026-27647, CVE-2026-22878) CVSS Vendor Equipment Vulnerabilities v3 9.4 Mobility46 Mobility46 mobility46.se Missing Authentication for Criti",
      "published": "Thu, 26 Feb 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CloudCharge cloudcharge.se",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-057-03",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could allow attackers to impersonate charging stations, hijack sessions, suppress or misroute legitimate traffic to cause large-scale denial of service, and manipulate data sent to the backend. The following versions of CloudCharge cloudcharge.se are affected: cloudcharge.se vers:all/* (CVE-2026-20781, CVE-2026-25114, CVE-2026-27652, CVE-2026-20733) CVSS Vendor Equipment Vulnerabilities v3 9.4 CloudCharge CloudCharge cloudcharge.",
      "published": "Thu, 26 Feb 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "EV2GO ev2go.io",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-057-04",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could allow attackers to impersonate charging stations, hijack sessions, suppress or misroute legitimate traffic to cause large-scale denial of service, and manipulate data sent to the backend. The following versions of EV2GO ev2go.io are affected: ev2go.io vers:all/* (CVE-2026-24731, CVE-2026-25945, CVE-2026-20895, CVE-2026-22890) CVSS Vendor Equipment Vulnerabilities v3 9.4 EV2GO EV2GO ev2go.io Missing Authentication for Critic",
      "published": "Thu, 26 Feb 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "Multiple CVEs",
        "Exploit wording"
      ]
    }
  ],
  "sources": [
    "The Hacker News",
    "BleepingComputer",
    "Krebs on Security",
    "Dark Reading",
    "Security Week",
    "Naked Security",
    "Threatpost",
    "CISA Alerts"
  ]
}