{
  "last_updated": "2026-02-03 10:34",
  "sources_count": 8,
  "articles_count": 56,
  "keywords": [
    "firefox ai features",
    "rockwell automation controllogix",
    "mid market across",
    "microsoft moves closer",
    "infrastructure hosting notepad",
    "2 857 skills",
    "glassworm malware loader",
    "vulnerabilities earned microsoft's",
    "twitter whistleblower complaint",
    "sprawling phishing campaign",
    "hacking group weaponizing",
    "certain notepad customers",
    "windows operating systems",
    "changing malware ransomware",
    "single update exploit",
    "malicious cyber actors",
    "windows releases will",
    "windows pcs microsoft",
    "enterprise security risks",
    "fresh glassworm attack"
  ],
  "trending": [
    {
      "keyword": "firefox ai features",
      "mentions": 6
    },
    {
      "keyword": "rockwell automation controllogix",
      "mentions": 50
    },
    {
      "keyword": "mid market across",
      "mentions": 8
    },
    {
      "keyword": "microsoft moves closer",
      "mentions": 9
    },
    {
      "keyword": "infrastructure hosting notepad",
      "mentions": 2
    },
    {
      "keyword": "2 857 skills",
      "mentions": 5
    },
    {
      "keyword": "glassworm malware loader",
      "mentions": 8
    },
    {
      "keyword": "vulnerabilities earned microsoft's",
      "mentions": 58
    },
    {
      "keyword": "twitter whistleblower complaint",
      "mentions": 567
    },
    {
      "keyword": "sprawling phishing campaign",
      "mentions": 124
    }
  ],
  "articles": [
    {
      "source": "The Hacker News",
      "title": "APT28 Uses Microsoft Office CVE-2026-21509 in Espionage-Focused Malware Attacks",
      "link": "https://thehackernews.com/2026/02/apt28-uses-microsoft-office-cve-2026.html",
      "summary": "The Russia-linked state-sponsored threat actor known as APT28 (aka UAC-0001) has been attributed to attacks exploiting a newly disclosed security flaw in Microsoft Office as part of a campaign codenamed Operation Neusploit. Zscaler ThreatLabz said it observed the hacking group weaponizing the shortcoming on January 29, 2026, in attacks targeting users in Ukraine, Slovakia, and Romania, three",
      "published": "Tue, 03 Feb 2026 14:42:00 +0530",
      "value_score": 34,
      "value_signals": [
        "CVE mentioned",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Mozilla Adds One-Click Option to Disable Generative AI Features in Firefox",
      "link": "https://thehackernews.com/2026/02/mozilla-adds-one-click-option-to.html",
      "summary": "Mozilla on Monday announced a new controls section in its Firefox desktop browser settings that allows users to completely turn off generative artificial intelligence (GenAI) features. \"It provides a single place to block current and future generative AI features in Firefox,\" Ajit Varma, head of Firefox, said. \"You can also review and manage individual AI features if you choose to use them. This",
      "published": "Tue, 03 Feb 2026 11:09:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Notepad++ Hosting Breach Attributed to China-Linked Lotus Blossom Hacking Group",
      "link": "https://thehackernews.com/2026/02/notepad-hosting-breach-attributed-to.html",
      "summary": "A China-linked threat actor known as Lotus Blossom has been attributed with medium confidence to the recently discovered compromise of the infrastructure hosting Notepad++. The attack enabled the state-sponsored hacking group to deliver a previously undocumented backdoor codenamed Chrysalis to users of the open-source editor, according to new findings from Rapid7. The development comes shortly",
      "published": "Tue, 03 Feb 2026 10:25:00 +0530",
      "value_score": 34,
      "value_signals": [
        "Breach/leak",
        "Backdoor"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Researchers Find 341 Malicious ClawHub Skills Stealing Data from OpenClaw Users",
      "link": "https://thehackernews.com/2026/02/researchers-find-341-malicious-clawhub.html",
      "summary": "A security audit of 2,857 skills on ClawHub has found 341 malicious skills across multiple campaigns, according to new findings from Koi Security, exposing users to new supply chain risks. ClawHub is a marketplace designed to make it easy for OpenClaw users to find and install third-party skills. It's an extension to the OpenClaw project, a self-hosted artificial intelligence (AI) assistant",
      "published": "Mon, 02 Feb 2026 23:19:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "OpenClaw Bug Enables One-Click Remote Code Execution via Malicious Link",
      "link": "https://thehackernews.com/2026/02/openclaw-bug-enables-one-click-remote.html",
      "summary": "A high-severity security flaw has been disclosed in OpenClaw (formerly referred to as Clawdbot and Moltbot) that could allow remote code execution (RCE) through a crafted malicious link. The issue, which is tracked as CVE-2026-25253 (CVSS score: 8.8), has been addressed in version 2026.1.29 released on January 30, 2026. It has been described as a token exfiltration vulnerability that leads to",
      "published": "Mon, 02 Feb 2026 21:58:00 +0530",
      "value_score": 68,
      "value_signals": [
        "CVE mentioned",
        "RCE ×3"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Microsoft Begins NTLM Phase-Out With Three-Stage Plan to Move Windows to Kerberos",
      "link": "https://thehackernews.com/2026/02/microsoft-begins-ntlm-phase-out-with.html",
      "summary": "Microsoft has announced a three-phase approach to phase out New Technology LAN Manager (NTLM) as part of its efforts to shift Windows environments toward stronger, Kerberos-based options. The development comes more than two years after the tech giant revealed its plans to deprecate the legacy technology, citing its susceptibility to weaknesses that could facilitate relay attacks and allow bad",
      "published": "Mon, 02 Feb 2026 21:29:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "⚡ Weekly Recap: Proxy Botnet, Office Zero-Day, MongoDB Ransoms, AI Hijacks & New Threats",
      "link": "https://thehackernews.com/2026/02/weekly-recap-proxy-botnet-office-zero.html",
      "summary": "Every week brings new discoveries, attacks, and defenses that shape the state of cybersecurity. Some threats are stopped quickly, while others go unseen until they cause real damage. Sometimes a single update, exploit, or mistake changes how we think about risk and protection. Every incident shows how defenders adapt — and how fast attackers try to stay ahead. This week’s recap brings you the",
      "published": "Mon, 02 Feb 2026 17:29:00 +0530",
      "value_score": 59,
      "value_signals": [
        "Zero-day",
        "Patch/update",
        "Botnet",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Securing the Mid-Market Across the Complete Threat Lifecycle",
      "link": "https://thehackernews.com/2026/02/securing-mid-market-across-complete.html",
      "summary": "For mid-market organizations, cybersecurity is a constant balancing act. Proactive, preventative security measures are essential to protect an expanding attack surface. Combined with effective protection that blocks threats, they play a critical role in stopping cyberattacks before damage is done. The challenge is that many security tools add complexity and cost that most mid-market businesses",
      "published": "Mon, 02 Feb 2026 17:15:00 +0530",
      "value_score": 18,
      "value_signals": [
        "High severity"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "New GlassWorm attack targets macOS via compromised OpenVSX extensions",
      "link": "https://www.bleepingcomputer.com/news/security/new-glassworm-attack-targets-macos-via-compromised-openvsx-extensions/",
      "summary": "A new GlassWorm malware attack through compromised OpenVSX extensions focuses on stealing passwords, crypto-wallet data, and developer credentials and configurations from macOS systems. [...]",
      "published": "Mon, 02 Feb 2026 17:04:19 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Russian hackers exploit recently patched Microsoft Office bug in attacks",
      "link": "https://www.bleepingcomputer.com/news/security/russian-hackers-exploit-recently-patched-microsoft-office-bug-in-attacks/",
      "summary": "Ukraine's Computer Emergency Response Team (CERT) says that Russian hackers are exploiting CVE-2026-21509, a recently patched vulnerability in multiple versions of Microsoft Office. [...]",
      "published": "Mon, 02 Feb 2026 16:00:07 -0500",
      "value_score": 34,
      "value_signals": [
        "CVE mentioned",
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Malicious MoltBot skills used to push password-stealing malware",
      "link": "https://www.bleepingcomputer.com/news/security/malicious-moltbot-skills-used-to-push-password-stealing-malware/",
      "summary": "More than 230 malicious packages for the personal AI assistant OpenClaw (formerly known as Moltbot and ClawdBot) have been published in less than a week on the tool's official registry and on GitHub. [...]",
      "published": "Mon, 02 Feb 2026 14:11:12 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Mozilla announces switch to disable all Firefox AI features",
      "link": "https://www.bleepingcomputer.com/news/software/mozilla-will-let-you-turn-off-all-firefox-ai-features/",
      "summary": "In response to user feedback on AI integration, Mozilla announced today that the next Firefox release will let users disable AI features entirely or manage them individually. [...]",
      "published": "Mon, 02 Feb 2026 13:09:13 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft: January update shutdown bug affects more Windows PCs",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-january-update-shutdown-bug-affects-more-windows-pcs/",
      "summary": "Microsoft has confirmed that a known issue preventing some Windows 11 devices from shutting down also affects Windows 10 systems with Virtual Secure Mode (VSM) enabled. [...]",
      "published": "Mon, 02 Feb 2026 12:17:30 -0500",
      "value_score": 18,
      "value_signals": [
        "Patch/update"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "CTM360 Report Warns of Global Surge in Fake High-Yield Investment Scams",
      "link": "https://www.bleepingcomputer.com/news/security/ctm360-report-warns-of-global-surge-in-fake-high-yield-investment-scams/",
      "summary": "Fake high-yield investment platforms are surging worldwide, promising \"guaranteed\" returns that mask classic Ponzi schemes.CTM360 explains how HYIP scams scale through social media, recycled templates, and referral abuse. [...]",
      "published": "Mon, 02 Feb 2026 10:34:44 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Notepad++ update feature hijacked by Chinese state hackers for months",
      "link": "https://www.bleepingcomputer.com/news/security/notepad-plus-plus-update-feature-hijacked-by-chinese-state-hackers-for-months/",
      "summary": "Chinese state-sponsored threat actors were likely behind the hijacking of Notepad++ update traffic last year that lasted for almost half a year, the developer states in an official announcement today. [...]",
      "published": "Mon, 02 Feb 2026 09:53:52 -0500",
      "value_score": 26,
      "value_signals": [
        "Patch/update ×2"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Panera Bread breach impacts 5.1 million accounts, not 14 million customers",
      "link": "https://www.bleepingcomputer.com/news/security/panera-bread-data-breach-impacts-51-million-accounts-not-14-million-customers/",
      "summary": "The data breach notification service Have I Been Pwned says that a data breach at the U.S. food chain Panera Bread affected 5.1 million accounts, not 14 million customers as previously reported. [...]",
      "published": "Mon, 02 Feb 2026 08:46:39 -0500",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×3"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
      "link": "https://krebsonsecurity.com/2026/01/kimwolf-botnet-lurking-in-corporate-govt-networks/",
      "summary": "A new Internet-of-Things botnet called Kimwolf has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf's ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.",
      "published": "Tue, 20 Jan 2026 18:19:13 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×2"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, January 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "published": "Wed, 14 Jan 2026 00:47:38 +0000",
      "value_score": 40,
      "value_signals": [
        "Patch/update ×2",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Who Benefited from the Aisuru and Kimwolf Botnets?",
      "link": "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
      "summary": "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we'll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf's spread.",
      "published": "Thu, 08 Jan 2026 23:23:43 +0000",
      "value_score": 20,
      "value_signals": [
        "Botnet"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "The Kimwolf Botnet is Stalking Your Local Network",
      "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
      "summary": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.",
      "published": "Fri, 02 Jan 2026 14:20:10 +0000",
      "value_score": 26,
      "value_signals": [
        "Botnet",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Happy 16th Birthday, KrebsOnSecurity.com!",
      "link": "https://krebsonsecurity.com/2025/12/happy-16th-birthday-krebsonsecurity-com/",
      "summary": "KrebsOnSecurity.com celebrates its 16th anniversary today! A huge \"thank you\" to all of our readers -- newcomers, long-timers and drive-by critics alike. Your engagement this past year here has been tremendous and truly a salve on a handful of dark days. Happily, comeuppance was a strong theme running through our coverage in 2025, with a primary focus on entities that enabled complex and globally-dispersed cybercrime services.",
      "published": "Mon, 29 Dec 2025 20:23:26 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Dismantling Defenses: Trump 2.0 Cyber Year in Review",
      "link": "https://krebsonsecurity.com/2025/12/dismantling-defenses-trump-2-0-cyber-year-in-review/",
      "summary": "The Trump administration has pursued a staggering range of policy pivots this past year that threaten to weaken the nation’s ability and willingness to address a broad spectrum of technology challenges, from cybersecurity and privacy to countering disinformation, fraud and corruption. These shifts, along with the president’s efforts to restrict free speech and freedom of the press, have come at such a rapid clip that many readers probably aren’t even aware of them all.",
      "published": "Fri, 19 Dec 2025 15:14:55 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Most Parked Domains Now Serving Malicious Content",
      "link": "https://krebsonsecurity.com/2025/12/most-parked-domains-now-serving-malicious-content/",
      "summary": "Direct navigation -- the act of visiting a website by manually typing a domain name in a web browser -- has never been riskier: A new study finds the vast majority of \"parked\" domains -- mostly expired or dormant domain names, or common misspellings of popular websites -- are now configured to redirect visitors to sites that foist scams and malware.",
      "published": "Tue, 16 Dec 2025 14:14:48 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Microsoft Patch Tuesday, December 2025 Edition",
      "link": "https://krebsonsecurity.com/2025/12/microsoft-patch-tuesday-december-2025-edition/",
      "summary": "Microsoft today pushed updates to fix at least 56 security flaws in its Windows operating systems and supported software. This final Patch Tuesday of 2025 tackles one zero-day bug that is already being exploited, as well as two publicly disclosed vulnerabilities.",
      "published": "Tue, 09 Dec 2025 23:18:29 +0000",
      "value_score": 57,
      "value_signals": [
        "Zero-day",
        "Patch/update ×3",
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Attackers Harvest Dropbox Logins Via Fake PDF Lures",
      "link": "https://www.darkreading.com/cloud-security/attackers-harvest-dropbox-logins-fake-pdf-lures",
      "summary": "A malware-free phishing campaign targets corporate inboxes and asks employees to view \"request orders,\" ultimately leading to Dropbox credential theft.",
      "published": "Mon, 02 Feb 2026 22:21:33 GMT",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "County Pays $600K to Wrongfully Jailed Pen Testers",
      "link": "https://www.darkreading.com/cybersecurity-operations/county-pays-600k-wrongfully-jailed-pen-testers",
      "summary": "Iowa police arrested two penetration testers in 2019 for doing their jobs, highlighting the risk to security professionals in red teaming exercises.",
      "published": "Mon, 02 Feb 2026 21:57:51 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Chinese Hackers Hijack Notepad++ Updates for 6 Months",
      "link": "https://www.darkreading.com/application-security/chinese-hackers-hijack-notepad-updates-6-months",
      "summary": "State-sponsored threat actors compromised the popular code editor's hosting provider to redirect targeted users to malicious downloads.",
      "published": "Mon, 02 Feb 2026 19:57:02 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "ShinyHunters Expands Scope of SaaS Extortion Attacks",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/shinyhunters-expands-scope-saas-extortion-attacks",
      "summary": "Following its attacks on Salesforce instances last year, members of the cybercrime group have broadened their targeting and gotten more aggressive with extortion tactics.",
      "published": "Mon, 02 Feb 2026 16:07:57 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Torq Moves SOCs Beyond SOAR With AI-Powered Hyper Automation",
      "link": "https://www.darkreading.com/remote-workforce/torq-moves-socs-soar-ai-powered-hyper-automation",
      "summary": "Investors poured $140 million into Torq's Series D Round, raising the startup's valuation to $1.2 billion, to bring AI-based \"hyper automation\" to SOCs.",
      "published": "Fri, 30 Jan 2026 22:14:31 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "2026: The Year Agentic AI Becomes the Attack-Surface Poster Child",
      "link": "https://www.darkreading.com/threat-intelligence/2026-agentic-ai-attack-surface-poster-child",
      "summary": "Dark Reading asked readers whether agentic AI attacks, advanced deepfake threats, board recognition of cyber as a top priority, or password-less technology adoption would be most likely to become a trending reality for 2026.",
      "published": "Fri, 30 Jan 2026 21:16:15 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Out-of-the-Box Expectations for 2026 Reveal a Grab Bag of Risk",
      "link": "https://www.darkreading.com/threat-intelligence/cyber-expectations-2026-grab-bag-risk",
      "summary": "Security teams need to be thinking about this list of emerging cybersecurity realities to avoid rolling the dice on enterprise security risks (and opportunities).",
      "published": "Fri, 30 Jan 2026 21:14:32 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Tenable Tackles AI Governance, Shadow AI Risks, Data Exposure",
      "link": "https://www.darkreading.com/cyber-risk/tenable-tackles-ai-governance-shadow-ai-risks-data-exposure",
      "summary": "The Tenable One AI Exposure add-on discovers unsanctioned AI use in the organization and enforces policy compliance with approved tools.",
      "published": "Fri, 30 Jan 2026 20:23:53 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "ShinyHunters-Branded Extortion Activity Expands, Escalates",
      "link": "https://www.securityweek.com/shinyhunters-branded-extortion-activity-expands-escalates/",
      "summary": "Hackers rely on evolved vishing and login harvesting to compromise SSO credentials for unauthorized MFA enrollment. The post ShinyHunters-Branded Extortion Activity Expands, Escalates appeared first on SecurityWeek .",
      "published": "Mon, 02 Feb 2026 15:28:16 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Open VSX Publisher Account Hijacked in Fresh GlassWorm Attack",
      "link": "https://www.securityweek.com/open-vsx-publisher-account-hijacked-in-fresh-glassworm-attack/",
      "summary": "A hacker published malicious versions of four established VS Code extensions to distribute a GlassWorm malware loader. The post Open VSX Publisher Account Hijacked in Fresh GlassWorm Attack appeared first on SecurityWeek .",
      "published": "Mon, 02 Feb 2026 14:12:50 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Default ICS Credentials Exploited in Destructive Attack on Polish Energy Facilities",
      "link": "https://www.securityweek.com/default-ics-credentials-exploited-in-destructive-attack-on-polish-energy-facilities/",
      "summary": "Poland’s CERT has published a report on the recent attack, providing new details on targeted ICS and attribution. The post Default ICS Credentials Exploited in Destructive Attack on Polish Energy Facilities appeared first on SecurityWeek .",
      "published": "Mon, 02 Feb 2026 13:50:53 +0000",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "Cyber Insights 2026: Malware and Cyberattacks in the Age of AI",
      "link": "https://www.securityweek.com/cyber-insights-2026-malware-and-cyberattacks-in-the-age-of-ai/",
      "summary": "Security leaders share how artificial intelligence is changing malware, ransomware, and identity-led intrusions, and how defenses must evolve. The post Cyber Insights 2026: Malware and Cyberattacks in the Age of AI appeared first on SecurityWeek .",
      "published": "Mon, 02 Feb 2026 12:00:00 +0000",
      "value_score": 28,
      "value_signals": [
        "Ransomware"
      ]
    },
    {
      "source": "Security Week",
      "title": "Over 1,400 MongoDB Databases Ransacked by Threat Actor",
      "link": "https://www.securityweek.com/over-1400-mongodb-databases-ransacked-by-threat-actor/",
      "summary": "Of 3,100 unprotected MongoDB instances, half remain compromised, most of them by a single threat actor. The post Over 1,400 MongoDB Databases Ransacked by Threat Actor appeared first on SecurityWeek .",
      "published": "Mon, 02 Feb 2026 11:45:56 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Microsoft Moves Closer to Disabling NTLM",
      "link": "https://www.securityweek.com/microsoft-moves-closer-to-disabling-ntlm/",
      "summary": "The next major Windows Server and Windows releases will have the deprecated authentication protocol disabled by default. The post Microsoft Moves Closer to Disabling NTLM appeared first on SecurityWeek .",
      "published": "Mon, 02 Feb 2026 11:31:40 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Japan, Britain to Boost Cybersecurity and Critical Minerals Cooperation as China’s Influence Grows",
      "link": "https://www.securityweek.com/japan-britain-to-boost-cybersecurity-and-critical-minerals-cooperation-as-chinas-influence-grows/",
      "summary": "Japan and Britain agree to accelerate cooperation on cybersecurity and the supply of critical minerals, as China’s influence grows in the region. The post Japan, Britain to Boost Cybersecurity and Critical Minerals Cooperation as China’s Influence Grows appeared first on SecurityWeek .",
      "published": "Mon, 02 Feb 2026 10:35:00 +0000",
      "value_score": 26,
      "value_signals": [
        "High severity ×3"
      ]
    },
    {
      "source": "Security Week",
      "title": "Notepad++ Supply Chain Hack Conducted by China via Hosting Provider",
      "link": "https://www.securityweek.com/notepad-supply-chain-hack-conducted-by-china-via-hosting-provider/",
      "summary": "The likely state-sponsored threat actor had access to the hosting provider for months and targeted only certain Notepad++ customers. The post Notepad++ Supply Chain Hack Conducted by China via Hosting Provider appeared first on SecurityWeek .",
      "published": "Mon, 02 Feb 2026 09:18:18 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "summary": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "published": "Wed, 31 Aug 2022 12:57:48 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "published": "Tue, 30 Aug 2022 16:00:43 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "published": "Mon, 29 Aug 2022 14:56:19 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "published": "Fri, 26 Aug 2022 16:44:27 +0000",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "published": "Thu, 25 Aug 2022 18:47:15 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Twitter Whistleblower Complaint: The TL;DR Version",
      "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
      "summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk.",
      "published": "Wed, 24 Aug 2022 14:17:04 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
      "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
      "summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP.",
      "published": "Tue, 23 Aug 2022 13:19:58 +0000",
      "value_score": 50,
      "value_signals": [
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Fake Reservation Links Prey on Weary Travelers",
      "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
      "summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels.",
      "published": "Mon, 22 Aug 2022 13:59:06 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "CISA Alerts",
      "title": "KiloView Encoder Series",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-029-01",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an unauthenticated attacker to create or delete administrator accounts, granting full administrative control. The following versions of KiloView Encoder Series are affected: Encoder Series E1 hardware Version 1.4 4.7.2516 (CVE-2026-1453) Encoder Series E1 hardware Version 1.6.20 4.7.2511|4.8.2523|4.8.2611|4.6.2400|4.7.2512|4.8.2561|4.8.2554|4.3.2029|4.8.2555|4.6.2408 (CVE-2026-1453) Encoder Series E1-s hardware Version 1",
      "published": "Thu, 29 Jan 26 12:00:00 +0000",
      "value_score": 85,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Rockwell Automation ArmorStart LT",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-029-02",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could allow an attacker to cause a denial-of-service condition. The following versions of Rockwell Automation ArmorStart LT are affected: ArmorStart LT 290D <=V2.002 (CVE-2025-9464, CVE-2025-9465, CVE-2025-9466, CVE-2025-9278, CVE-2025-9279, CVE-2025-9280, CVE-2025-9281, CVE-2025-9282, CVE-2025-9283) ArmorStart LT 291D <=V2.002 (CVE-2025-9464, CVE-2025-9465, CVE-2025-9466, CVE-2025-9278, CVE-2025-9279, CVE-2025-9280, CVE-2025-928",
      "published": "Thu, 29 Jan 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×15",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/01/29/cisa-adds-one-known-exploited-vulnerability-catalog",
      "summary": "CISA has added one new vulnerability to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2026-1281 Ivanti Endpoint Manager Mobile (EPMM) Code Injection Vulnerability This type of vulnerability is a frequent attack vector for malicious cyber actors and poses significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of Known Exploited Vulnerabilities established the KEV Catalog as a living ",
      "published": "Thu, 29 Jan 26 12:00:00 +0000",
      "value_score": 99,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "CISA/KEV ×6",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Rockwell Automation ControlLogix",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-029-03",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an attacker to cause a denial-of-service condition. The following versions of Rockwell Automation ControlLogix are affected: ControlLogix Redundancy Enhanced Module Catalog 1756-RM2 Firmware vers:all/* (CVE-2025-14027) ControlLogix Redundancy Enhanced Module Catalog 1756-RM2XT Firmware vers:all/* (CVE-2025-14027) CVSS Vendor Equipment Vulnerabilities v3 7.5 Rockwell Automation Rockwell Automation ControlLogix Missing Rel",
      "published": "Thu, 29 Jan 26 12:00:00 +0000",
      "value_score": 85,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Fortinet Releases Guidance to Address Ongoing Exploitation of Authentication Bypass Vulnerability CVE-2026-24858",
      "link": "https://www.cisa.gov/news-events/alerts/2026/01/28/fortinet-releases-guidance-address-ongoing-exploitation-authentication-bypass-vulnerability-cve-2026",
      "summary": "Newly disclosed vulnerability Common Vulnerabilities and Exposures (CVE)-2026-24858 [ Common Weakness Enumeration (CWE)-288: Authentication Bypass Using an Alternate Path or Channel ] allows malicious actors with a FortiCloud account and a registered device to log in to separate devices registered to other users in FortiOS, FortiManager, FortiWeb, FortiProxy, and FortiAnalyzer, if FortiCloud single sign on (SSO) is enabled on devices. 1 Users are vulnerable to CVE-2026-24858 even if they updated",
      "published": "Wed, 28 Jan 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "Auth bypass ×2",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "iba Systems ibaPDA",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-027-01",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an attacker to perform unauthorized actions on the file system. The following versions of iba Systems ibaPDA are affected: ibaPDA (CVE-2025-14988) CVSS Vendor Equipment Vulnerabilities v3 9.8 iba Systems iba Systems ibaPDA Incorrect Permission Assignment for Critical Resource Background Critical Infrastructure Sectors: Critical Manufacturing Countries/Areas Deployed: Worldwide Company Headquarters Location: Germany Vulne",
      "published": "Tue, 27 Jan 26 12:00:00 +0000",
      "value_score": 75,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "High severity ×3",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/01/27/cisa-adds-one-known-exploited-vulnerability-catalog",
      "summary": "CISA has added one new vulnerability to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2026-24858 Fortinet Multiple Products Authentication Bypass Using an Alternate Path or Channel Vulnerability This type of vulnerability is a frequent attack vector for malicious cyber actors and poses significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of Known Exploited Vulnerabilities establis",
      "published": "Tue, 27 Jan 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "Auth bypass",
        "CISA/KEV ×5",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Johnson Controls Metasys Products",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-027-04",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could result in remote SQL execution, leading to alteration or loss of data. The following versions of Johnson Controls Metasys Products are affected: Metasys Application and Data Server (ADS) (CVE-2025-26385) Metasys Extended Application and Data Server (ADX) (CVE-2025-26385) Metasys LCS8500 (CVE-2025-26385) Metasys NAE8500 (CVE-2025-26385) Metasys System Configuration Tool (SCT) (CVE-2025-26385) Metasys Controller Configuration To",
      "published": "Tue, 27 Jan 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×5",
        "Multiple CVEs",
        "Exploit wording"
      ]
    }
  ],
  "sources": [
    "The Hacker News",
    "BleepingComputer",
    "Krebs on Security",
    "Dark Reading",
    "Security Week",
    "Naked Security",
    "Threatpost",
    "CISA Alerts"
  ]
}