{
  "last_updated": "2026-02-11 12:58",
  "sources_count": 8,
  "articles_count": 56,
  "keywords": [
    "targeted social engineering",
    "ics security gaps",
    "curbing telnet traffic",
    "chipmaker patch tuesday",
    "rival cloud security",
    "internal network behind",
    "fake zoom meeting",
    "released security updates",
    "twitter whistleblower complaint",
    "sim location data",
    "flawed driver software",
    "control c2 purposes",
    "exploited without authentication",
    "secure ot communication",
    "national security risk",
    "windows operating systems",
    "final patch tuesday",
    "vulnerabilities found recently",
    "vulnerabilities earned microsoft's",
    "80 vulnerabilities addressed"
  ],
  "trending": [
    {
      "keyword": "targeted social engineering",
      "mentions": 3
    },
    {
      "keyword": "ics security gaps",
      "mentions": 11
    },
    {
      "keyword": "curbing telnet traffic",
      "mentions": 4
    },
    {
      "keyword": "chipmaker patch tuesday",
      "mentions": 1
    },
    {
      "keyword": "rival cloud security",
      "mentions": 9
    },
    {
      "keyword": "internal network behind",
      "mentions": 219
    },
    {
      "keyword": "fake zoom meeting",
      "mentions": 3
    },
    {
      "keyword": "released security updates",
      "mentions": 27
    },
    {
      "keyword": "twitter whistleblower complaint",
      "mentions": 654
    },
    {
      "keyword": "sim location data",
      "mentions": 7
    }
  ],
  "articles": [
    {
      "source": "The Hacker News",
      "title": "Exposed Training Open the Door for Crypto-Mining in Fortune 500 Cloud Environments",
      "link": "https://thehackernews.com/2026/02/exposed-training-open-door-for-crypto.html",
      "summary": "Intentionally vulnerable training applications are widely used for security education, internal testing, and product demonstrations. Tools such as OWASP Juice Shop, DVWA, Hackazon, and bWAPP are designed to be insecure by default, making them useful for learning how common attack techniques work in controlled environments. The issue is not the applications themselves, but how they are often",
      "published": "Wed, 11 Feb 2026 17:00:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Microsoft Patches 59 Vulnerabilities Including Six Actively Exploited Zero-Days",
      "link": "https://thehackernews.com/2026/02/microsoft-patches-59-vulnerabilities.html",
      "summary": "Microsoft on Tuesday released security updates to address a set of 59 flaws across its software, including six vulnerabilities that it said have been exploited in the wild. Of the 59 flaws, five are rated Critical, 52 are rated Important, and two are rated Moderate in severity. Twenty-five of the patched vulnerabilities have been classified as privilege escalation, followed by remote code",
      "published": "Wed, 11 Feb 2026 15:52:00 +0530",
      "value_score": 86,
      "value_signals": [
        "Active exploitation ×2",
        "Privilege escalation",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "SSHStalker Botnet Uses IRC C2 to Control Linux Systems via Legacy Kernel Exploits",
      "link": "https://thehackernews.com/2026/02/sshstalker-botnet-uses-irc-c2-to.html",
      "summary": "Cybersecurity researchers have disclosed details of a new botnet operation called SSHStalker that relies on the Internet Relay Chat (IRC) communication protocol for command-and-control (C2) purposes. \"The toolset blends stealth helpers with legacy-era Linux exploitation: Alongside log cleaners (utmp/wtmp/lastlog tampering) and rootkit-class artifacts, the actor keeps a large back-catalog of",
      "published": "Wed, 11 Feb 2026 15:26:00 +0530",
      "value_score": 36,
      "value_signals": [
        "Botnet ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "North Korea-Linked UNC1069 Uses AI Lures to Attack Cryptocurrency Organizations",
      "link": "https://thehackernews.com/2026/02/north-korea-linked-unc1069-uses-ai.html",
      "summary": "The North Korea-linked threat actor known as UNC1069 has been observed targeting the cryptocurrency sector to steal sensitive data from Windows and macOS systems with the ultimate goal of facilitating financial theft. \"The intrusion relied on a social engineering scheme involving a compromised Telegram account, a fake Zoom meeting, a ClickFix infection vector, and reported usage of AI-generated",
      "published": "Wed, 11 Feb 2026 12:20:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "DPRK Operatives Impersonate Professionals on LinkedIn to Infiltrate Companies",
      "link": "https://thehackernews.com/2026/02/dprk-operatives-impersonate.html",
      "summary": "The information technology (IT) workers associated with the Democratic People's Republic of Korea (DPRK) are now applying to remote positions using real LinkedIn accounts of individuals they're impersonating, marking a new escalation of the fraudulent scheme. \"These profiles often have verified workplace emails and identity badges, which DPRK operatives hope will make their fraudulent",
      "published": "Tue, 10 Feb 2026 23:14:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Reynolds Ransomware Embeds BYOVD Driver to Disable EDR Security Tools",
      "link": "https://thehackernews.com/2026/02/reynolds-ransomware-embeds-byovd-driver.html",
      "summary": "Cybersecurity researchers have disclosed details of an emergent ransomware family dubbed Reynolds that comes embedded with a built-in bring your own vulnerable driver (BYOVD) component for defense evasion purposes within the ransomware payload itself. BYOVD refers to an adversarial technique that abuses legitimate but flawed driver software to escalate privileges and disable Endpoint Detection",
      "published": "Tue, 10 Feb 2026 20:06:00 +0530",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×3"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "From Ransomware to Residency: Inside the Rise of the Digital Parasite",
      "link": "https://thehackernews.com/2026/02/from-ransomware-to-residency-inside.html",
      "summary": "Are ransomware and encryption still the defining signals of modern cyberattacks, or has the industry been too fixated on noise while missing a more dangerous shift happening quietly all around them? According to Picus Labs’ new Red Report 2026, which analyzed over 1.1 million malicious files and mapped 15.5 million adversarial actions observed across 2025, attackers are no longer optimizing for",
      "published": "Tue, 10 Feb 2026 19:29:00 +0530",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Fortinet Patches Critical SQLi Flaw Enabling Unauthenticated Code Execution",
      "link": "https://thehackernews.com/2026/02/fortinet-patches-critical-sqli-flaw.html",
      "summary": "Fortinet has released security updates to address a critical flaw impacting FortiClientEMS that could lead to the execution of arbitrary code on susceptible systems. The vulnerability, tracked as CVE-2026-21643, has a CVSS rating of 9.1 out of a maximum of 10.0. \"An improper neutralization of special elements used in an SQL Command ('SQL Injection') vulnerability [CWE-89] in FortiClientEMS may",
      "published": "Tue, 10 Feb 2026 19:00:00 +0530",
      "value_score": 44,
      "value_signals": [
        "CVE mentioned",
        "High severity ×2"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft releases Windows 11 26H1 for select and upcoming CPUs",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-windows-11-26h1-for-select-and-upcoming-cpus/",
      "summary": "Microsoft has announced Windows 11 26H1, but it's not for existing PCs. Instead, it will ship on devices with Snapdragon X2 processors and possibly other rumored ARM chips.w [...]",
      "published": "Tue, 10 Feb 2026 21:06:42 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "New Linux botnet SSHStalker uses old-school IRC for C2 comms",
      "link": "https://www.bleepingcomputer.com/news/security/new-linux-botnet-sshstalker-uses-old-school-irc-for-c2-comms/",
      "summary": "A newly documented Linux botnet named SSHStalker is using the IRC (Internet Relay Chat) communication protocol for command-and-control (C2) operations. [...]",
      "published": "Tue, 10 Feb 2026 18:09:48 -0500",
      "value_score": 30,
      "value_signals": [
        "Botnet ×2"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "North Korean hackers use new macOS malware in crypto-theft attacks",
      "link": "https://www.bleepingcomputer.com/news/security/north-korean-hackers-use-new-macos-malware-in-crypto-theft-attacks/",
      "summary": "North Korean hackers are running tailored campaigns using AI-generated video and the ClickFix technique to deliver malware for macOS and Windows to targets in the cryptocurrency sector. [...]",
      "published": "Tue, 10 Feb 2026 17:17:35 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Malicious 7-Zip site distributes installer laced with proxy tool",
      "link": "https://www.bleepingcomputer.com/news/security/malicious-7-zip-site-distributes-installer-laced-with-proxy-tool/",
      "summary": "A fake 7-Zip website is distributing a trojanized installer of the popular archiving tool that turns the user's computer into a residential proxy node. [...]",
      "published": "Tue, 10 Feb 2026 14:12:55 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft releases Windows 10 KB5075912 extended security update",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-windows-10-kb5075912-extended-security-update/",
      "summary": "Microsoft has released the Windows 10 KB5075912 extended security update to fix February 2026 Patch Tuesday vulnerabilities, including six zero-days, and continue rolling out replacements for expiring Secure Boot certificates. [...]",
      "published": "Tue, 10 Feb 2026 14:06:13 -0500",
      "value_score": 26,
      "value_signals": [
        "Patch/update ×4"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft February 2026 Patch Tuesday fixes 6 zero-days, 58 flaws",
      "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-february-2026-patch-tuesday-fixes-6-zero-days-58-flaws/",
      "summary": "Today is Microsoft's February 2026 Patch Tuesday with security updates for 58 flaws, including 6 actively exploited and three publicly disclosed zero-day vulnerabilities. [...]",
      "published": "Tue, 10 Feb 2026 13:51:46 -0500",
      "value_score": 82,
      "value_signals": [
        "Zero-day",
        "Active exploitation",
        "Patch/update ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Windows 11 KB5077181 & KB5075941 cumulative updates released",
      "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5077181-and-kb5075941-cumulative-updates-released/",
      "summary": "Microsoft has released Windows 11 KB5077181 and KB5075941 cumulative updates for versions 25H2/24H2 and 23H2 to fix security vulnerabilities, bugs, and add new features. [...]",
      "published": "Tue, 10 Feb 2026 13:43:53 -0500",
      "value_score": 18,
      "value_signals": [
        "Patch/update"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Volvo Group North America customer data exposed in Conduent hack",
      "link": "https://www.bleepingcomputer.com/news/security/volvo-group-north-america-customer-data-exposed-in-conduent-hack/",
      "summary": "Volvo Group North America disclosed that it suffered an indirect data breach stemming from the compromise of IT systems at American business services giant Conduent, of which Volvo is a customer. [...]",
      "published": "Tue, 10 Feb 2026 12:04:18 -0500",
      "value_score": 22,
      "value_signals": [
        "Breach/leak"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
      "link": "https://krebsonsecurity.com/2026/01/kimwolf-botnet-lurking-in-corporate-govt-networks/",
      "summary": "A new Internet-of-Things botnet called Kimwolf has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf's ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.",
      "published": "Tue, 20 Jan 2026 18:19:13 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×2"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, January 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "published": "Wed, 14 Jan 2026 00:47:38 +0000",
      "value_score": 40,
      "value_signals": [
        "Patch/update ×2",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Who Benefited from the Aisuru and Kimwolf Botnets?",
      "link": "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
      "summary": "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we'll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf's spread.",
      "published": "Thu, 08 Jan 2026 23:23:43 +0000",
      "value_score": 20,
      "value_signals": [
        "Botnet"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "The Kimwolf Botnet is Stalking Your Local Network",
      "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
      "summary": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.",
      "published": "Fri, 02 Jan 2026 14:20:10 +0000",
      "value_score": 26,
      "value_signals": [
        "Botnet",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Happy 16th Birthday, KrebsOnSecurity.com!",
      "link": "https://krebsonsecurity.com/2025/12/happy-16th-birthday-krebsonsecurity-com/",
      "summary": "KrebsOnSecurity.com celebrates its 16th anniversary today! A huge \"thank you\" to all of our readers -- newcomers, long-timers and drive-by critics alike. Your engagement this past year here has been tremendous and truly a salve on a handful of dark days. Happily, comeuppance was a strong theme running through our coverage in 2025, with a primary focus on entities that enabled complex and globally-dispersed cybercrime services.",
      "published": "Mon, 29 Dec 2025 20:23:26 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Dismantling Defenses: Trump 2.0 Cyber Year in Review",
      "link": "https://krebsonsecurity.com/2025/12/dismantling-defenses-trump-2-0-cyber-year-in-review/",
      "summary": "The Trump administration has pursued a staggering range of policy pivots this past year that threaten to weaken the nation’s ability and willingness to address a broad spectrum of technology challenges, from cybersecurity and privacy to countering disinformation, fraud and corruption. These shifts, along with the president’s efforts to restrict free speech and freedom of the press, have come at such a rapid clip that many readers probably aren’t even aware of them all.",
      "published": "Fri, 19 Dec 2025 15:14:55 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Most Parked Domains Now Serving Malicious Content",
      "link": "https://krebsonsecurity.com/2025/12/most-parked-domains-now-serving-malicious-content/",
      "summary": "Direct navigation -- the act of visiting a website by manually typing a domain name in a web browser -- has never been riskier: A new study finds the vast majority of \"parked\" domains -- mostly expired or dormant domain names, or common misspellings of popular websites -- are now configured to redirect visitors to sites that foist scams and malware.",
      "published": "Tue, 16 Dec 2025 14:14:48 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Microsoft Patch Tuesday, December 2025 Edition",
      "link": "https://krebsonsecurity.com/2025/12/microsoft-patch-tuesday-december-2025-edition/",
      "summary": "Microsoft today pushed updates to fix at least 56 security flaws in its Windows operating systems and supported software. This final Patch Tuesday of 2025 tackles one zero-day bug that is already being exploited, as well as two publicly disclosed vulnerabilities.",
      "published": "Tue, 09 Dec 2025 23:18:29 +0000",
      "value_score": 57,
      "value_signals": [
        "Zero-day",
        "Patch/update ×3",
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Asia Fumbles With Throttling Back Telnet Traffic in Region",
      "link": "https://www.darkreading.com/threat-intelligence/asia-fumbles-telnet-threat-traffic",
      "summary": "Only Taiwan made the top 10 list of governments, effectively blocking the threat-ridden protocol, but overall the region lagged in curbing Telnet traffic.",
      "published": "Wed, 11 Feb 2026 02:00:00 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "SolarWinds WHD Attacks Highlight Risks of Exposed Apps",
      "link": "https://www.darkreading.com/vulnerabilities-threats/solarwinds-whd-attacks-exposed-apps",
      "summary": "Organizations that have exposed their instances of Web Help Desk to the public Internet have inadvertently made them prime targets for attackers.",
      "published": "Tue, 10 Feb 2026 22:00:53 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "In Bypassing MFA, ZeroDayRAT Is 'Textbook Stalkerware'",
      "link": "https://www.darkreading.com/threat-intelligence/zerodayrat-brings-commercial-spyware-to-mass-market",
      "summary": "With access to SIM, location data, and a preview of recent SMSes, attackers have everything they need for account takeover or targeted social engineering.",
      "published": "Tue, 10 Feb 2026 21:37:15 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Microsoft Patches 6 Actively Exploited Zero-Days",
      "link": "https://www.darkreading.com/vulnerabilities-threats/microsoft-fixes-6-actively-exploited-zero-days",
      "summary": "Three of those zero-days are security feature bypass flaws, which give attackers a way to slip past built-in protections in multiple Microsoft products.",
      "published": "Tue, 10 Feb 2026 21:00:36 GMT",
      "value_score": 41,
      "value_signals": [
        "Active exploitation",
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "OT Attacks Get Scary With 'Living-off-the-Plant' Techniques",
      "link": "https://www.darkreading.com/ics-ot-security/ot-attacks-living-off-the-plant",
      "summary": "Ironically, security by obscurity has helped prevent dangerous OT attacks in recent years. It won't be that way forever.",
      "published": "Tue, 10 Feb 2026 16:14:29 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "TransUnion's Real Networks Deal Focuses on Robocall Blocking",
      "link": "https://www.darkreading.com/cyber-risk/transunion-s-real-networks-deal-focuses-on-robocall-blocking",
      "summary": "The acquisition allows the credit reporting agency to add SMS spam and scam prevention to its robocall blocking capabilities.",
      "published": "Mon, 09 Feb 2026 23:05:21 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Warlock Gang Breaches SmarterTools Via SmarterMail Bugs",
      "link": "https://www.darkreading.com/application-security/warlock-gang-breaches-smartertools-smartermail-bugs",
      "summary": "The ransomware group breached SmarterTools through a vulnerability in the company's own SmarterMail product.",
      "published": "Mon, 09 Feb 2026 21:59:02 GMT",
      "value_score": 28,
      "value_signals": [
        "Ransomware"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "TeamPCP Turns Cloud Infrastructure Into Crime Bots",
      "link": "https://www.darkreading.com/cloud-security/teampcp-cloud-infrastructure-crime-bots",
      "summary": "The threat actor has been compromising cloud environments at scale with automated worm-like attacks on exposed services and interfaces.",
      "published": "Mon, 09 Feb 2026 21:14:34 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Hacker Conversations: Professional Hacker Douglas Day",
      "link": "https://www.securityweek.com/hacker-conversations-professional-hacker-douglas-day/",
      "summary": "Day became a professional hacker by choice. But that doesn’t mean he isn’t a natural hacker. The post Hacker Conversations: Professional Hacker Douglas Day appeared first on SecurityWeek .",
      "published": "Wed, 11 Feb 2026 12:30:00 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Ivanti Patches Endpoint Manager Vulnerabilities Disclosed in October 2025",
      "link": "https://www.securityweek.com/ivanti-patches-endpoint-manager-vulnerabilities-disclosed-in-october-2025/",
      "summary": "It also fixed a high-severity authentication bypass that could be exploited remotely without authentication to obtain credentials. The post Ivanti Patches Endpoint Manager Vulnerabilities Disclosed in October 2025 appeared first on SecurityWeek .",
      "published": "Wed, 11 Feb 2026 12:14:51 +0000",
      "value_score": 39,
      "value_signals": [
        "Auth bypass",
        "Patch/update",
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "Chipmaker Patch Tuesday: Over 80 Vulnerabilities Addressed by Intel and AMD",
      "link": "https://www.securityweek.com/chipmaker-patch-tuesday-over-80-vulnerabilities-addressed-by-intel-and-amd/",
      "summary": "More than two dozen advisories have been published by the chip giants for vulnerabilities found recently in their products. The post Chipmaker Patch Tuesday: Over 80 Vulnerabilities Addressed by Intel and AMD appeared first on SecurityWeek .",
      "published": "Wed, 11 Feb 2026 11:00:00 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update ×2"
      ]
    },
    {
      "source": "Security Week",
      "title": "Fortinet Patches High-Severity Vulnerabilities",
      "link": "https://www.securityweek.com/fortinet-patches-high-severity-vulnerabilities/",
      "summary": "The bugs could be exploited without authentication for command execution and authentication bypass. The post Fortinet Patches High-Severity Vulnerabilities appeared first on SecurityWeek .",
      "published": "Wed, 11 Feb 2026 09:39:41 +0000",
      "value_score": 31,
      "value_signals": [
        "Auth bypass",
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "Google-Intel Security Audit Reveals Severe TDX Vulnerability Allowing Full Compromise",
      "link": "https://www.securityweek.com/google-intel-security-audit-reveals-severe-tdx-vulnerability-allowing-full-compromise/",
      "summary": "Dozens of vulnerabilities, bugs, and potential improvements have been identified by the tech giants’ security teams. The post Google-Intel Security Audit Reveals Severe TDX Vulnerability Allowing Full Compromise appeared first on SecurityWeek .",
      "published": "Wed, 11 Feb 2026 08:41:31 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "ICS Patch Tuesday: Vulnerabilities Addressed by Siemens, Schneider, Aveva, Phoenix Contact",
      "link": "https://www.securityweek.com/ics-patch-tuesday-vulnerabilities-addressed-by-siemens-schneider-aveva-phoenix-contact/",
      "summary": "Several vulnerabilities have been patched and mitigated across the industrial giants’ products. The post ICS Patch Tuesday: Vulnerabilities Addressed by Siemens, Schneider, Aveva, Phoenix Contact appeared first on SecurityWeek .",
      "published": "Wed, 11 Feb 2026 07:42:01 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update ×2"
      ]
    },
    {
      "source": "Security Week",
      "title": "6 Actively Exploited Zero-Days Patched by Microsoft With February 2026 Updates",
      "link": "https://www.securityweek.com/6-actively-exploited-zero-days-patched-by-microsoft-with-february-2026-updates/",
      "summary": "Microsoft’s Patch Tuesday updates fix roughly 60 vulnerabilities found in the company’s products. The post 6 Actively Exploited Zero-Days Patched by Microsoft With February 2026 Updates appeared first on SecurityWeek .",
      "published": "Tue, 10 Feb 2026 19:29:28 +0000",
      "value_score": 82,
      "value_signals": [
        "Active exploitation ×2",
        "Patch/update ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "EU Unconditionally Approves Google’s $32B Acquisition of Wiz",
      "link": "https://www.securityweek.com/eu-unconditionally-approves-googles-32b-acquisition-of-wiz/",
      "summary": "The European Commission’s ruling is based on extensive feedback from customers and rival cloud security and infrastructure vendors. The post EU Unconditionally Approves Google’s $32B Acquisition of Wiz appeared first on SecurityWeek .",
      "published": "Tue, 10 Feb 2026 18:00:36 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "summary": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "published": "Wed, 31 Aug 2022 12:57:48 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "published": "Tue, 30 Aug 2022 16:00:43 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "published": "Mon, 29 Aug 2022 14:56:19 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "published": "Fri, 26 Aug 2022 16:44:27 +0000",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "published": "Thu, 25 Aug 2022 18:47:15 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Twitter Whistleblower Complaint: The TL;DR Version",
      "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
      "summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk.",
      "published": "Wed, 24 Aug 2022 14:17:04 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
      "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
      "summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP.",
      "published": "Tue, 23 Aug 2022 13:19:58 +0000",
      "value_score": 50,
      "value_signals": [
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Fake Reservation Links Prey on Weary Travelers",
      "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
      "summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels.",
      "published": "Mon, 22 Aug 2022 13:59:06 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "CISA Alerts",
      "title": "Yokogawa FAST/TOOLS",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-041-01",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could allow an attacker to redirected users to malicious sites, decrypt communications, perform a man-in-the-middle (MITM) attack, execute malicious scripts, steal files, and perform other various attacks. The following versions of Yokogawa FAST/TOOLS are affected: FAST/TOOLS >=R9.01|<=R10.04 (CVE-2025-66594, CVE-2025-66595, CVE-2025-66597, CVE-2025-66598, CVE-2025-66599, CVE-2025-66600, CVE-2025-66601, CVE-2025-66602, CVE-2025-6",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×8",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "AVEVA PI Data Archive",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-041-03",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could result in a denial-of-service condition. The following versions of AVEVA PI Data Archive are affected: PI Data Archive PI Server <=2018_SP3_Patch_7 (CVE-2026-1507) PI Data Archive PI Server 2023 (CVE-2026-1507) PI Data Archive PI Server 2023_Patch_1 (CVE-2026-1507) PI Data Archive PI Server 2024 (CVE-2026-1507) CVSS Vendor Equipment Vulnerabilities v3 7.5 AVEVA AVEVA PI Data Archive Uncaught Exception Background Critical Infra",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 97,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "High severity",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "AVEVA PI to CONNECT Agent",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-041-04",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could result in an unauthorized access to the proxy server. The following versions of AVEVA PI to CONNECT Agent are affected: PI to CONNECT Agent <=v2.4.2520 (CVE-2026-1495) CVSS Vendor Equipment Vulnerabilities v3 6.5 AVEVA AVEVA PI to CONNECT Agent Insertion of Sensitive Information into Log File Background Critical Infrastructure Sectors: Critical Manufacturing Countries/Areas Deployed: Worldwide Company Headquarters Location: Un",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 75,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds Six Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/02/10/cisa-adds-six-known-exploited-vulnerabilities-catalog",
      "summary": "CISA has added six new vulnerabilities to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2026-21510 Microsoft Windows Shell Protection Mechanism Failure Vulnerability CVE-2026-21513 Microsoft MSHTML Framework Security Feature Bypass Vulnerability CVE-2026-21514 Microsoft Office Word Reliance on Untrusted Inputs in a Security Decision Vulnerability CVE-2026-21519 Microsoft Windows Type Confusion Vulnerability CVE-2026-21525 Microsoft Windows NULL",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×5",
        "CISA/KEV ×5",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "ZOLL ePCR IOS Mobile Application",
      "link": "https://www.cisa.gov/news-events/ics-medical-advisories/icsma-26-041-01",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an attacker to gain unauthorized access to protected health information (PHI) or device telemetry. The following versions of ZOLL ePCR IOS Mobile Application are affected: ePCR IOS Mobile Application 2.6.7 (CVE-2025-12699) CVSS Vendor Equipment Vulnerabilities v3 5.5 ZOLL ZOLL ePCR IOS Mobile Application Insertion of Sensitive Information into Externally-Accessible File or Directory Background Critical Infrastructure Sec",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 67,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Poland Energy Sector Cyber Incident Highlights OT and ICS Security Gaps",
      "link": "https://www.cisa.gov/news-events/alerts/2026/02/10/poland-energy-sector-cyber-incident-highlights-ot-and-ics-security-gaps",
      "summary": "The purpose of this Alert is to amplify Poland’s Computer Emergency Response Team (CERT Polska’s) Energy Sector Incident Report published on Jan. 30, 2026, and highlight key mitigations for Energy Sector stakeholders. In December 2025, a malicious cyber actor(s) targeted and compromised operational technology (OT) and industrial control systems (ICS) in Poland’s Energy Sector—specifically renewable energy plants, a combined heat and power plant, and a manufacturing sector company—in a cyber inci",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 35,
      "value_signals": [
        "Source boost: CISA Alerts"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "​​Barriers to Secure OT Communication: Why Johnny Can’t Authenticate​",
      "link": "https://www.cisa.gov/resources-tools/resources/barriers-secure-ot-communication-why-johnny-cant-authenticate",
      "summary": "CISA released the guidance, Barriers to Secure OT Communication: Why Johnny Can’t Authenticate , which highlights the known issues with insecure-by-design legacy industrial protocols and seeks to understand why the technology to secure these protocols is not widely adopted. CISA developed this guidance in partnership with operational technology (OT) equipment manufacturers and standard development organizations, by interviewing OT asset owners and operators to understand: What motivates owners a",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 75,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "ZLAN Information Technology Co. ZLAN5143D",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-041-02",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could result in an attacker bypassing authentication, or resetting the device password. The following versions of ZLAN Information Technology Co. ZLAN5143D are affected: ZLAN5143D v1.600 (CVE-2026-25084, CVE-2026-24789) CVSS Vendor Equipment Vulnerabilities v3 9.8 ZLAN Information Technology Co. ZLAN Information Technology Co. ZLAN5143D Missing Authentication for Critical Function Background Critical Infrastructure Sectors: Criti",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "High severity ×2",
        "Multiple CVEs",
        "Exploit wording"
      ]
    }
  ],
  "sources": [
    "The Hacker News",
    "BleepingComputer",
    "Krebs on Security",
    "Dark Reading",
    "Security Week",
    "Naked Security",
    "Threatpost",
    "CISA Alerts"
  ]
}