{
  "last_updated": "2026-02-12 12:56",
  "sources_count": 8,
  "articles_count": 56,
  "keywords": [
    "webinar today identity",
    "scattered lapsus shinyhunters",
    "bulletproof hosting infrastructure",
    "badbox 2 0",
    "50 security holes",
    "arbitrary code execution",
    "windows operating systems",
    "curbing telnet traffic",
    "ics security gaps",
    "twitter whistleblower complaint",
    "private sector firms",
    "open source siem",
    "increasingly sophisticated threats",
    "dyld system component",
    "100 million since",
    "vulnerabilities earned microsoft's",
    "various windows components",
    "windows security warnings",
    "apple devices apple",
    "today we'll dig"
  ],
  "trending": [
    {
      "keyword": "webinar today identity",
      "mentions": 10
    },
    {
      "keyword": "scattered lapsus shinyhunters",
      "mentions": 64
    },
    {
      "keyword": "bulletproof hosting infrastructure",
      "mentions": 3
    },
    {
      "keyword": "badbox 2 0",
      "mentions": 95
    },
    {
      "keyword": "50 security holes",
      "mentions": 14
    },
    {
      "keyword": "arbitrary code execution",
      "mentions": 80
    },
    {
      "keyword": "windows operating systems",
      "mentions": 294
    },
    {
      "keyword": "curbing telnet traffic",
      "mentions": 15
    },
    {
      "keyword": "ics security gaps",
      "mentions": 22
    },
    {
      "keyword": "twitter whistleblower complaint",
      "mentions": 665
    }
  ],
  "articles": [
    {
      "source": "The Hacker News",
      "title": "ThreatsDay Bulletin: AI Prompt RCE, Claude 0-Click, RenEngine Loader, Auto 0-Days & 25+ Stories",
      "link": "https://thehackernews.com/2026/02/threatsday-bulletin-ai-prompt-rce.html",
      "summary": "Threat activity this week shows one consistent signal — attackers are leaning harder on what already works. Instead of flashy new exploits, many operations are built around quiet misuse of trusted tools, familiar workflows, and overlooked exposures that sit in plain sight. Another shift is how access is gained versus how it’s used. Initial entry points are getting simpler, while post-compromise",
      "published": "Thu, 12 Feb 2026 17:21:00 +0530",
      "value_score": 36,
      "value_signals": [
        "RCE",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "The CTEM Divide: Why 84% of Security Programs Are Falling Behind",
      "link": "https://thehackernews.com/2026/02/the-ctem-divide-why-84-of-security.html",
      "summary": "A new 2026 market intelligence study of 128 enterprise security decision-makers (available here) reveals a stark divide forming between organizations – one that has nothing to do with budget size or industry and everything to do with a single framework decision. Organizations implementing Continuous Threat Exposure Management (CTEM) demonstrate 50% better attack surface visibility, 23-point",
      "published": "Thu, 12 Feb 2026 16:00:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "83% of Ivanti EPMM Exploits Linked to Single IP on Bulletproof Hosting Infrastructure",
      "link": "https://thehackernews.com/2026/02/83-of-ivanti-epmm-exploits-linked-to.html",
      "summary": "A significant chunk of the exploitation attempts targeting a newly disclosed security flaw in Ivanti Endpoint Manager Mobile (EPMM) can be traced back to a single IP address on bulletproof hosting infrastructure offered by PROSPERO. Threat intelligence firm GreyNoise said it recorded 417 exploitation sessions from 8 unique source IP addresses between February 1 and 9, 2026. An estimated 346",
      "published": "Thu, 12 Feb 2026 13:02:00 +0530",
      "value_score": 16,
      "value_signals": [
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Apple Fixes Exploited Zero-Day Affecting iOS, macOS, and Apple Devices",
      "link": "https://thehackernews.com/2026/02/apple-fixes-exploited-zero-day.html",
      "summary": "Apple on Wednesday released iOS, iPadOS, macOS Tahoe, tvOS, watchOS, and visionOS updates to address a zero-day flaw that it said has been exploited in sophisticated cyber attacks. The vulnerability, tracked as CVE-2026-20700 (CVSS score: N/A), has been described as a memory corruption issue in dyld, Apple's Dynamic Link Editor. Successful exploitation of the vulnerability could allow an",
      "published": "Thu, 12 Feb 2026 11:09:00 +0530",
      "value_score": 84,
      "value_signals": [
        "CVE mentioned",
        "Zero-day ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "First Malicious Outlook Add-In Found Stealing 4,000+ Microsoft Credentials",
      "link": "https://thehackernews.com/2026/02/first-malicious-outlook-add-in-found.html",
      "summary": "Cybersecurity researchers have discovered what they said is the first known malicious Microsoft Outlook add-in detected in the wild. In this unusual supply chain attack detailed by Koi Security, an unknown attacker claimed the domain associated with a now-abandoned legitimate add-in to serve a fake Microsoft login page, stealing over 4,000 credentials in the process. The activity has been",
      "published": "Wed, 11 Feb 2026 23:15:00 +0530",
      "value_score": 35,
      "value_signals": [
        "Active exploitation"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "APT36 and SideCopy Launch Cross-Platform RAT Campaigns Against Indian Entities",
      "link": "https://thehackernews.com/2026/02/apt36-and-sidecopy-launch-cross.html",
      "summary": "Indian defense sector and government-aligned organizations have been targeted by multiple campaigns that are designed to compromise Windows and Linux environments with remote access trojans capable of stealing sensitive data and ensuring continued access to infected machines. The campaigns are characterized by the use of malware families like Geta RAT, Ares RAT, and DeskRAT, which are often",
      "published": "Wed, 11 Feb 2026 20:22:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "The Hacker News",
      "title": "Over 60 Software Vendors Issue Security Fixes Across OS, Cloud, and Network Platforms",
      "link": "https://thehackernews.com/2026/02/over-60-software-vendors-issue-security.html",
      "summary": "It's Patch Tuesday, which means a number of software vendors have released patches for various security vulnerabilities impacting their products and services. Microsoft issued fixes for 59 flaws, including six actively exploited zero-days in various Windows components that could be abused to bypass security features, escalate privileges, and trigger a denial-of-service (DoS) condition. Elsewhere",
      "published": "Wed, 11 Feb 2026 18:58:00 +0530",
      "value_score": 49,
      "value_signals": [
        "Active exploitation",
        "Patch/update",
        "Exploit wording"
      ]
    },
    {
      "source": "The Hacker News",
      "title": "Exposed Training Open the Door for Crypto-Mining in Fortune 500 Cloud Environments",
      "link": "https://thehackernews.com/2026/02/exposed-training-open-door-for-crypto.html",
      "summary": "Intentionally vulnerable training applications are widely used for security education, internal testing, and product demonstrations. Tools such as OWASP Juice Shop, DVWA, Hackazon, and bWAPP are designed to be insecure by default, making them useful for learning how common attack techniques work in controlled environments. The issue is not the applications themselves, but how they are often",
      "published": "Wed, 11 Feb 2026 17:00:00 +0530",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Google says hackers are abusing Gemini AI for all attacks stages",
      "link": "https://www.bleepingcomputer.com/news/security/google-says-hackers-are-abusing-gemini-ai-for-all-attacks-stages/",
      "summary": "Google Threat Intelligence Group (GTIG) has published a new report warning about AI model extraction/distillation attacks, in which private-sector firms and researchers use legitimate API access to systematically probe models and replicate their logic and reasoning. [...]",
      "published": "Thu, 12 Feb 2026 02:00:00 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "Apple fixes zero-day flaw used in 'extremely sophisticated' attacks",
      "link": "https://www.bleepingcomputer.com/news/security/apple-fixes-zero-day-flaw-used-in-extremely-sophisticated-attacks/",
      "summary": "Apple has released security updates to fix a zero-day vulnerability that was exploited in an \"extremely sophisticated attack\" targeting specific individuals. [...]",
      "published": "Wed, 11 Feb 2026 20:06:05 -0500",
      "value_score": 74,
      "value_signals": [
        "Zero-day ×2",
        "Patch/update",
        "Exploit wording"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Windows 11 Notepad flaw let files execute silently via Markdown links",
      "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-notepad-flaw-let-files-execute-silently-via-markdown-links/",
      "summary": "Microsoft has fixed a \"remote code execution\" vulnerability in Windows 11 Notepad that allowed attackers to execute local or remote programs by tricking users into clicking specially crafted Markdown links, without displaying any Windows security warnings. [...]",
      "published": "Wed, 11 Feb 2026 18:15:41 -0500",
      "value_score": 38,
      "value_signals": [
        "RCE",
        "Patch/update"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Microsoft Store Outlook add-in hijacked to steal 4,000 Microsoft accounts",
      "link": "https://www.bleepingcomputer.com/news/security/microsoft-store-outlook-add-in-hijacked-to-steal-4-000-microsoft-accounts/",
      "summary": "The AgreeTo add-in for Outlook has been hijacked and turned into a phishing kit that stole more than 4,000 Microsoft account credentials. [...]",
      "published": "Wed, 11 Feb 2026 16:53:58 -0500",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Crazy ransomware gang abuses employee monitoring tool in attacks",
      "link": "https://www.bleepingcomputer.com/news/security/crazy-ransomware-gang-abuses-employee-monitoring-tool-in-attacks/",
      "summary": "A member of the Crazy ransomware gang is abusing legitimate employee monitoring software and the SimpleHelp remote support tool to maintain persistence in corporate networks, evade detection, and prepare for ransomware deployment. [...]",
      "published": "Wed, 11 Feb 2026 14:29:14 -0500",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×3"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Police arrest seller of JokerOTP MFA passcode capturing tool",
      "link": "https://www.bleepingcomputer.com/news/security/police-arrest-seller-of-jokerotp-mfa-passcode-capturing-tool/",
      "summary": "The Netherlands Police have arrested a a 21-year-old man from Dordrecht, suspected of selling access to the JokerOTP phishing automation tool that can intercept one-time passwords (OTP) for hijacking accounts. [...]",
      "published": "Wed, 11 Feb 2026 14:14:32 -0500",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "BleepingComputer",
      "title": "Proactive strategies for cyber resilience with Wazuh",
      "link": "https://www.bleepingcomputer.com/news/security/proactive-strategies-for-cyber-resilience-with-wazuh/",
      "summary": "Cyber resilience means anticipating threats, detecting them early, and recovering fast when incidents occur. Wazuh shows how its open source SIEM and XDR unify visibility, detection, and automated response to strengthen proactive defense. [...]",
      "published": "Wed, 11 Feb 2026 12:40:28 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "BleepingComputer",
      "title": "LummaStealer infections surge after CastleLoader malware campaigns",
      "link": "https://www.bleepingcomputer.com/news/security/lummastealer-infections-surge-after-castleloader-malware-campaigns/",
      "summary": "A surge in LummaStealer infections has been observed, driven by social engineering campaigns leveraging the ClickFix technique to deliver the CastleLoader malware. [...]",
      "published": "Wed, 11 Feb 2026 12:02:29 -0500",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Swamps Anonymity Network I2P",
      "link": "https://krebsonsecurity.com/2026/02/kimwolf-botnet-swamps-anonymity-network-i2p/",
      "summary": "For the past week, the massive \"Internet of Things\" (IoT) botnet known as Kimwolf has been disrupting the The Invisible Internet Project (I2P), a decentralized, encrypted communications network designed to anonymize and secure online communications. I2P users started reporting disruptions in the network around the same time the Kimwolf botmasters began relying on it to evade takedown attempts against the botnet's control servers.",
      "published": "Wed, 11 Feb 2026 16:08:11 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×3"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, February 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/02/patch-tuesday-february-2026-edition/",
      "summary": "Microsoft today released updates to fix more than 50 security holes in its Windows operating systems and other software, including patches for a whopping six \"zero-day\" vulnerabilities that attackers are already exploiting in the wild.",
      "published": "Tue, 10 Feb 2026 21:49:53 +0000",
      "value_score": 82,
      "value_signals": [
        "Zero-day",
        "Active exploitation",
        "Patch/update ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Please Don’t Feed the Scattered Lapsus ShinyHunters",
      "link": "https://krebsonsecurity.com/2026/02/please-dont-feed-the-scattered-lapsus-shiny-hunters/",
      "summary": "A prolific data ransom gang that calls itself Scattered Lapsus ShinyHunters (SLSH) has a distinctive playbook when it seeks to extort payment from victim firms: Harassing, threatening and even swatting executives and their families, all while notifying journalists and regulators… Read More »",
      "published": "Mon, 02 Feb 2026 16:15:16 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Krebs on Security",
      "title": "Who Operates the Badbox 2.0 Botnet?",
      "link": "https://krebsonsecurity.com/2026/01/who-operates-the-badbox-2-0-botnet/",
      "summary": "The cybercriminals in control of Kimwolf -- a disruptive botnet that has infected more than 2 million devices -- recently shared a screenshot indicating they'd compromised the control panel for Badbox 2.0, a vast China-based botnet powered by malicious software that comes pre-installed on many Android TV streaming boxes. Both the FBI and Google say they are hunting for the people behind Badbox 2.0, and thanks to bragging by the Kimwolf botmasters we may now have a much clearer idea about that.",
      "published": "Mon, 26 Jan 2026 16:11:38 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×3"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
      "link": "https://krebsonsecurity.com/2026/01/kimwolf-botnet-lurking-in-corporate-govt-networks/",
      "summary": "A new Internet-of-Things botnet called Kimwolf has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf's ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks.",
      "published": "Tue, 20 Jan 2026 18:19:13 +0000",
      "value_score": 30,
      "value_signals": [
        "Botnet ×2"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Patch Tuesday, January 2026 Edition",
      "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
      "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today.",
      "published": "Wed, 14 Jan 2026 00:47:38 +0000",
      "value_score": 40,
      "value_signals": [
        "Patch/update ×2",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "Who Benefited from the Aisuru and Kimwolf Botnets?",
      "link": "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
      "summary": "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we'll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf's spread.",
      "published": "Thu, 08 Jan 2026 23:23:43 +0000",
      "value_score": 20,
      "value_signals": [
        "Botnet"
      ]
    },
    {
      "source": "Krebs on Security",
      "title": "The Kimwolf Botnet is Stalking Your Local Network",
      "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
      "summary": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date.",
      "published": "Fri, 02 Jan 2026 14:20:10 +0000",
      "value_score": 26,
      "value_signals": [
        "Botnet",
        "Exploit wording"
      ]
    },
    {
      "source": "Dark Reading",
      "title": "Senegalese Data Breaches Expose Lack of 'Security Maturity'",
      "link": "https://www.darkreading.com/cyberattacks-data-breaches/hackers-breach-senegal-national-biometric-database",
      "summary": "Green Blood Group steals personal records and biometric data of the West African nation's nearly 20 million residents.",
      "published": "Thu, 12 Feb 2026 09:00:00 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "North Korea's UNC1069 Hammers Crypto Firms With AI",
      "link": "https://www.darkreading.com/threat-intelligence/north-koreas-unc1069-hammers-crypto-firms",
      "summary": "In moving away from traditional banks to focus on Web3 companies, the threat actor is leveraging LLMs, deepfakes, legitimate platforms, and ClickFix.",
      "published": "Wed, 11 Feb 2026 21:56:11 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "AI Rising: Do We Know Enough About the Data Populating It?",
      "link": "https://www.darkreading.com/data-privacy/do-we-know-enough-about-data-populating-ai",
      "summary": "Organizations remain reluctant to address the fact that AI can dangerously expose business operations as well as personal data.",
      "published": "Wed, 11 Feb 2026 14:31:47 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Top Cyber Industry Defenses Spike CO2 Emissions",
      "link": "https://www.darkreading.com/application-security/cyber-industry-defenses-co2-emissions",
      "summary": "Organizations can improve their climate footprints by optimizing two specific cybersecurity protections, without incurring added risks.",
      "published": "Wed, 11 Feb 2026 14:00:00 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Asia Fumbles With Throttling Back Telnet Traffic in Region",
      "link": "https://www.darkreading.com/threat-intelligence/asia-fumbles-telnet-threat-traffic",
      "summary": "Only Taiwan made the top 10 list of governments, effectively blocking the threat-ridden protocol, but overall, the region lagged in curbing Telnet traffic.",
      "published": "Wed, 11 Feb 2026 02:00:00 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "SolarWinds WHD Attacks Highlight Risks of Exposed Apps",
      "link": "https://www.darkreading.com/vulnerabilities-threats/solarwinds-whd-attacks-exposed-apps",
      "summary": "Organizations that have exposed their instances of Web Help Desk to the public Internet have inadvertently made them prime targets for attackers.",
      "published": "Tue, 10 Feb 2026 22:00:53 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "In Bypassing MFA, ZeroDayRAT Is 'Textbook Stalkerware'",
      "link": "https://www.darkreading.com/threat-intelligence/zerodayrat-brings-commercial-spyware-to-mass-market",
      "summary": "With access to SIM, location data, and a preview of recent SMSes, attackers have everything they need for account takeover or targeted social engineering.",
      "published": "Tue, 10 Feb 2026 21:37:15 GMT",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Dark Reading",
      "title": "Microsoft Patches 6 Actively Exploited Zero-Days",
      "link": "https://www.darkreading.com/vulnerabilities-threats/microsoft-fixes-6-actively-exploited-zero-days",
      "summary": "Three of those zero-days are security feature bypass flaws, which give attackers a way to slip past built-in protections in multiple Microsoft products.",
      "published": "Tue, 10 Feb 2026 21:00:36 GMT",
      "value_score": 41,
      "value_signals": [
        "Active exploitation",
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "ApolloMD Data Breach Impacts 626,000 Individuals",
      "link": "https://www.securityweek.com/apollomd-data-breach-impacts-626000-individuals/",
      "summary": "The company says hackers stole the personal information of patients of affiliated physicians and practices. The post ApolloMD Data Breach Impacts 626,000 Individuals appeared first on SecurityWeek .",
      "published": "Thu, 12 Feb 2026 12:23:33 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Security Week",
      "title": "Microsoft to Enable ‘Windows Baseline Security’ With New Runtime Integrity Safeguards",
      "link": "https://www.securityweek.com/microsoft-to-enable-windows-baseline-security-with-new-runtime-integrity-safeguards/",
      "summary": "Windows will have runtime safeguards enabled by default, ensuring that only properly signed software runs. The post Microsoft to Enable ‘Windows Baseline Security’ With New Runtime Integrity Safeguards appeared first on SecurityWeek .",
      "published": "Thu, 12 Feb 2026 11:27:30 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Hacktivists, State Actors, Cybercriminals Target Global Defense Industry, Google Warns",
      "link": "https://www.securityweek.com/hacktivists-state-actors-cybercriminals-target-global-defense-industry-google-warns/",
      "summary": "Threat actors from Russia, China, North Korea and Iran have been observed launching attacks. The post Hacktivists, State Actors, Cybercriminals Target Global Defense Industry, Google Warns appeared first on SecurityWeek .",
      "published": "Thu, 12 Feb 2026 11:12:46 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Nucleus Raises $20 Million for Exposure Management",
      "link": "https://www.securityweek.com/nucleus-raises-20-million-for-exposure-management/",
      "summary": "The company will use the investment to scale operations and deepen intelligence and automation. The post Nucleus Raises $20 Million for Exposure Management appeared first on SecurityWeek .",
      "published": "Thu, 12 Feb 2026 09:09:02 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Apple Patches iOS Zero-Day Exploited in ‘Extremely Sophisticated Attack’",
      "link": "https://www.securityweek.com/apple-patches-ios-zero-day-exploited-in-extremely-sophisticated-attack/",
      "summary": "Impacting the ‘dyld’ system component, the memory corruption issue can be exploited for arbitrary code execution. The post Apple Patches iOS Zero-Day Exploited in ‘Extremely Sophisticated Attack’ appeared first on SecurityWeek .",
      "published": "Thu, 12 Feb 2026 07:48:35 +0000",
      "value_score": 66,
      "value_signals": [
        "Zero-day ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "Security Week",
      "title": "Nevada Unveils New Statewide Data Classification Policy Months After Cyberattack",
      "link": "https://www.securityweek.com/nevada-unveils-new-statewide-data-classification-policy-months-after-cyberattack/",
      "summary": "Officials said data will now be classified as one of four categories: “public,” “sensitive,” “confidential” or “restricted.” The post Nevada Unveils New Statewide Data Classification Policy Months After Cyberattack appeared first on SecurityWeek .",
      "published": "Wed, 11 Feb 2026 19:50:13 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "Webinar Today: Identity Under Attack – Strengthen Your Identity Defenses",
      "link": "https://www.securityweek.com/webinar-today-identity-under-attack-strengthen-your-identity-defenses/",
      "summary": "Gain practical insights on balancing security, user experience, and operational efficiency while staying ahead of increasingly sophisticated threats. The post Webinar Today: Identity Under Attack – Strengthen Your Identity Defenses appeared first on SecurityWeek .",
      "published": "Wed, 11 Feb 2026 15:05:53 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Security Week",
      "title": "GitGuardian Raises $50 Million for Secrets and Non-Human Identity Security",
      "link": "https://www.securityweek.com/gitguardian-raises-50-million-for-secrets-and-non-human-identity-security/",
      "summary": "The secrets security company has raised more than $100 million since its creation in 2017. The post GitGuardian Raises $50 Million for Secrets and Non-Human Identity Security appeared first on SecurityWeek .",
      "published": "Wed, 11 Feb 2026 14:11:38 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Student Loan Breach Exposes 2.5M Records",
      "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
      "summary": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
      "published": "Wed, 31 Aug 2022 12:57:48 +0000",
      "value_score": 34,
      "value_signals": [
        "Breach/leak ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Watering Hole Attacks Push ScanBox Keylogger",
      "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
      "summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
      "published": "Tue, 30 Aug 2022 16:00:43 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
      "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
      "summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
      "published": "Mon, 29 Aug 2022 14:56:19 +0000",
      "value_score": 18,
      "value_signals": [
        "Phishing"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Ransomware Attacks are on the Rise",
      "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
      "summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
      "published": "Fri, 26 Aug 2022 16:44:27 +0000",
      "value_score": 46,
      "value_signals": [
        "Ransomware ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
      "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
      "summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
      "published": "Thu, 25 Aug 2022 18:47:15 +0000",
      "value_score": 26,
      "value_signals": [
        "Patch/update",
        "High severity"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Twitter Whistleblower Complaint: The TL;DR Version",
      "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
      "summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk.",
      "published": "Wed, 24 Aug 2022 14:17:04 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "Threatpost",
      "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
      "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
      "summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP.",
      "published": "Tue, 23 Aug 2022 13:19:58 +0000",
      "value_score": 50,
      "value_signals": [
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "Threatpost",
      "title": "Fake Reservation Links Prey on Weary Travelers",
      "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
      "summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels.",
      "published": "Mon, 22 Aug 2022 13:59:06 +0000",
      "value_score": 10,
      "value_signals": []
    },
    {
      "source": "CISA Alerts",
      "title": "Yokogawa FAST/TOOLS",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-041-01",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could allow an attacker to redirected users to malicious sites, decrypt communications, perform a man-in-the-middle (MITM) attack, execute malicious scripts, steal files, and perform other various attacks. The following versions of Yokogawa FAST/TOOLS are affected: FAST/TOOLS >=R9.01|<=R10.04 (CVE-2025-66594, CVE-2025-66595, CVE-2025-66597, CVE-2025-66598, CVE-2025-66599, CVE-2025-66600, CVE-2025-66601, CVE-2025-66602, CVE-2025-6",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 89,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×8",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "AVEVA PI Data Archive",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-041-03",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could result in a denial-of-service condition. The following versions of AVEVA PI Data Archive are affected: PI Data Archive PI Server <=2018_SP3_Patch_7 (CVE-2026-1507) PI Data Archive PI Server 2023 (CVE-2026-1507) PI Data Archive PI Server 2023_Patch_1 (CVE-2026-1507) PI Data Archive PI Server 2024 (CVE-2026-1507) CVSS Vendor Equipment Vulnerabilities v3 7.5 AVEVA AVEVA PI Data Archive Uncaught Exception Background Critical Infra",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 97,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×4",
        "High severity",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "AVEVA PI to CONNECT Agent",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-041-04",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could result in an unauthorized access to the proxy server. The following versions of AVEVA PI to CONNECT Agent are affected: PI to CONNECT Agent <=v2.4.2520 (CVE-2026-1495) CVSS Vendor Equipment Vulnerabilities v3 6.5 AVEVA AVEVA PI to CONNECT Agent Insertion of Sensitive Information into Log File Background Critical Infrastructure Sectors: Critical Manufacturing Countries/Areas Deployed: Worldwide Company Headquarters Location: Un",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 75,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "High severity ×2",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "CISA Adds Six Known Exploited Vulnerabilities to Catalog",
      "link": "https://www.cisa.gov/news-events/alerts/2026/02/10/cisa-adds-six-known-exploited-vulnerabilities-catalog",
      "summary": "CISA has added six new vulnerabilities to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2026-21510 Microsoft Windows Shell Protection Mechanism Failure Vulnerability CVE-2026-21513 Microsoft MSHTML Framework Security Feature Bypass Vulnerability CVE-2026-21514 Microsoft Office Word Reliance on Untrusted Inputs in a Security Decision Vulnerability CVE-2026-21519 Microsoft Windows Type Confusion Vulnerability CVE-2026-21525 Microsoft Windows NULL",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×5",
        "CISA/KEV ×5",
        "Multiple CVEs",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "ZOLL ePCR IOS Mobile Application",
      "link": "https://www.cisa.gov/news-events/ics-medical-advisories/icsma-26-041-01",
      "summary": "View CSAF Summary Successful exploitation of this vulnerability could allow an attacker to gain unauthorized access to protected health information (PHI) or device telemetry. The following versions of ZOLL ePCR IOS Mobile Application are affected: ePCR IOS Mobile Application 2.6.7 (CVE-2025-12699) CVSS Vendor Equipment Vulnerabilities v3 5.5 ZOLL ZOLL ePCR IOS Mobile Application Insertion of Sensitive Information into Externally-Accessible File or Directory Background Critical Infrastructure Sec",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 67,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned",
        "High severity",
        "Exploit wording"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "Poland Energy Sector Cyber Incident Highlights OT and ICS Security Gaps",
      "link": "https://www.cisa.gov/news-events/alerts/2026/02/10/poland-energy-sector-cyber-incident-highlights-ot-and-ics-security-gaps",
      "summary": "The purpose of this Alert is to amplify Poland’s Computer Emergency Response Team (CERT Polska’s) Energy Sector Incident Report published on Jan. 30, 2026, and highlight key mitigations for Energy Sector stakeholders. In December 2025, a malicious cyber actor(s) targeted and compromised operational technology (OT) and industrial control systems (ICS) in Poland’s Energy Sector—specifically renewable energy plants, a combined heat and power plant, and a manufacturing sector company—in a cyber inci",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 35,
      "value_signals": [
        "Source boost: CISA Alerts"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "​​Barriers to Secure OT Communication: Why Johnny Can’t Authenticate​",
      "link": "https://www.cisa.gov/resources-tools/resources/barriers-secure-ot-communication-why-johnny-cant-authenticate",
      "summary": "CISA released the guidance, Barriers to Secure OT Communication: Why Johnny Can’t Authenticate , which highlights the known issues with insecure-by-design legacy industrial protocols and seeks to understand why the technology to secure these protocols is not widely adopted. CISA developed this guidance in partnership with operational technology (OT) equipment manufacturers and standard development organizations, by interviewing OT asset owners and operators to understand: What motivates owners a",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 75,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CISA/KEV ×2"
      ]
    },
    {
      "source": "CISA Alerts",
      "title": "ZLAN Information Technology Co. ZLAN5143D",
      "link": "https://www.cisa.gov/news-events/ics-advisories/icsa-26-041-02",
      "summary": "View CSAF Summary Successful exploitation of these vulnerabilities could result in an attacker bypassing authentication, or resetting the device password. The following versions of ZLAN Information Technology Co. ZLAN5143D are affected: ZLAN5143D v1.600 (CVE-2026-25084, CVE-2026-24789) CVSS Vendor Equipment Vulnerabilities v3 9.8 ZLAN Information Technology Co. ZLAN Information Technology Co. ZLAN5143D Missing Authentication for Critical Function Background Critical Infrastructure Sectors: Criti",
      "published": "Tue, 10 Feb 26 12:00:00 +0000",
      "value_score": 100,
      "value_signals": [
        "Source boost: CISA Alerts",
        "CVE mentioned ×2",
        "High severity ×2",
        "Multiple CVEs",
        "Exploit wording"
      ]
    }
  ],
  "sources": [
    "The Hacker News",
    "BleepingComputer",
    "Krebs on Security",
    "Dark Reading",
    "Security Week",
    "Naked Security",
    "Threatpost",
    "CISA Alerts"
  ]
}